{
  "statute_name": "Connecticut Privacy Law",
  "effective_date": "July 1, 2023",
  "definitions": {
    "Affiliate": {
      "term": "Affiliate",
      "definition": "a legal entity that shares common branding with another legal entity or controls, is controlled by or is under common control with another legal entity. For the purposes of this subdivision, \"control\" or \"controlled\" means (A) ownership of, or the power to vote, more than fifty per cent of the outstanding shares of any class of voting security of a company, (B) control in any manner over the election of a majority of the directors or of individuals exercising similar functions, or (C) the power to exercise controlling influence over the management of a company.",
      "section": "1",
      "notes": ""
    },
    "Authenticate": {
      "term": "Authenticate",
      "definition": "to use reasonable means to determine that a request to exercise any of the rights afforded under subdivisions (1) to (4), inclusive, of subsection (a) of section 4 of this act is being made by, or on behalf of, the consumer who is entitled to exercise such consumer rights with respect to the personal data at issue.",
      "section": "1",
      "notes": ""
    },
    "Biometric data": {
      "term": "Biometric data",
      "definition": "data generated by automatic measurements of an individual's biological characteristics, such as a fingerprint, a voiceprint, eye retinas, irises or other unique biological patterns or characteristics that are used to identify a specific individual. \"Biometric data\" does not include (A) a digital or physical photograph, (B) an audio or video recording, or (C) any data generated from a digital or physical photograph, or an audio or video recording, unless such data is generated to identify a specific individual.",
      "section": "1",
      "notes": ""
    },
    "Business associate": {
      "term": "Business associate",
      "definition": "has the same meaning as provided in HIPAA.",
      "section": "1",
      "notes": ""
    },
    "Child": {
      "term": "Child",
      "definition": "has the same meaning as provided in COPPA.",
      "section": "1",
      "notes": ""
    },
    "Consent": {
      "term": "Consent",
      "definition": "a clear affirmative act signifying a consumer's freely given, specific, informed and unambiguous agreement to allow the processing of personal data relating to the consumer. \"Consent\" may include a written statement, including by electronic means, or any other unambiguous affirmative action. \"Consent\" does not include (A) acceptance of a general or broad terms of use or similar document that contains descriptions of personal data processing along with other, unrelated information, (B) hovering over, muting, pausing or closing a given piece of content, or (C) agreement obtained through the use of dark patterns.",
      "section": "1",
      "notes": ""
    },
    "Consumer": {
      "term": "Consumer",
      "definition": "an individual who is a resident of this state. \"Consumer\" does not include an individual acting in a commercial or employment context or as an employee, owner, director, officer or contractor of a company, partnership, sole proprietorship, nonprofit or government agency whose communications or transactions with the controller occur solely within the context of that individual's role with the company, partnership, sole proprietorship, nonprofit or government agency.",
      "section": "1",
      "notes": ""
    },
    "Controller": {
      "term": "Controller",
      "definition": "an individual who, or legal entity that, alone or jointly with others determines the purpose and means of processing personal data.",
      "section": "1",
      "notes": ""
    },
    "COPPA": {
      "term": "COPPA",
      "definition": "the Children's Online Privacy Protection Act of 1998, 15 USC 6501 et seq., and the regulations, rules, guidance and exemptions adopted pursuant to said act, as said act and such regulations, rules, guidance and exemptions may be amended from time to time.",
      "section": "1",
      "notes": ""
    },
    "Covered entity": {
      "term": "Covered entity",
      "definition": "has the same meaning as provided in HIPAA.",
      "section": "1",
      "notes": ""
    },
    "Dark pattern": {
      "term": "Dark pattern",
      "definition": "(A) means a user interface designed or manipulated with the substantial effect of subverting or impairing user autonomy, decision-making or choice, and (B) includes, but is not limited to, any practice the Federal Trade Commission refers to as a \"dark pattern\".",
      "section": "1",
      "notes": ""
    },
    "Decisions that produce legal or similarly significant effects concerning the consumer": {
      "term": "Decisions that produce legal or similarly significant effects concerning the consumer",
      "definition": "decisions made by the controller that result in the provision or denial by the controller of financial or lending services, housing, insurance, education enrollment or opportunity, criminal justice, employment opportunities, health care services or access to essential goods or services.",
      "section": "1",
      "notes": ""
    },
    "De-identified data": {
      "term": "De-identified data",
      "definition": "data that cannot reasonably be used to infer information about, or otherwise be linked to, an identified or identifiable individual, or a device linked to such individual, if the controller that possesses such data (A) takes reasonable measures to ensure that such data cannot be associated with an individual, (B) publicly commits to process such data only in a de-identified fashion and not attempt to re-identify such data, and (C) contractually obligates any recipients of such data to satisfy the criteria set forth in subparagraphs (A) and (B) of this subdivision.",
      "section": "1",
      "notes": ""
    },
    "HIPAA": {
      "term": "HIPAA",
      "definition": "the Health Insurance Portability and Accountability Act of 1996, 42 USC 1320d et seq., as amended from time to time.",
      "section": "1",
      "notes": ""
    },
    "Identified or identifiable individual": {
      "term": "Identified or identifiable individual",
      "definition": "an individual who can be readily identified, directly or indirectly.",
      "section": "1",
      "notes": ""
    },
    "Institution of higher education": {
      "term": "Institution of higher education",
      "definition": "any individual who, or school, board, association, limited liability company or corporation that, is licensed or accredited to offer one or more programs of higher learning leading to one or more degrees.",
      "section": "1",
      "notes": ""
    },
    "Nonprofit organization": {
      "term": "Nonprofit organization",
      "definition": "any organization that is exempt from taxation under Section 501(c)(3), 501(c)(4), 501(c)(6) or 501(c)(12) of the Internal Revenue Code of 1986, or any subsequent corresponding internal revenue code of the United States, as amended from time to time.",
      "section": "1",
      "notes": ""
    },
    "Personal data": {
      "term": "Personal data",
      "definition": "any information that is linked or reasonably linkable to an identified or identifiable individual. \"Personal data\" does not include de-identified data or publicly available information.",
      "section": "1",
      "notes": ""
    },
    "Precise geolocation data": {
      "term": "Precise geolocation data",
      "definition": "information derived from technology, including, but not limited to, global positioning system level latitude and longitude coordinates or other mechanisms, that directly identifies the specific location of an individual with precision and accuracy within a radius of one thousand seven hundred fifty feet. \"Precise geolocation data\" does not include the content of communications or any data generated by or connected to advanced utility metering infrastructure systems or equipment for use by a utility.",
      "section": "1",
      "notes": ""
    },
    "Process": {
      "term": "Process",
      "definition": "any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion or modification of personal data.",
      "section": "1",
      "notes": ""
    },
    "Processing": {
      "term": "Processing",
      "definition": "any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion or modification of personal data.",
      "section": "1",
      "notes": ""
    },
    "Processor": {
      "term": "Processor",
      "definition": "an individual who, or legal entity that, processes personal data on behalf of a controller.",
      "section": "1",
      "notes": ""
    },
    "Profiling": {
      "term": "Profiling",
      "definition": "any form of automated processing performed on personal data to evaluate, analyze or predict personal aspects related to an identified or identifiable individual's economic situation, health, personal preferences, interests, reliability, behavior, location or movements.",
      "section": "1",
      "notes": ""
    },
    "Protected health information": {
      "term": "Protected health information",
      "definition": "has the same meaning as provided in HIPAA.",
      "section": "1",
      "notes": ""
    },
    "Pseudonymous data": {
      "term": "Pseudonymous data",
      "definition": "personal data that cannot be attributed to a specific individual without the use of additional information, provided such additional information is kept separately and is subject to appropriate technical and organizational measures to ensure that the personal data is not attributed to an identified or identifiable individual.",
      "section": "1",
      "notes": ""
    },
    "Publicly available information": {
      "term": "Publicly available information",
      "definition": "information that (A) is lawfully made available through federal, state or municipal government records or widely distributed media, and (B) a controller has a reasonable basis to believe a consumer has lawfully made available to the general public.",
      "section": "1",
      "notes": ""
    },
    "Sale of personal data": {
      "term": "Sale of personal data",
      "definition": "the exchange of personal data for monetary or other valuable consideration by the controller to a third party. \"Sale of personal data\" does not include (A) the disclosure of personal data to a processor that processes the personal data on behalf of the controller, (B) the disclosure of personal data to a third party for purposes of providing a product or service requested by the consumer, (C) the disclosure or transfer of personal data to an affiliate of the controller, (D) the disclosure of personal data where the consumer directs the controller to disclose the personal data or intentionally uses the controller to interact with a third party, (E) the disclosure of personal data that the consumer (i) intentionally made available to the general public via a channel of mass media, and (ii) did not restrict to a specific audience, or (F) the disclosure or transfer of personal data to a third party as an asset that is part of a merger, acquisition, bankruptcy or other transaction, or a proposed merger, acquisition, bankruptcy or other transaction, in which the third party assumes control of all or part of the controller's assets.",
      "section": "1",
      "notes": ""
    },
    "Sensitive data": {
      "term": "Sensitive data",
      "definition": "personal data that includes (A) data revealing racial or ethnic origin, religious beliefs, mental or physical health condition or diagnosis, sex life, sexual orientation or citizenship or immigration status, (B) the processing of genetic or biometric data for the purpose of uniquely identifying an individual, (C) personal data collected from a known child, or (D) precise geolocation data.",
      "section": "1",
      "notes": ""
    },
    "Targeted advertising": {
      "term": "Targeted advertising",
      "definition": "displaying advertisements to a consumer where the advertisement is selected based on personal data obtained or inferred from that consumer's activities over time and across nonaffiliated Internet web sites or online applications to predict such consumer's preferences or interests. \"Targeted advertising\" does not include (A) advertisements based on activities within a controller's own Internet web sites or online applications, (B) advertisements based on the context of a consumer's current search query, visit to an Internet web site or online application, (C) advertisements directed to a consumer in response to the consumer's request for information or feedback, or (D) processing personal data solely to measure or report advertising frequency, performance or reach.",
      "section": "1",
      "notes": ""
    },
    "Third party": {
      "term": "Third party",
      "definition": "an individual or legal entity, such as a public authority, agency or body, other than the consumer, controller or processor or an affiliate of the processor or the controller.",
      "section": "1",
      "notes": ""
    },
    "Trade secret": {
      "term": "Trade secret",
      "definition": "has the same meaning as provided in section 35-51 of the general statutes.",
      "section": "1",
      "notes": ""
    }
  },
  "requirements": [
    {
      "id": "cd942b4b-b0a1-4b90-81c9-b4998cb3e12e",
      "description": "Law applies to persons conducting business in Connecticut or targeting Connecticut residents who meet volume/revenue thresholds",
      "citation": {
        "section": "2",
        "quoted_text": "The provisions of sections 1 to 11, inclusive, of this act apply to persons that conduct business in this state or persons that produce products or services that are targeted to residents of this state and that during the preceding calendar year: (1) Controlled or processed the personal data of not less than one hundred thousand consumers, excluding personal data controlled or processed solely for the purpose of completing a payment transaction; or (2) controlled or processed the personal data of not less than twenty-five thousand consumers and derived more than twenty-five per cent of their gross revenue from the sale of personal data.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Persons conducting business in Connecticut or targeting Connecticut residents",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Controlled or processed personal data of at least 100,000 consumers (excluding payment transaction data only)",
        "OR controlled or processed personal data of at least 25,000 consumers AND derived more than 25% of gross revenue from sale of personal data",
        "Thresholds measured during preceding calendar year"
      ],
      "source_section": "2",
      "obligation_type": "shall"
    },
    {
      "id": "8c80b8d7-5dd5-428b-a296-54dc0585321a",
      "description": "Entity-level exemptions from the law",
      "citation": {
        "section": "3(a)",
        "quoted_text": "The provisions of sections 1 to 11, inclusive, of this act do not apply to any: (1) Body, authority, board, bureau, commission, district or agency of this state or of any political subdivision of this state; (2) nonprofit organization; (3) institution of higher education; (4) national securities association that is registered under 15 USC 78o-3 of the Securities Exchange Act of 1934...; (5) financial institution or data subject to Title V of the Gramm-Leach-Bliley Act, 15 USC 6801 et seq.; or (6) covered entity or business associate, as defined in 45 CFR 160.103.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          206,
          207
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "N/A - exemptions",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Entity is a state/local government body",
        "OR entity is a nonprofit organization",
        "OR entity is an institution of higher education",
        "OR entity is a registered national securities association",
        "OR entity is a financial institution or data subject to GLBA",
        "OR entity is a HIPAA covered entity or business associate"
      ],
      "source_section": "3",
      "obligation_type": "shall_not"
    },
    {
      "id": "26bbb91b-dc67-494e-8b26-276ee7073979",
      "description": "Data-level exemptions from the law",
      "citation": {
        "section": "3(b)",
        "quoted_text": "The following information and data is exempt from the provisions of sections 1 to 11, inclusive, of this act: (1) Protected health information under HIPAA; (2) patient-identifying information for purposes of 42 USC 290dd-2; (3) identifiable private information for purposes of the federal policy for the protection of human subjects under 45 CFR 46; (4) identifiable private information that is otherwise information collected as part of human subjects research...; (5) the protection of human subjects under 21 CFR Parts 6, 50 and 56, or personal data used or shared in research...; (6) information and documents created for purposes of the Health Care Quality Improvement Act of 1986...; (7) patient safety work product...; (8) information derived from any of the health care related information listed in this subsection that is de-identified in accordance with the requirements for de-identification pursuant to HIPAA; (9) information originating from and intermingled to be indistinguishable with, or information treated in the same manner as, information exempt under this subsection...; (10) information used for public health activities and purposes as authorized by HIPAA...; (11) the collection, maintenance, disclosure, sale, communication or use of any personal information bearing on a consumer's credit worthiness...by a consumer reporting agency...authorized under the Fair Credit Reporting Act...; (12) personal data collected, processed, sold or disclosed in compliance with the Driver's Privacy Protection Act of 1994...; (13) personal data regulated by the Family Educational Rights and Privacy Act...; (14) personal data collected, processed, sold or disclosed in compliance with the Farm Credit Act...; (15) data processed or maintained (A) in the course of an individual applying to, employed by or acting as an agent or independent contractor of a controller, processor or third party, to the extent that the data is collected and used within the context of that role, (B) as the emergency contact information of an individual under sections 1 to 11, inclusive, of this act used for emergency contact purposes, or (C) that is necessary to retain to administer benefits for another individual relating to the individual who is the subject of the information under subdivision (1) of this subsection and used for the purposes of administering such benefits; and (16) personal data collected, processed, sold or disclosed in relation to price, route or service, as such terms are used in the Airline Deregulation Act...",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          215,
          216
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "N/A - exemptions",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Data falls within one of the enumerated exempt categories including: HIPAA protected health information, human subjects research data, FCRA-regulated credit data, DPPA-regulated driver data, FERPA-regulated education records, Farm Credit Act data, employment/contractor/emergency contact/benefits data, or Airline Deregulation Act data"
      ],
      "source_section": "3",
      "obligation_type": "shall_not"
    },
    {
      "id": "120ed8b0-94e0-4b8f-9fa7-0c50c82f360b",
      "description": "COPPA compliance deemed compliant with parental consent obligations",
      "citation": {
        "section": "3(c)",
        "quoted_text": "Controllers and processors that comply with the verifiable parental consent requirements of COPPA shall be deemed compliant with any obligation to obtain parental consent pursuant to sections 1 to 11, inclusive, of this act.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Entity complies with COPPA verifiable parental consent requirements"
      ],
      "source_section": "3",
      "obligation_type": "shall"
    },
    {
      "id": "7b42c665-06a3-43f2-a5b1-c364b2a2b19c",
      "description": "Controller must respond to consumer rights requests within 45 days (extendable by 45 days)",
      "citation": {
        "section": "4(c)(1)",
        "quoted_text": "A controller shall respond to the consumer without undue delay, but not later than forty-five days after receipt of the request. The controller may extend the response period by forty-five additional days when reasonably necessary, considering the complexity and number of the consumer's requests, provided the controller informs the consumer of any such extension within the initial forty-five-day response period and of the reason for the extension.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Consumer submits a valid rights request",
        "Controller may extend by 45 additional days if reasonably necessary",
        "Must inform consumer of extension and reason within initial 45-day period"
      ],
      "source_section": "4",
      "obligation_type": "shall"
    },
    {
      "id": "3ecf3454-db50-4834-bada-6c81400110e9",
      "description": "Controller must inform consumer of denial within 45 days with justification and appeal instructions",
      "citation": {
        "section": "4(c)(2)",
        "quoted_text": "If a controller declines to take action regarding the consumer's request, the controller shall inform the consumer without undue delay, but not later than forty-five days after receipt of the request, of the justification for declining to take action and instructions for how to appeal the decision.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          335,
          336
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Controller declines to take action on consumer request"
      ],
      "source_section": "4",
      "obligation_type": "shall"
    },
    {
      "id": "7204f290-6e9c-49df-9914-5fd3999cf9a5",
      "description": "Controller must provide responses free of charge once per 12-month period; may charge reasonable fee or decline for manifestly unfounded, excessive or repetitive requests",
      "citation": {
        "section": "4(c)(3)",
        "quoted_text": "Information provided in response to a consumer request shall be provided by a controller, free of charge, once per consumer during any twelve-month period. If requests from a consumer are manifestly unfounded, excessive or repetitive, the controller may charge the consumer a reasonable fee to cover the administrative costs of complying with the request or decline to act on the request. The controller bears the burden of demonstrating the manifestly unfounded, excessive or repetitive nature of the request.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "First response per 12-month period must be free",
        "Controller bears burden of proving request is manifestly unfounded, excessive or repetitive"
      ],
      "source_section": "4",
      "obligation_type": "shall"
    },
    {
      "id": "527ea6f8-7400-40fd-a8f4-83e2a1b293ad",
      "description": "Controller must establish appeals process for denials, respond within 60 days, and provide AG contact mechanism if appeal denied",
      "citation": {
        "section": "4(d)",
        "quoted_text": "A controller shall establish a process for a consumer to appeal the controller's refusal to take action on a request within a reasonable period of time after the consumer's receipt of the decision. The appeal process shall be conspicuously available and similar to the process for submitting requests to initiate action pursuant to this section. Not later than sixty days after receipt of an appeal, a controller shall inform the consumer in writing of any action taken or not taken in response to the appeal, including a written explanation of the reasons for the decisions. If the appeal is denied, the controller shall also provide the consumer with an online mechanism, if available, or other method through which the consumer may contact the Attorney General to submit a complaint.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Appeal process must be conspicuously available",
        "Response due within 60 days of appeal receipt",
        "If denied, must provide method to contact Attorney General"
      ],
      "source_section": "4",
      "obligation_type": "shall"
    },
    {
      "id": "737c9487-c91c-452d-ac2c-bc2bd3adf2cd",
      "description": "Controller must comply with opt-out requests from authorized agents if identity and authority can be verified with commercially reasonable effort",
      "citation": {
        "section": "5",
        "quoted_text": "A consumer may designate another person to serve as the consumer's authorized agent, and act on such consumer's behalf, to opt out of the processing of such consumer's personal data for one or more of the purposes specified in subdivision (5) of subsection (a) of section 4 of this act. The consumer may designate such authorized agent by way of, among other things, a technology, including, but not limited to, an Internet link or a browser setting, browser extension or global device setting, indicating such consumer's intent to opt out of such processing. A controller shall comply with an opt-out request received from an authorized agent if the controller is able to verify, with commercially reasonable effort, the identity of the consumer and the authorized agent's authority to act on such consumer's behalf.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          390,
          391
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Consumer designates an authorized agent",
        "Controller can verify consumer identity and agent authority with commercially reasonable effort"
      ],
      "source_section": "5",
      "obligation_type": "shall"
    },
    {
      "id": "43c8795d-1a4a-44e8-9a4a-1138b09f2548",
      "description": "Controller data minimization, purpose limitation, security, sensitive data consent, non-discrimination, consent revocation, and teen data processing prohibitions",
      "citation": {
        "section": "6(a)",
        "quoted_text": "A controller shall: (1) Limit the collection of personal data to what is adequate, relevant and reasonably necessary in relation to the purposes for which such data is processed, as disclosed to the consumer; (2) except as otherwise provided in sections 1 to 11, inclusive, of this act, not process personal data for purposes that are neither reasonably necessary to, nor compatible with, the disclosed purposes for which such personal data is processed, as disclosed to the consumer, unless the controller obtains the consumer's consent; (3) establish, implement and maintain reasonable administrative, technical and physical data security practices to protect the confidentiality, integrity and accessibility of personal data appropriate to the volume and nature of the personal data at issue; (4) not process sensitive data concerning a consumer without obtaining the consumer's consent, or, in the case of the processing of sensitive data concerning a known child, without processing such data in accordance with COPPA; (5) not process personal data in violation of the laws of this state and federal laws that prohibit unlawful discrimination against consumers; (6) provide an effective mechanism for a consumer to revoke the consumer's consent under this section that is at least as easy as the mechanism by which the consumer provided the consumer's consent and, upon revocation of such consent, cease to process the data as soon as practicable, but not later than fifteen days after the receipt of such request; and (7) not process the personal data of a consumer for purposes of targeted advertising, or sell the consumer's personal data without the consumer's consent, under circumstances where a controller has actual knowledge, and wilfully disregards, that the consumer is at least thirteen years of age but younger than sixteen years of age. A controller shall not discriminate against a consumer for exercising any of the consumer rights contained in sections 1 to 11, inclusive, of this act, including denying goods or services, charging different prices or rates for goods or services or providing a different level of quality of goods or services to the consumer.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          407,
          408
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Always required"
      ],
      "source_section": "6",
      "obligation_type": "shall"
    },
    {
      "id": "753a7990-e09b-4e10-8b8e-a41e2840248b",
      "description": "Controller must provide reasonably accessible, clear, and meaningful privacy notice with specified content",
      "citation": {
        "section": "6(c)",
        "quoted_text": "A controller shall provide consumers with a reasonably accessible, clear and meaningful privacy notice that includes: (1) The categories of personal data processed by the controller; (2) the purpose for processing personal data; (3) how consumers may exercise their consumer rights, including how a consumer may appeal a controller's decision with regard to the consumer's request; (4) the categories of personal data that the controller shares with third parties, if any; (5) the categories of third parties, if any, with which the controller shares personal data; and (6) an active electronic mail address or other online mechanism that the consumer may use to contact the controller.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "disclosure",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Always required"
      ],
      "source_section": "6",
      "obligation_type": "shall"
    },
    {
      "id": "cd67e8fa-aefe-4979-b6aa-6db9665bd3a0",
      "description": "Controller must clearly and conspicuously disclose sales and targeted advertising, and manner to opt out",
      "citation": {
        "section": "6(d)",
        "quoted_text": "If a controller sells personal data to third parties or processes personal data for targeted advertising, the controller shall clearly and conspicuously disclose such processing, as well as the manner in which a consumer may exercise the right to opt out of such processing.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "disclosure",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Controller sells personal data or processes for targeted advertising"
      ],
      "source_section": "6",
      "obligation_type": "shall"
    },
    {
      "id": "afb6b265-8b01-4e20-848b-f76e4ed35315",
      "description": "Controller must provide clear and conspicuous link to opt-out webpage and by Jan 1 2025 recognize opt-out preference signals meeting specified criteria",
      "citation": {
        "section": "6(e)(1)(A)",
        "quoted_text": "A controller shall establish, and shall describe in a privacy notice, one or more secure and reliable means for consumers to submit a request to exercise their consumer rights pursuant to sections 1 to 11, inclusive, of this act...Any such means shall include: (A) (i) Providing a clear and conspicuous link on the controller's Internet web site to an Internet web page that enables a consumer, or an agent of the consumer, to opt out of the targeted advertising or sale of the consumer's personal data; and (ii) Not later than January 1, 2025, allowing a consumer to opt out of any processing of the consumer's personal data for the purposes of targeted advertising, or any sale of such personal data, through an opt-out preference signal sent, with such consumer's consent, by a platform, technology or mechanism to the controller indicating such consumer's intent to opt out of any such processing or sale. Such platform, technology or mechanism shall: (I) Not unfairly disadvantage another controller; (II) Not make use of a default setting, but, rather, require the consumer to make an affirmative, freely given and unambiguous choice to opt out...; (III) Be consumer-friendly and easy to use by the average consumer; (IV) Be as consistent as possible with any other similar platform, technology or mechanism required by any federal or state law or regulation; and (V) Enable the controller to accurately determine whether the consumer is a resident of this state and whether the consumer has made a legitimate request to opt out of any sale of such consumer's personal data or targeted advertising.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          465,
          466
        ],
        "match_type": "contains"
      },
      "category": "technical",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Opt-out preference signal requirements apply starting January 1, 2025"
      ],
      "source_section": "6",
      "obligation_type": "shall"
    },
    {
      "id": "643f4a04-b91c-424c-917f-770111a18aae",
      "description": "Controller must process consent revocation requests within 15 days",
      "citation": {
        "section": "6(a)(6)",
        "quoted_text": "provide an effective mechanism for a consumer to revoke the consumer's consent under this section that is at least as easy as the mechanism by which the consumer provided the consumer's consent and, upon revocation of such consent, cease to process the data as soon as practicable, but not later than fifteen days after the receipt of such request",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Consumer revokes consent"
      ],
      "source_section": "6",
      "obligation_type": "shall"
    },
    {
      "id": "be2fdcde-8e67-4eb6-9d94-5600824304fb",
      "description": "Processor must adhere to controller instructions and assist controller with compliance obligations",
      "citation": {
        "section": "7(a)",
        "quoted_text": "A processor shall adhere to the instructions of a controller and shall assist the controller in meeting the controller's obligations under sections 1 to 11, inclusive, of this act. Such assistance shall include: (1) Taking into account the nature of processing and the information available to the processor, by appropriate technical and organizational measures, insofar as is reasonably practicable, to fulfill the controller's obligation to respond to consumer rights requests; (2) taking into account the nature of processing and the information available to the processor, by assisting the controller in meeting the controller's obligations in relation to the security of processing the personal data and in relation to the notification of a breach of security, as defined in section 36a-701b of the general statutes, of the system of the processor, in order to meet the controller's obligations; and (3) providing necessary information to enable the controller to conduct and document data protection assessments.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          524,
          525
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Always required when processing on behalf of controller"
      ],
      "source_section": "7",
      "obligation_type": "shall"
    },
    {
      "id": "72b651d6-390e-4990-8ff4-e20daa3d50e0",
      "description": "Processor contract requirements including confidentiality, data return/deletion, compliance information, subcontractor approval, and assessments",
      "citation": {
        "section": "7(b)",
        "quoted_text": "A contract between a controller and a processor shall govern the processor's data processing procedures with respect to processing performed on behalf of the controller. The contract shall be binding and clearly set forth instructions for processing data, the nature and purpose of processing, the type of data subject to processing, the duration of processing and the rights and obligations of both parties. The contract shall also require that the processor: (1) Ensure that each person processing personal data is subject to a duty of confidentiality with respect to the data; (2) at the controller's direction, delete or return all personal data to the controller as requested at the end of the provision of services, unless retention of the personal data is required by law; (3) upon the reasonable request of the controller, make available to the controller all information in its possession necessary to demonstrate the processor's compliance with the obligations in sections 1 to 11, inclusive, of this act; (4) after providing the controller an opportunity to object, engage any subcontractor pursuant to a written contract that requires the subcontractor to meet the obligations of the processor with respect to the personal data; and (5) allow, and cooperate with, reasonable assessments by the controller or the controller's designated assessor, or the processor may arrange for a qualified and independent assessor to conduct an assessment of the processor's policies and technical and organizational measures in support of the obligations under sections 1 to 11, inclusive, of this act, using an appropriate and accepted control standard or framework and assessment procedure for such assessments. The processor shall provide a report of such assessment to the controller upon request.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Contract with controller required"
      ],
      "source_section": "7",
      "obligation_type": "shall"
    },
    {
      "id": "3566c953-8ed3-40ff-9032-68ca97e251bc",
      "description": "Controller must conduct and document data protection assessments for high-risk processing activities",
      "citation": {
        "section": "8(a)",
        "quoted_text": "A controller shall conduct and document a data protection assessment for each of the controller's processing activities that presents a heightened risk of harm to a consumer. For the purposes of this section, processing that presents a heightened risk of harm to a consumer includes: (1) The processing of personal data for the purposes of targeted advertising; (2) the sale of personal data; (3) the processing of personal data for the purposes of profiling, where such profiling presents a reasonably foreseeable risk of (A) unfair or deceptive treatment of, or unlawful disparate impact on, consumers, (B) financial, physical or reputational injury to consumers, (C) a physical or other intrusion upon the solitude or seclusion, or the private affairs or concerns, of consumers, where such intrusion would be offensive to a reasonable person, or (D) other substantial injury to consumers; and (4) the processing of sensitive data.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Processing presents heightened risk (targeted advertising, sale, risky profiling, or sensitive data)",
        "Assessment requirements apply to processing activities created or generated after July 1, 2023 (not retroactive)"
      ],
      "source_section": "8",
      "obligation_type": "shall"
    },
    {
      "id": "3e629228-c37f-49af-aed2-23707141b918",
      "description": "Controller in possession of de-identified data must take measures, publicly commit, and contractually obligate recipients",
      "citation": {
        "section": "9(a)",
        "quoted_text": "Any controller in possession of de-identified data shall: (1) Take reasonable measures to ensure that the data cannot be associated with an individual; (2) publicly commit to maintaining and using de-identified data without attempting to re-identify the data; and (3) contractually obligate any recipients of the de-identified data to comply with all provisions of sections 1 to 11, inclusive, of this act.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Controllers possessing de-identified data",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Controller possesses de-identified data"
      ],
      "source_section": "9",
      "obligation_type": "shall"
    },
    {
      "id": "bdf46758-c9ef-4dd0-9a58-eb28f4f2cc65",
      "description": "Entity-level exemptions from statute coverage",
      "citation": {
        "section": "3(a)",
        "quoted_text": "The provisions of sections 1 to 11, inclusive, of this act do not apply to any: (1) Body, authority, board, bureau, commission, district or agency of this state or of any political subdivision of this state; (2) nonprofit organization; (3) institution of higher education; (4) national securities association that is registered under 15 USC 78o-3 of the Securities Exchange Act of 1934...; (5) financial institution or data subject to Title V of the Gramm-Leach-Bliley Act, 15 USC 6801 et seq.; or (6) covered entity or business associate, as defined in 45 CFR 160.103.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          206,
          207
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "All covered entities",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Statute exempts: (1) Connecticut state/political subdivision governmental bodies, (2) nonprofit organizations, (3) institutions of higher education, (4) national securities associations registered under Securities Exchange Act, (5) financial institutions or GLBA-covered data, (6) HIPAA covered entities or business associates"
      ],
      "source_section": "3",
      "obligation_type": "shall_not"
    },
    {
      "id": "7f67b031-ef20-4bdf-b67e-ac332b7e2a7d",
      "description": "Data-level exemptions from statute coverage",
      "citation": {
        "section": "3(b)",
        "quoted_text": "The following information and data is exempt from the provisions of sections 1 to 11, inclusive, of this act: (1) Protected health information under HIPAA; (2) patient-identifying information for purposes of 42 USC 290dd-2; (3) identifiable private information for purposes of the federal policy for the protection of human subjects under 45 CFR 46; (4) identifiable private information...collected as part of human subjects research...; (5) personal data used or shared in research...; (6) information and documents created for purposes of the Health Care Quality Improvement Act of 1986...; (7) patient safety work product...; (8) information derived from...health care related information...that is de-identified in accordance with...HIPAA; (9) information originating from and intermingled...maintained by a covered entity...; (10) information used for public health activities...; (11) personal information bearing on a consumer's credit worthiness...regulated by...the Fair Credit Reporting Act...; (12) personal data...in compliance with the Driver's Privacy Protection Act of 1994...; (13) personal data regulated by the Family Educational Rights and Privacy Act...; (14) personal data...in compliance with the Farm Credit Act...; (15) data processed or maintained (A) in the course of an individual applying to, employed by or acting as an agent or independent contractor..., (B) as emergency contact information..., or (C) necessary to retain to administer benefits...; and (16) personal data...in relation to price, route or service...by an air carrier subject to...the Airline Deregulation Act...",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          215,
          216
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "All covered entities",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "16 categories of exempt data including: HIPAA PHI, substance abuse patient records, human subjects research data, clinical trial data, health quality improvement data, patient safety data, HIPAA-deidentified data, public health data, FCRA credit data, DPPA driver data, FERPA education data, Farm Credit Act data, employment/B2B data, emergency contact data, benefits administration data, airline pricing/routing data"
      ],
      "source_section": "3",
      "obligation_type": "shall_not"
    },
    {
      "id": "032d161e-4685-4201-a79b-50c02ccebabf",
      "description": "Consumer rights to access, correct, delete, and port personal data, and opt out of certain processing",
      "citation": {
        "section": "4(a)",
        "quoted_text": "A consumer shall have the right to: (1) Confirm whether or not a controller is processing the consumer's personal data and access such personal data, unless such confirmation or access would require the controller to reveal a trade secret; (2) correct inaccuracies in the consumer's personal data, taking into account the nature of the personal data and the purposes of the processing of the consumer's personal data; (3) delete personal data provided by, or obtained about, the consumer; (4) obtain a copy of the consumer's personal data processed by the controller, in a portable and, to the extent technically feasible, readily usable format that allows the consumer to transmit the data to another controller without hindrance, where the processing is carried out by automated means, provided such controller shall not be required to reveal any trade secret; and (5) opt out of the processing of the personal data for purposes of (A) targeted advertising, (B) the sale of personal data, except as provided in subsection (b) of section 6 of this act, or (C) profiling in furtherance of solely automated decisions that produce legal or similarly significant effects concerning the consumer.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          285,
          286
        ],
        "match_type": "contains"
      },
      "category": "disclosure",
      "applies_to": "Consumers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Consumers have rights to: (1) confirm/access personal data (unless trade secret), (2) correct inaccuracies, (3) delete personal data, (4) obtain portable copy (unless trade secret), (5) opt out of targeted advertising/sales/profiling for automated legal decisions"
      ],
      "source_section": "4",
      "obligation_type": "shall"
    },
    {
      "id": "ebf55bf4-2b03-40c3-a4d3-4242fa33493b",
      "description": "Processor must adhere to controller instructions and assist controller in meeting obligations",
      "citation": {
        "section": "7(a)",
        "quoted_text": "A processor shall adhere to the instructions of a controller and shall assist the controller in meeting the controller's obligations under sections 1 to 11, inclusive, of this act. Such assistance shall include: (1) Taking into account the nature of processing and the information available to the processor, by appropriate technical and organizational measures, insofar as is reasonably practicable, to fulfill the controller's obligation to respond to consumer rights requests; (2) taking into account the nature of processing and the information available to the processor, by assisting the controller in meeting the controller's obligations in relation to the security of processing the personal data and in relation to the notification of a breach of security, as defined in section 36a-701b of the general statutes, of the system of the processor, in order to meet the controller's obligations; and (3) providing necessary information to enable the controller to conduct and document data protection assessments.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          524,
          525
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Must adhere to controller instructions",
        "Must assist controller with: (1) responding to consumer rights requests, (2) security and breach notification, (3) data protection assessments"
      ],
      "source_section": "7",
      "obligation_type": "shall"
    },
    {
      "id": "a30c7a66-f7dc-404c-86ff-12bd75a8ea05",
      "description": "Processor-controller contract must govern data processing procedures with specified binding terms",
      "citation": {
        "section": "7(b)",
        "quoted_text": "A contract between a controller and a processor shall govern the processor's data processing procedures with respect to processing performed on behalf of the controller. The contract shall be binding and clearly set forth instructions for processing data, the nature and purpose of processing, the type of data subject to processing, the duration of processing and the rights and obligations of both parties. The contract shall also require that the processor: (1) Ensure that each person processing personal data is subject to a duty of confidentiality with respect to the data; (2) at the controller's direction, delete or return all personal data to the controller as requested at the end of the provision of services, unless retention of the personal data is required by law; (3) upon the reasonable request of the controller, make available to the controller all information in its possession necessary to demonstrate the processor's compliance with the obligations in sections 1 to 11, inclusive, of this act; (4) after providing the controller an opportunity to object, engage any subcontractor pursuant to a written contract that requires the subcontractor to meet the obligations of the processor with respect to the personal data; and (5) allow, and cooperate with, reasonable assessments by the controller or the controller's designated assessor...",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          10,
          10
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Processors and Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Contract must be binding and specify: processing instructions, nature/purpose, data types, duration, rights/obligations",
        "Contract must require processor to: (1) ensure confidentiality duty, (2) delete/return data at controller's direction, (3) demonstrate compliance, (4) subcontract only with proper obligations, (5) cooperate with assessments"
      ],
      "source_section": "7",
      "obligation_type": "shall"
    },
    {
      "id": "61289493-6c99-4b3a-aed3-f115b5d996b2",
      "description": "Controller must conduct and document data protection assessment for processing presenting heightened risk of harm",
      "citation": {
        "section": "8(a)",
        "quoted_text": "A controller shall conduct and document a data protection assessment for each of the controller's processing activities that presents a heightened risk of harm to a consumer. For the purposes of this section, processing that presents a heightened risk of harm to a consumer includes: (1) The processing of personal data for the purposes of targeted advertising; (2) the sale of personal data; (3) the processing of personal data for the purposes of profiling, where such profiling presents a reasonably foreseeable risk of (A) unfair or deceptive treatment of, or unlawful disparate impact on, consumers, (B) financial, physical or reputational injury to consumers, (C) a physical or other intrusion upon the solitude or seclusion, or the private affairs or concerns, of consumers, where such intrusion would be offensive to a reasonable person, or (D) other substantial injury to consumers; and (4) the processing of sensitive data.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must conduct and document data protection assessment for: (1) targeted advertising, (2) sale of personal data, (3) profiling with foreseeable risk of harm, (4) sensitive data processing"
      ],
      "source_section": "8",
      "obligation_type": "shall"
    },
    {
      "id": "d32e7747-8ddf-4946-99cb-a98d3caacd88",
      "description": "Data protection assessments must weigh benefits against risks and are confidential but subject to AG review",
      "citation": {
        "section": "8(b)(c)",
        "quoted_text": "Data protection assessments conducted pursuant to subsection (a) of this section shall identify and weigh the benefits that may flow, directly and indirectly, from the processing to the controller, the consumer, other stakeholders and the public against the potential risks to the rights of the consumer associated with such processing, as mitigated by safeguards that can be employed by the controller to reduce such risks...The Attorney General may require that a controller disclose any data protection assessment that is relevant to an investigation conducted by the Attorney General, and the controller shall make the data protection assessment available to the Attorney General...Data protection assessments shall be confidential and shall be exempt from disclosure under the Freedom of Information Act, as defined in section 1-200 of the general statutes.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          605,
          606
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Assessments must weigh benefits against risks with safeguards",
        "AG may require disclosure for investigations",
        "Assessments are confidential and FOIA-exempt"
      ],
      "source_section": "8",
      "obligation_type": "shall"
    },
    {
      "id": "8aa3d999-2113-472c-af57-7c586a6d3c16",
      "description": "Controller possessing de-identified data must implement technical and contractual safeguards",
      "citation": {
        "section": "9(a)",
        "quoted_text": "Any controller in possession of de-identified data shall: (1) Take reasonable measures to ensure that the data cannot be associated with an individual; (2) publicly commit to maintaining and using de-identified data without attempting to re-identify the data; and (3) contractually obligate any recipients of the de-identified data to comply with all provisions of sections 1 to 11, inclusive, of this act.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Controllers possessing de-identified data",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must: (1) take reasonable measures to prevent association with individual, (2) publicly commit not to re-identify, (3) contractually obligate recipients to comply"
      ],
      "source_section": "9",
      "obligation_type": "shall"
    },
    {
      "id": "35ef6cc7-77fb-4baf-8b5f-8aa4957ce4d9",
      "description": "Exemptions from controller/processor obligations for specific processing purposes",
      "citation": {
        "section": "10(a)",
        "quoted_text": "Nothing in sections 1 to 11, inclusive, of this act shall be construed to restrict a controller's or processor's ability to: (1) Comply with federal, state or municipal ordinances or regulations; (2) comply with a civil, criminal or regulatory inquiry, investigation, subpoena or summons by federal, state, municipal or other governmental authorities; (3) cooperate with law enforcement agencies concerning conduct or activity that the controller or processor reasonably and in good faith believes may violate federal, state or municipal ordinances or regulations; (4) investigate, establish, exercise, prepare for or defend legal claims; (5) provide a product or service specifically requested by a consumer; (6) perform under a contract to which a consumer is a party...;(7) take steps at the request of a consumer prior to entering into a contract; (8) take immediate steps to protect an interest that is essential for the life or physical safety of the consumer or another individual...; (9) prevent, detect, protect against or respond to security incidents, identity theft, fraud, harassment, malicious or deceptive activities...;(10) engage in public or peer-reviewed scientific or statistical research in the public interest...; (11) assist another controller, processor or third party with any of the obligations under sections 1 to 11...; or (12) process personal data for reasons of public interest in the area of public health...",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          687,
          688
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Exemptions permitted for 12 categories including: regulatory compliance, legal process, law enforcement cooperation, legal claims, consumer-requested services, contractual performance, vital interests, security/fraud prevention, public interest research, assisting others' compliance, public health"
      ],
      "source_section": "10",
      "obligation_type": "may"
    },
    {
      "id": "3b67a6ac-709f-45e2-a07a-1682a9b5a0fa",
      "description": "Internal use exemptions for data collection, use, and retention",
      "citation": {
        "section": "10(b)",
        "quoted_text": "The obligations imposed on controllers or processors under sections 1 to 11, inclusive, of this act shall not restrict a controller's or processor's ability to collect, use or retain data for internal use to: (1) Conduct internal research to develop, improve or repair products, services or technology; (2) effectuate a product recall; (3) identify and repair technical errors that impair existing or intended functionality; or (4) perform internal operations that are reasonably aligned with the expectations of the consumer or reasonably anticipated based on the consumer's existing relationship with the controller, or are otherwise compatible with processing data in furtherance of the provision of a product or service specifically requested by a consumer or the performance of a contract to which the consumer is a party.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Internal use permitted for: (1) internal research and development, (2) product recalls, (3) technical error repair, (4) reasonably expected operations aligned with consumer relationship"
      ],
      "source_section": "10",
      "obligation_type": "may"
    },
    {
      "id": "17ab39a0-0a93-4e57-9442-8f4f6a68e527",
      "description": "First Amendment and household activity exemptions",
      "citation": {
        "section": "10(e)",
        "quoted_text": "Nothing in sections 1 to 11, inclusive, of this act shall be construed to: (1) Impose any obligation on a controller or processor that adversely affects the rights or freedoms of any person, including, but not limited to, the rights of any person (A) to freedom of speech or freedom of the press guaranteed in the First Amendment to the United States Constitution, or (B) under section 52-146t of the general statutes; or (2) apply to any person's processing of personal data in the course of such person's purely personal or household activities.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Statute does not: (1) impose obligations that adversely affect First Amendment or Connecticut free speech rights, (2) apply to purely personal or household activities"
      ],
      "source_section": "10",
      "obligation_type": "shall_not"
    },
    {
      "id": "4960e909-5539-4b2e-9803-15b196b6cd52",
      "description": "Attorney General has exclusive enforcement authority",
      "citation": {
        "section": "11(a)",
        "quoted_text": "The Attorney General shall have exclusive authority to enforce violations of sections 1 to 10, inclusive, of this act.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Attorney General",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "AG has exclusive enforcement authority over statute violations"
      ],
      "source_section": "11",
      "obligation_type": "shall"
    },
    {
      "id": "c90ff247-2cb7-44a2-8951-c02e4c8f3a90",
      "description": "Cure period for violations from July 1, 2023 to December 31, 2024, with 60-day cure window and AG reporting requirement",
      "citation": {
        "section": "11(b)",
        "quoted_text": "During the period beginning on July 1, 2023, and ending on December 31, 2024, the Attorney General shall, prior to initiating any action for a violation of any provision of sections 1 to 10, inclusive, of this act, issue a notice of violation to the controller if the Attorney General determines that a cure is possible. If the controller fails to cure such violation within sixty days of receipt of the notice of violation, the Attorney General may bring an action pursuant to this section. Not later than February 1, 2024, the Attorney General shall submit a report, in accordance with section 11-4a of the general statutes, to the joint standing committee of the General Assembly having cognizance of matters relating to general law disclosing: (1) The number of notices of violation the Attorney General has issued; (2) the nature of each violation; (3) the number of violations that were cured during the sixty-day cure period; and (4) any other matter the Attorney General deems relevant for the purposes of such report.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact_normalized"
      },
      "category": "legal_framework",
      "applies_to": "Attorney General and Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "From July 1, 2023 to December 31, 2024: AG must issue notice of violation with 60-day cure period before enforcement action if cure is possible",
        "AG must submit report by February 1, 2024 on violations, cures, and related matters"
      ],
      "source_section": "11",
      "obligation_type": "shall"
    },
    {
      "id": "d5a09921-c707-48ba-8dfc-cb58bb910ba3",
      "description": "AG discretion for cure opportunities beginning January 1, 2025",
      "citation": {
        "section": "11(c)",
        "quoted_text": "Beginning on January 1, 2025, the Attorney General may, in determining whether to grant a controller or processor the opportunity to cure an alleged violation described in subsection (b) of this section, consider: (1) The number of violations; (2) the size and complexity of the controller or processor; (3) the nature and extent of the controller's or processor's processing activities; (4) the substantial likelihood of injury to the public; (5) the safety of persons or property; and (6) whether such alleged violation was likely caused by human or technical error.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Attorney General",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Starting January 1, 2025: AG has discretion to grant cure opportunity considering 6 factors: number of violations, entity size/complexity, processing nature/extent, public injury likelihood, safety concerns, human/technical error likelihood"
      ],
      "source_section": "11",
      "obligation_type": "may"
    },
    {
      "id": "be3f6cb5-2846-43c4-bcbb-be4cdef0fea6",
      "description": "No private right of action for statute violations",
      "citation": {
        "section": "11(d)",
        "quoted_text": "Nothing in sections 1 to 10, inclusive, of this act shall be construed as providing the basis for, or be subject to, a private right of action for violations of said sections or any other law.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "All persons",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Statute does not create private right of action"
      ],
      "source_section": "11",
      "obligation_type": "shall_not"
    },
    {
      "id": "ea5b7c12-df9f-42fe-ad26-6d42bfe5cc1e",
      "description": "Violations constitute unfair trade practices enforceable solely by Attorney General",
      "citation": {
        "section": "11(e)",
        "quoted_text": "A violation of the requirements of sections 1 to 10, inclusive, of this act shall constitute an unfair trade practice for purposes of section 42-110b of the general statutes and shall be enforced solely by the Attorney General, provided the provisions of section 42-110g of the general statutes shall not apply to such violation.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Violations are unfair trade practices under section 42-110b",
        "Enforcement solely by AG",
        "Section 42-110g does not apply"
      ],
      "source_section": "11",
      "obligation_type": "shall"
    }
  ],
  "unverified_items": [],
  "metadata": {
    "source_file": "State Privacy Laws\\Connecticut Privacy Law.pdf",
    "total_requirements": 34,
    "verified_count": 34,
    "output_format": "json",
    "sections_processed": [
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11"
    ],
    "requirements_per_section": {
      "2": 1,
      "3": 5,
      "4": 5,
      "5": 1,
      "6": 5,
      "7": 4,
      "8": 3,
      "9": 2,
      "10": 3,
      "11": 5
    },
    "total_extracted": 34,
    "defined_terms": [
      "Affiliate",
      "Authenticate",
      "Biometric data",
      "Business associate",
      "Child",
      "Consent",
      "Consumer",
      "Controller",
      "COPPA",
      "Covered entity",
      "Dark pattern",
      "Decisions that produce legal or similarly significant effects concerning the consumer",
      "De-identified data",
      "HIPAA",
      "Identified or identifiable individual",
      "Institution of higher education",
      "Nonprofit organization",
      "Personal data",
      "Precise geolocation data",
      "Process",
      "Processing",
      "Processor",
      "Profiling",
      "Protected health information",
      "Pseudonymous data",
      "Publicly available information",
      "Sale of personal data",
      "Sensitive data",
      "Targeted advertising",
      "Third party",
      "Trade secret"
    ],
    "section_types": {
      "1": "definitions",
      "2": "applicability",
      "3": "exemptions",
      "4": "consumer_rights",
      "5": "consumer_rights",
      "6": "controller_duties",
      "7": "processor_duties",
      "8": "controller_duties",
      "9": "general",
      "10": "exemptions",
      "11": "enforcement",
      "12": "other"
    }
  },
  "structure": {
    "name": "Connecticut Data Privacy Act",
    "citation": "Public Act No. 22-15 (Substitute Senate Bill No. 6)",
    "effective_date": "July 1, 2023",
    "sections": [
      {
        "id": "1",
        "title": "Definitions",
        "section_type": "definitions",
        "content": "(NEW) (Effective July 1, 2023) As used in this section and sections 2 to 11, inclusive, of this act, unless the context otherwise requires: (1) \"Affiliate\" means a legal entity that shares common br",
        "start_line": 1,
        "end_line": 196,
        "subsections": []
      },
      {
        "id": "2",
        "title": "Applicability Thresholds",
        "section_type": "applicability",
        "content": "(NEW) (Effective July 1, 2023) The provisions of sections 1 to 11, inclusive, of this act apply to persons that conduct business in this state or persons that produce products or services that are ta",
        "start_line": 197,
        "end_line": 214,
        "subsections": []
      },
      {
        "id": "3",
        "title": "Exemptions",
        "section_type": "exemptions",
        "content": "(NEW) (Effective July 1, 2023) (a) The provisions of sections 1 to 11, inclusive, of this act do not apply to any: (1) Body, authority, board, bureau, commission, district or agency of this state or",
        "start_line": 215,
        "end_line": 278,
        "subsections": []
      },
      {
        "id": "4",
        "title": "Consumer Rights",
        "section_type": "consumer_rights",
        "content": "(NEW) (Effective July 1, 2023) (a) A consumer shall have the right to: (1) Confirm whether or not a controller is processing the consumer's personal data and access such personal data, unless such c",
        "start_line": 279,
        "end_line": 363,
        "subsections": []
      },
      {
        "id": "5",
        "title": "Authorized Agents",
        "section_type": "consumer_rights",
        "content": "(NEW) (Effective July 1, 2023) A consumer may designate another person to serve as the consumer's authorized agent, and act on such consumer's behalf, to opt out of the processing of such consumer's ",
        "start_line": 364,
        "end_line": 376,
        "subsections": []
      },
      {
        "id": "6",
        "title": "Controller Responsibilities",
        "section_type": "controller_duties",
        "content": "(NEW) (Effective July 1, 2023) (a) A controller shall: (1) Limit the collection of personal data to what is adequate, relevant and reasonably necessary in relation to the purposes for which such dat",
        "start_line": 377,
        "end_line": 467,
        "subsections": []
      },
      {
        "id": "7",
        "title": "Processor Obligations",
        "section_type": "processor_duties",
        "content": "(NEW) (Effective July 1, 2023) (a) A processor shall adhere to the instructions of a controller and shall assist the controller in meeting the controller's obligations under sections 1 to 11, inclu",
        "start_line": 468,
        "end_line": 524,
        "subsections": []
      },
      {
        "id": "8",
        "title": "Data Protection Assessments",
        "section_type": "controller_duties",
        "content": "(NEW) (Effective July 1, 2023) (a) A controller shall conduct and document a data protection assessment for each of the controller's processing activities that presents a heightened risk of harm to ",
        "start_line": 525,
        "end_line": 573,
        "subsections": []
      },
      {
        "id": "9",
        "title": "De-identified Data",
        "section_type": "general",
        "content": "(NEW) (Effective July 1, 2023) (a) Any controller in possession of de-identified data shall: (1) Take reasonable measures to ensure that the data cannot be associated with an individual; (2) publicl",
        "start_line": 574,
        "end_line": 617,
        "subsections": []
      },
      {
        "id": "10",
        "title": "Additional Exemptions and Permitted Purposes",
        "section_type": "exemptions",
        "content": "(NEW) (Effective July 1, 2023) (a) Nothing in sections 1 to 11, inclusive, of this act shall be construed to restrict a controller's or processor's ability to: (1) Comply with federal, state or muni",
        "start_line": 618,
        "end_line": 705,
        "subsections": []
      },
      {
        "id": "11",
        "title": "Enforcement",
        "section_type": "enforcement",
        "content": "(NEW) (Effective July 1, 2023) (a) The Attorney General shall have exclusive authority to enforce violations of sections 1 to 10, inclusive, of this act. (b) During the period beginning on July 1, 2",
        "start_line": 706,
        "end_line": 746,
        "subsections": []
      },
      {
        "id": "12",
        "title": "Task Force on Data Privacy",
        "section_type": "other",
        "content": "(Effective from passage) (a) Not later than September 1, 2022, the chairpersons of the joint standing committee of the General Assembly having cognizance of matters relating to general law shall con",
        "start_line": 747,
        "end_line": 795,
        "subsections": []
      }
    ],
    "definitions": {
      "Affiliate": {
        "term": "Affiliate",
        "definition": "a legal entity that shares common branding with another legal entity or controls, is controlled by or is under common control with another legal entity. For the purposes of this subdivision, \"control\" or \"controlled\" means (A) ownership of, or the power to vote, more than fifty per cent of the outstanding shares of any class of voting security of a company, (B) control in any manner over the election of a majority of the directors or of individuals exercising similar functions, or (C) the power to exercise controlling influence over the management of a company.",
        "section": "1",
        "notes": ""
      },
      "Authenticate": {
        "term": "Authenticate",
        "definition": "to use reasonable means to determine that a request to exercise any of the rights afforded under subdivisions (1) to (4), inclusive, of subsection (a) of section 4 of this act is being made by, or on behalf of, the consumer who is entitled to exercise such consumer rights with respect to the personal data at issue.",
        "section": "1",
        "notes": ""
      },
      "Biometric data": {
        "term": "Biometric data",
        "definition": "data generated by automatic measurements of an individual's biological characteristics, such as a fingerprint, a voiceprint, eye retinas, irises or other unique biological patterns or characteristics that are used to identify a specific individual. \"Biometric data\" does not include (A) a digital or physical photograph, (B) an audio or video recording, or (C) any data generated from a digital or physical photograph, or an audio or video recording, unless such data is generated to identify a specific individual.",
        "section": "1",
        "notes": ""
      },
      "Business associate": {
        "term": "Business associate",
        "definition": "has the same meaning as provided in HIPAA.",
        "section": "1",
        "notes": ""
      },
      "Child": {
        "term": "Child",
        "definition": "has the same meaning as provided in COPPA.",
        "section": "1",
        "notes": ""
      },
      "Consent": {
        "term": "Consent",
        "definition": "a clear affirmative act signifying a consumer's freely given, specific, informed and unambiguous agreement to allow the processing of personal data relating to the consumer. \"Consent\" may include a written statement, including by electronic means, or any other unambiguous affirmative action. \"Consent\" does not include (A) acceptance of a general or broad terms of use or similar document that contains descriptions of personal data processing along with other, unrelated information, (B) hovering over, muting, pausing or closing a given piece of content, or (C) agreement obtained through the use of dark patterns.",
        "section": "1",
        "notes": ""
      },
      "Consumer": {
        "term": "Consumer",
        "definition": "an individual who is a resident of this state. \"Consumer\" does not include an individual acting in a commercial or employment context or as an employee, owner, director, officer or contractor of a company, partnership, sole proprietorship, nonprofit or government agency whose communications or transactions with the controller occur solely within the context of that individual's role with the company, partnership, sole proprietorship, nonprofit or government agency.",
        "section": "1",
        "notes": ""
      },
      "Controller": {
        "term": "Controller",
        "definition": "an individual who, or legal entity that, alone or jointly with others determines the purpose and means of processing personal data.",
        "section": "1",
        "notes": ""
      },
      "COPPA": {
        "term": "COPPA",
        "definition": "the Children's Online Privacy Protection Act of 1998, 15 USC 6501 et seq., and the regulations, rules, guidance and exemptions adopted pursuant to said act, as said act and such regulations, rules, guidance and exemptions may be amended from time to time.",
        "section": "1",
        "notes": ""
      },
      "Covered entity": {
        "term": "Covered entity",
        "definition": "has the same meaning as provided in HIPAA.",
        "section": "1",
        "notes": ""
      },
      "Dark pattern": {
        "term": "Dark pattern",
        "definition": "(A) means a user interface designed or manipulated with the substantial effect of subverting or impairing user autonomy, decision-making or choice, and (B) includes, but is not limited to, any practice the Federal Trade Commission refers to as a \"dark pattern\".",
        "section": "1",
        "notes": ""
      },
      "Decisions that produce legal or similarly significant effects concerning the consumer": {
        "term": "Decisions that produce legal or similarly significant effects concerning the consumer",
        "definition": "decisions made by the controller that result in the provision or denial by the controller of financial or lending services, housing, insurance, education enrollment or opportunity, criminal justice, employment opportunities, health care services or access to essential goods or services.",
        "section": "1",
        "notes": ""
      },
      "De-identified data": {
        "term": "De-identified data",
        "definition": "data that cannot reasonably be used to infer information about, or otherwise be linked to, an identified or identifiable individual, or a device linked to such individual, if the controller that possesses such data (A) takes reasonable measures to ensure that such data cannot be associated with an individual, (B) publicly commits to process such data only in a de-identified fashion and not attempt to re-identify such data, and (C) contractually obligates any recipients of such data to satisfy the criteria set forth in subparagraphs (A) and (B) of this subdivision.",
        "section": "1",
        "notes": ""
      },
      "HIPAA": {
        "term": "HIPAA",
        "definition": "the Health Insurance Portability and Accountability Act of 1996, 42 USC 1320d et seq., as amended from time to time.",
        "section": "1",
        "notes": ""
      },
      "Identified or identifiable individual": {
        "term": "Identified or identifiable individual",
        "definition": "an individual who can be readily identified, directly or indirectly.",
        "section": "1",
        "notes": ""
      },
      "Institution of higher education": {
        "term": "Institution of higher education",
        "definition": "any individual who, or school, board, association, limited liability company or corporation that, is licensed or accredited to offer one or more programs of higher learning leading to one or more degrees.",
        "section": "1",
        "notes": ""
      },
      "Nonprofit organization": {
        "term": "Nonprofit organization",
        "definition": "any organization that is exempt from taxation under Section 501(c)(3), 501(c)(4), 501(c)(6) or 501(c)(12) of the Internal Revenue Code of 1986, or any subsequent corresponding internal revenue code of the United States, as amended from time to time.",
        "section": "1",
        "notes": ""
      },
      "Personal data": {
        "term": "Personal data",
        "definition": "any information that is linked or reasonably linkable to an identified or identifiable individual. \"Personal data\" does not include de-identified data or publicly available information.",
        "section": "1",
        "notes": ""
      },
      "Precise geolocation data": {
        "term": "Precise geolocation data",
        "definition": "information derived from technology, including, but not limited to, global positioning system level latitude and longitude coordinates or other mechanisms, that directly identifies the specific location of an individual with precision and accuracy within a radius of one thousand seven hundred fifty feet. \"Precise geolocation data\" does not include the content of communications or any data generated by or connected to advanced utility metering infrastructure systems or equipment for use by a utility.",
        "section": "1",
        "notes": ""
      },
      "Process": {
        "term": "Process",
        "definition": "any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion or modification of personal data.",
        "section": "1",
        "notes": ""
      },
      "Processing": {
        "term": "Processing",
        "definition": "any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion or modification of personal data.",
        "section": "1",
        "notes": ""
      },
      "Processor": {
        "term": "Processor",
        "definition": "an individual who, or legal entity that, processes personal data on behalf of a controller.",
        "section": "1",
        "notes": ""
      },
      "Profiling": {
        "term": "Profiling",
        "definition": "any form of automated processing performed on personal data to evaluate, analyze or predict personal aspects related to an identified or identifiable individual's economic situation, health, personal preferences, interests, reliability, behavior, location or movements.",
        "section": "1",
        "notes": ""
      },
      "Protected health information": {
        "term": "Protected health information",
        "definition": "has the same meaning as provided in HIPAA.",
        "section": "1",
        "notes": ""
      },
      "Pseudonymous data": {
        "term": "Pseudonymous data",
        "definition": "personal data that cannot be attributed to a specific individual without the use of additional information, provided such additional information is kept separately and is subject to appropriate technical and organizational measures to ensure that the personal data is not attributed to an identified or identifiable individual.",
        "section": "1",
        "notes": ""
      },
      "Publicly available information": {
        "term": "Publicly available information",
        "definition": "information that (A) is lawfully made available through federal, state or municipal government records or widely distributed media, and (B) a controller has a reasonable basis to believe a consumer has lawfully made available to the general public.",
        "section": "1",
        "notes": ""
      },
      "Sale of personal data": {
        "term": "Sale of personal data",
        "definition": "the exchange of personal data for monetary or other valuable consideration by the controller to a third party. \"Sale of personal data\" does not include (A) the disclosure of personal data to a processor that processes the personal data on behalf of the controller, (B) the disclosure of personal data to a third party for purposes of providing a product or service requested by the consumer, (C) the disclosure or transfer of personal data to an affiliate of the controller, (D) the disclosure of personal data where the consumer directs the controller to disclose the personal data or intentionally uses the controller to interact with a third party, (E) the disclosure of personal data that the consumer (i) intentionally made available to the general public via a channel of mass media, and (ii) did not restrict to a specific audience, or (F) the disclosure or transfer of personal data to a third party as an asset that is part of a merger, acquisition, bankruptcy or other transaction, or a proposed merger, acquisition, bankruptcy or other transaction, in which the third party assumes control of all or part of the controller's assets.",
        "section": "1",
        "notes": ""
      },
      "Sensitive data": {
        "term": "Sensitive data",
        "definition": "personal data that includes (A) data revealing racial or ethnic origin, religious beliefs, mental or physical health condition or diagnosis, sex life, sexual orientation or citizenship or immigration status, (B) the processing of genetic or biometric data for the purpose of uniquely identifying an individual, (C) personal data collected from a known child, or (D) precise geolocation data.",
        "section": "1",
        "notes": ""
      },
      "Targeted advertising": {
        "term": "Targeted advertising",
        "definition": "displaying advertisements to a consumer where the advertisement is selected based on personal data obtained or inferred from that consumer's activities over time and across nonaffiliated Internet web sites or online applications to predict such consumer's preferences or interests. \"Targeted advertising\" does not include (A) advertisements based on activities within a controller's own Internet web sites or online applications, (B) advertisements based on the context of a consumer's current search query, visit to an Internet web site or online application, (C) advertisements directed to a consumer in response to the consumer's request for information or feedback, or (D) processing personal data solely to measure or report advertising frequency, performance or reach.",
        "section": "1",
        "notes": ""
      },
      "Third party": {
        "term": "Third party",
        "definition": "an individual or legal entity, such as a public authority, agency or body, other than the consumer, controller or processor or an affiliate of the processor or the controller.",
        "section": "1",
        "notes": ""
      },
      "Trade secret": {
        "term": "Trade secret",
        "definition": "has the same meaning as provided in section 35-51 of the general statutes.",
        "section": "1",
        "notes": ""
      }
    }
  }
}