{
  "statute_name": "Delaware Privacy Law",
  "effective_date": "January 1, 2025",
  "definitions": {
    "Affiliate": {
      "term": "Affiliate",
      "definition": "a legal entity that shares common branding with another legal entity or controls, is controlled by, or is under common control with another legal entity. For the purposes of this paragraph, \"control\" or \"controlled\" means any of the following: a. Ownership of, or the power to vote, more than 50% of the outstanding shares of any class of voting security of a legal entity. b. Control in any manner over the election of a majority of the directors or of individuals exercising similar functions. c. The power to exercise controlling influence over the management of a legal entity.",
      "section": "12D-102",
      "notes": ""
    },
    "Authenticate": {
      "term": "Authenticate",
      "definition": "to use reasonable means to determine that a request to exercise any of the rights afforded under § 12D-104(a)(1) to (a)(4) of this title, inclusive, is being made by, or on behalf of, the consumer who is entitled to exercise such consumer rights with respect to the personal data at issue.",
      "section": "12D-102",
      "notes": ""
    },
    "Biometric data": {
      "term": "Biometric data",
      "definition": "data generated by automatic measurements of an individual's unique biological characteristics, such as a fingerprint, a voiceprint, eye retinas, irises, or other unique biological patterns or characteristics that are used to identify a specific individual. \"Biometric data\" does not include any of the following: a. A digital or physical photograph. b. An audio or video recording. c. Any data generated from a digital or physical photograph, or an audio or video recording, unless such data is generated to identify a specific individual.",
      "section": "12D-102",
      "notes": ""
    },
    "Business associate": {
      "term": "Business associate",
      "definition": "as defined in HIPAA.",
      "section": "12D-102",
      "notes": ""
    },
    "Child": {
      "term": "Child",
      "definition": "as defined in COPPA.",
      "section": "12D-102",
      "notes": ""
    },
    "Child abuse": {
      "term": "Child abuse",
      "definition": "with respect to an individual under 18 years of age, as defined in § 901(1) of Title 10, or any equivalent provision in the laws of any other state, the United States, any territory, district, or subdivision of the United States, or any foreign jurisdiction.",
      "section": "12D-102",
      "notes": ""
    },
    "Consent": {
      "term": "Consent",
      "definition": "a clear affirmative act signifying a consumer's freely given, specific, informed and unambiguous agreement to allow the processing of personal data relating to the consumer. \"Consent\" may include a written statement, including by electronic means, or any other unambiguous affirmative action. \"Consent\" does not include any of the following: a. Acceptance of a general or broad terms of use or similar document that contains descriptions of personal data processing along with other, unrelated information. b. Hovering over, muting, pausing, or closing a given piece of content. c. Agreement obtained through the use of dark patterns.",
      "section": "12D-102",
      "notes": ""
    },
    "Consumer": {
      "term": "Consumer",
      "definition": "an individual who is a resident of this State. \"Consumer\" does not include an individual acting in a commercial or employment context or as an employee, owner, director, officer, or contractor of a company, partnership, sole proprietorship, nonprofit organization, or government agency whose communications or transactions with the controller occur solely within the context of that individual's role with the company, partnership, sole proprietorship, nonprofit organization, or government agency.",
      "section": "12D-102",
      "notes": ""
    },
    "Controller": {
      "term": "Controller",
      "definition": "a person that, alone or jointly with others, determines the purpose and means of processing personal data.",
      "section": "12D-102",
      "notes": ""
    },
    "COPPA": {
      "term": "COPPA",
      "definition": "the Children's Online Privacy Protection Act of 1998, 15 U.S.C. § 6501, et seq., and the regulations, rules, guidance, and exemptions adopted pursuant to said act, as said act and such regulations, rules, guidance, and exemptions may be amended.",
      "section": "12D-102",
      "notes": ""
    },
    "Covered entity": {
      "term": "Covered entity",
      "definition": "as defined in HIPAA.",
      "section": "12D-102",
      "notes": ""
    },
    "Dark pattern": {
      "term": "Dark pattern",
      "definition": "any of the following: a. A user interface designed or manipulated with the substantial effect of subverting or impairing user autonomy, decision-making, or choice. b. Any other practice the Federal Trade Commission refers to as a \"dark pattern.\"",
      "section": "12D-102",
      "notes": ""
    },
    "Decisions that produce legal or similarly significant effects concerning the consumer": {
      "term": "Decisions that produce legal or similarly significant effects concerning the consumer",
      "definition": "decisions made by the controller that result in the provision or denial by the controller of financial or lending services, housing, insurance, education enrollment or opportunity, criminal justice, employment opportunities, health-care services, or access to essential goods or services.",
      "section": "12D-102",
      "notes": ""
    },
    "De-identified data": {
      "term": "De-identified data",
      "definition": "data that cannot reasonably be used to infer information about, or otherwise be linked to, an identified or identifiable individual, or a device linked to such individual, if the controller that possesses such data does all of the following: a. Takes reasonable measures to ensure that such data cannot be associated with an individual. b. Publicly commits to process such data only in a de-identified fashion and not attempt to re-identify such data. c. Contractually obligates any recipients of such data to comply with all of the provisions of this chapter applicable to the controller with respect to such data.",
      "section": "12D-102",
      "notes": ""
    },
    "Domestic violence": {
      "term": "Domestic violence",
      "definition": "as defined in § 1041 of Title 10, or any equivalent provision in the laws of any other state, the United States, any territory, district, or subdivision of the United States, or any foreign jurisdiction.",
      "section": "12D-102",
      "notes": ""
    },
    "Genetic data": {
      "term": "Genetic data",
      "definition": "any data, regardless of its format, that results from the analysis of a biological sample of an individual, or from another source enabling equivalent information to be obtained, and concerns genetic material. For purposes of this paragraph, \"genetic material\" includes deoxyribonucleic acids (DNA), ribonucleic acids (RNA), genes, chromosomes, alleles, genomes, alterations or modifications to DNA or RNA, single nucleotide polymorphisms (SNPs), uninterpreted data that results from analysis of the biological sample or other source, and any information extrapolated, derived, or inferred therefrom.",
      "section": "12D-102",
      "notes": ""
    },
    "HIPAA": {
      "term": "HIPAA",
      "definition": "the Health Insurance Portability and Accountability Act of 1996, 42 U.S.C. § 1320d, et seq., as amended.",
      "section": "12D-102",
      "notes": ""
    },
    "Human trafficking": {
      "term": "Human trafficking",
      "definition": "the offense defined in § 787 of Title 11, or any equivalent provision in the laws of any other state, the United States, any territory, district, or subdivision of the United States, or any foreign jurisdiction.",
      "section": "12D-102",
      "notes": ""
    },
    "Identified or identifiable individual": {
      "term": "Identified or identifiable individual",
      "definition": "an individual who can be readily identified, directly or indirectly.",
      "section": "12D-102",
      "notes": ""
    },
    "Nonprofit organization": {
      "term": "Nonprofit organization",
      "definition": "any organization that is exempt from taxation under § 501(c)(3), (c)(4), (c)(6) or (c)(12) of the Internal Revenue Code of 1986 [26 U.S.C. § 501(c)(3), (c)(4), (c)(6) or (c)(12)], or any subsequent corresponding internal revenue code of the United States, as amended.",
      "section": "12D-102",
      "notes": ""
    },
    "Personal data": {
      "term": "Personal data",
      "definition": "any information that is linked or reasonably linkable to an identified or identifiable individual, and does not include de-identified data or publicly available information.",
      "section": "12D-102",
      "notes": ""
    },
    "Precise geolocation data": {
      "term": "Precise geolocation data",
      "definition": "information derived from technology, including global positioning system level latitude and longitude coordinates or other mechanisms, that directly identifies the specific location of an individual with precision and accuracy within a radius of 1,750 feet. \"Precise geolocation data\" does not include the content of communications or any data generated by or connected to advanced utility metering infrastructure systems or equipment for use by a utility.",
      "section": "12D-102",
      "notes": ""
    },
    "Process": {
      "term": "Process",
      "definition": "any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion, or modification of personal data.",
      "section": "12D-102",
      "notes": ""
    },
    "Processing": {
      "term": "Processing",
      "definition": "any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion, or modification of personal data.",
      "section": "12D-102",
      "notes": ""
    },
    "Processor": {
      "term": "Processor",
      "definition": "a person that processes personal data on behalf of a controller.",
      "section": "12D-102",
      "notes": ""
    },
    "Profiling": {
      "term": "Profiling",
      "definition": "any form of automated processing performed on personal data to evaluate, analyze, or predict personal aspects related to an identified or identifiable individual's economic situation, health, demographic characteristics, personal preferences, interests, reliability, behavior, location, or movements.",
      "section": "12D-102",
      "notes": ""
    },
    "Protected health information": {
      "term": "Protected health information",
      "definition": "as defined in HIPAA.",
      "section": "12D-102",
      "notes": ""
    },
    "Pseudonymous data": {
      "term": "Pseudonymous data",
      "definition": "personal data that cannot be attributed to a specific individual without the use of additional information, provided such additional information is kept separately and is subject to appropriate technical and organizational measures to ensure that the personal data is not attributed to an identified or identifiable individual.",
      "section": "12D-102",
      "notes": ""
    },
    "Publicly available information": {
      "term": "Publicly available information",
      "definition": "any of the following: a. Information that is lawfully made available through federal, state, or local government records. b. Information that a controller has a reasonable basis to believe that the consumer has lawfully made available to the general public through widely distributed media.",
      "section": "12D-102",
      "notes": ""
    },
    "Sale of personal data": {
      "term": "Sale of personal data",
      "definition": "the exchange of personal data for monetary or other valuable consideration by the controller to a third party. \"Sale of personal data\" does not include any of the following: a. The disclosure of personal data to a processor that processes the personal data on behalf of the controller where limited to the purpose of such processing. b. The disclosure of personal data to a third party for purposes of providing a product or service affirmatively requested by the consumer. c. The disclosure or transfer of personal data to an affiliate of the controller. d. The disclosure of personal data where the consumer directs the controller to disclose the personal data or intentionally uses the controller to interact with a third party. e. The disclosure of personal data that the consumer intentionally made available to the general public via a channel of mass media, and did not restrict to a specific audience. f. The disclosure or transfer of personal data to a third party as an asset that is part of a merger, acquisition, bankruptcy, or other similar transaction in which the third party assumes control of all or part of the controller's assets, or a proposed merger, acquisition, bankruptcy, or other similar transaction in which the third party assumes control of all or part of the controller's assets.",
      "section": "12D-102",
      "notes": ""
    },
    "Sensitive data": {
      "term": "Sensitive data",
      "definition": "personal data that includes any of the following: a. Data revealing racial or ethnic origin, religious beliefs, mental or physical health condition or diagnosis (including pregnancy), sex life, sexual orientation, status as transgender or nonbinary, citizenship status, or immigration status. b. Genetic or biometric data. c. Personal data of a known child. d. Precise geolocation data.",
      "section": "12D-102",
      "notes": ""
    },
    "Sexual assault": {
      "term": "Sexual assault",
      "definition": "any of the offenses defined in §§ 768 to 780 and § 787 of Title 11, or any equivalent provision in the laws of any other state, the United States, any territory, district, or subdivision of the United States, or any foreign jurisdiction.",
      "section": "12D-102",
      "notes": ""
    },
    "Stalking": {
      "term": "Stalking",
      "definition": "the offense defined in § 1312 of Title 11, or any equivalent provision in the laws of any other state, the United States, any territory, district, or subdivision of the United States, or any foreign jurisdiction.",
      "section": "12D-102",
      "notes": ""
    },
    "Targeted advertising": {
      "term": "Targeted advertising",
      "definition": "displaying advertisements to a consumer where the advertisement is selected based on personal data obtained or inferred from that consumer's activities over time and across nonaffiliated Internet websites or online applications to predict such consumer's preferences or interests. \"Targeted advertising\" does not include any of the following: a. Advertisements based on activities within a controller's own Internet websites or online applications. b. Advertisements based on the context of a consumer's current search query, visit to an Internet website, or online application. c. Advertisements directed to a consumer in direct response to the consumer's request for information or feedback. d. Processing personal data solely to measure or report advertising frequency, performance, or reach.",
      "section": "12D-102",
      "notes": ""
    },
    "Third party": {
      "term": "Third party",
      "definition": "with respect to personal data controlled by a controller, any person other than the relevant consumer, the controller of such personal data, or a processor or an affiliate of the processor or the controller.",
      "section": "12D-102",
      "notes": ""
    },
    "Trade secret": {
      "term": "Trade secret",
      "definition": "as defined in § 2001(4) of this title.",
      "section": "12D-102",
      "notes": ""
    },
    "Violent felony": {
      "term": "Violent felony",
      "definition": "as defined in § 4201 of Title 11 and includes any equivalent provision in the laws of any other state, the United States, and territory, district, or subdivision of the United States, or any foreign jurisdiction.",
      "section": "12D-102",
      "notes": ""
    }
  },
  "requirements": [
    {
      "id": "6da3785c-b6d4-4637-a44e-2ed71b9ad2a7",
      "description": "Applicability thresholds: Chapter applies to persons conducting business in Delaware or targeting Delaware residents who meet specified data processing thresholds",
      "citation": {
        "section": "12D-103(a)",
        "quoted_text": "This chapter applies to persons that conduct business in the State or persons that produce products or services that are targeted to residents of the State and that during the preceding calendar year did any of the following: (1) Controlled or processed the personal data of not less than 35,000 consumers, excluding personal data controlled or processed solely for the purpose of completing a payment transaction. (2) Controlled or processed the personal data of not less than 10,000 consumers and derived more than 20% of their gross revenue from the sale of personal data.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          175,
          176
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "Persons conducting business in Delaware or targeting Delaware residents",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "During preceding calendar year, controlled/processed personal data of 35,000+ consumers (excluding payment transaction data only), OR",
        "During preceding calendar year, controlled/processed personal data of 10,000+ consumers AND derived >20% gross revenue from sale of personal data"
      ],
      "source_section": "12D-103",
      "obligation_type": "must"
    },
    {
      "id": "6a73a186-ef0a-418f-ad1a-c334975699ea",
      "description": "Entity exemptions: Chapter does not apply to specified governmental bodies, financial institutions, nonprofit organizations, and securities/futures associations",
      "citation": {
        "section": "12D-103(b)",
        "quoted_text": "This chapter does not apply to any of the following entities: (1) Any regulatory, administrative, advisory, executive, appointive, legislative, or judicial body of the State or a political subdivision of the State, including any board, bureau, commission, agency of the State or a political subdivision of the State, but excluding any institution of higher education. (2) Any financial institution or affiliate of a financial institution, all as defined in 15 U.S.C. § 6809, to the extent that the financial institution or affiliate is subject to Title V of the Gramm Leach Bliley Act (15 U.S.C. § 6801, et seq., as amended) and the rules and implementing regulations promulgated thereunder. (3) Any nonprofit organization dedicated exclusively to preventing and addressing insurance crime. (4) A national securities association registered pursuant to § 15A of the Securities Exchange Act of 1934 (15 U.S.C. § 78o-3, as amended)... or a registered futures association so designated pursuant to § 17 of the Commodity Exchange Act (7 U.S.C. § 21, as amended)...",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          180,
          181
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "State/political subdivision governmental bodies (excluding higher education institutions), GLBA-covered financial institutions, nonprofit insurance crime prevention organizations, registered securities/futures associations",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Entity falls within one of the enumerated exempt categories"
      ],
      "source_section": "12D-103",
      "obligation_type": "may"
    },
    {
      "id": "5fd585b6-9095-486c-ac9f-b508ef99d3c1",
      "description": "Data exemptions: Chapter does not apply to specified categories of data including HIPAA protected health information, research data, credit reporting data, and other federally regulated data",
      "citation": {
        "section": "12D-103(c)",
        "quoted_text": "This chapter does not apply to the following information and data: (1) Protected health information under HIPAA. (2) Patient-identifying information for purposes of 42 U.S.C. § 290dd-2. (3) Identifiable private information, as defined in 45 C.F.R. § 46.102, to the extent that it is used for purposes of the federal policy for the protection of human subjects pursuant to 45 C.F.R. Part 46. (4) Identifiable private information to the extent it is collected and used as part of human subjects research pursuant to the ICH E6 Good Clinical Practice Guideline... (5) Patient safety work product, as defined in 42 C.F.R. § 3.20... (6) Information to the extent it is used for public health, community health, or population health activities and purposes, as authorized by HIPAA... (7) The collection, maintenance, disclosure, sale, communication, or use of any personal information bearing on a consumer's credit worthiness... by a consumer reporting agency... authorized under the federal Fair Credit Reporting Act (15 U.S.C. § 1681, et seq., as amended). (8) Personal data collected, processed, sold, or disclosed in compliance with the Driver's Privacy Protection Act of 1994, 18 U.S.C. § 2721, et seq., as amended. (9) Personal data regulated by the Family Educational Rights and Privacy Act, 20 U.S.C. § 1232g, et seq., as amended. (10) Personal data collected, processed, sold, or disclosed in compliance with the Farm Credit Act, 12 U.S.C. § 2001, et seq., as amended. (11) Data processed or maintained [for employment/contractor purposes, emergency contact, or employee benefits administration]. (12) Personal data collected, processed, sold, or disclosed in relation to price, route, or service... by an air carrier subject to [Airline Deregulation Act]. (13) Personal data of a victim of or witness to child abuse, domestic violence, human trafficking, sexual assault, violent felony, or stalking that is collected, processed, or maintained by a nonprofit organization that provides services to victims... (14) Data subject to Title V of the Gramm Leach Bliley Act...",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          192,
          193
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "All covered entities",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Data falls within one of the enumerated exempt categories"
      ],
      "source_section": "12D-103",
      "obligation_type": "may"
    },
    {
      "id": "6876501c-f6c4-4593-82d9-e317d4f3218e",
      "description": "COPPA compliance deemed compliant: Controllers and processors complying with COPPA verifiable parental consent requirements are deemed compliant with parental consent obligations under this chapter for child consumers",
      "citation": {
        "section": "12D-103(d)",
        "quoted_text": "Controllers and processors that comply with the verifiable parental consent requirements of COPPA shall be deemed compliant with any obligation to obtain parental consent set forth in this chapter with respect to a consumer who is a child.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          37,
          37
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Controller or processor complies with COPPA verifiable parental consent requirements",
        "Consumer is a child"
      ],
      "source_section": "12D-103",
      "obligation_type": "may"
    },
    {
      "id": "e261896c-2ea0-48d8-9ce2-07f217d9f9e9",
      "description": "Response deadline: Controller must respond to consumer requests within 45 days, with possible 45-day extension if reasonably necessary",
      "citation": {
        "section": "12D-104(c)(1)",
        "quoted_text": "A controller shall respond to the consumer without undue delay, but not later than 45 days after receipt of the request. The controller may extend the response period by 45 additional days when reasonably necessary, considering the complexity and number of the consumer's requests, provided the controller informs the consumer of any such extension within the initial 45-day response period and of the reason for the extension.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          4,
          4
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Consumer submits request to exercise rights",
        "Extension notice provided within initial 45 days if extension used"
      ],
      "source_section": "12D-104",
      "obligation_type": "shall"
    },
    {
      "id": "f3a2ff7e-9766-4de1-b600-cf650259aa0c",
      "description": "Notice of denial: If controller declines request, must inform consumer within 45 days with justification and appeal instructions",
      "citation": {
        "section": "12D-104(c)(2)",
        "quoted_text": "If a controller declines to take action regarding the consumer's request, the controller shall inform the consumer without undue delay, but not later than 45 days after receipt of the request, of the justification for declining to take action and instructions for how to appeal the decision.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          4,
          4
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Controller declines to take action on consumer request"
      ],
      "source_section": "12D-104",
      "obligation_type": "shall"
    },
    {
      "id": "be9626b4-faf5-4a0f-b2ab-d717df100441",
      "description": "Free response once per 12 months: Controller must provide information in response to consumer request free of charge once per consumer during any 12-month period; may charge reasonable fee or decline manifestly unfounded, excessive, or repetitive requests",
      "citation": {
        "section": "12D-104(c)(3)",
        "quoted_text": "Information provided in response to a consumer request shall be provided by a controller, free of charge, once per consumer during any 12-month period. If requests from a consumer are manifestly unfounded, excessive or repetitive, the controller may charge the consumer a reasonable fee to cover the administrative costs of complying with the request or decline to act on the request. The controller bears the burden of demonstrating the manifestly unfounded, excessive or repetitive nature of the request.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          37,
          37
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "First request within 12-month period must be free",
        "Controller bears burden of proof for unfounded/excessive/repetitive determination"
      ],
      "source_section": "12D-104",
      "obligation_type": "shall"
    },
    {
      "id": "cc760de3-9837-47da-aa44-c112cc2a376b",
      "description": "Authentication requirements: Controller not required to comply with requests if unable to authenticate using commercially-reasonable efforts; must provide notice to consumer requesting additional authentication information",
      "citation": {
        "section": "12D-104(c)(4)",
        "quoted_text": "If a controller is unable to authenticate a request to exercise any of the rights afforded under paragraphs (a)(1) through (a)(5) of this section, inclusive, using commercially-reasonable efforts, the controller shall not be required to comply with a request to initiate an action pursuant to this section and shall provide notice to the consumer that the controller is unable to authenticate the request to exercise such right or rights until such consumer provides additional information reasonably necessary to authenticate such consumer and such consumer's request to exercise such right or rights. A controller shall not be required to authenticate an opt-out request, but a controller may deny an opt-out request if the controller has a good faith, reasonable, and documented belief that such request is fraudulent.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          4,
          4
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Controller unable to authenticate request using commercially-reasonable efforts",
        "For opt-out denial: controller has good faith, reasonable, documented belief request is fraudulent"
      ],
      "source_section": "12D-104",
      "obligation_type": "shall_not"
    },
    {
      "id": "d083d68c-588e-4be6-aab7-19606b6b6aa8",
      "description": "Appeal process: Controller must establish process for consumer to appeal refusal to take action; must respond within 60 days with action taken or not taken and explanation; if denied, provide mechanism to contact Department of Justice",
      "citation": {
        "section": "12D-104(d)",
        "quoted_text": "A controller shall establish a process for a consumer to appeal the controller's refusal to take action on a request within a reasonable period of time after the consumer's receipt of the decision. The appeal process shall be conspicuously available and similar to the process for submitting requests to initiate action pursuant to this section. Not later than 60 days after receipt of an appeal, a controller shall inform the consumer in writing of any action taken or not taken in response to the appeal, including a written explanation of the reasons for the decisions. If the appeal is denied, the controller shall also provide the consumer with an online mechanism, if available, or other method through which the consumer may contact the Department of Justice to submit a complaint.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          4,
          4
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Consumer submits appeal of refusal",
        "Appeal process must be conspicuously available"
      ],
      "source_section": "12D-104",
      "obligation_type": "shall"
    },
    {
      "id": "4a6ad015-c357-4f7d-88a0-a6be7bf49b04",
      "description": "Universal opt-out mechanism recognition: Controller must comply with opt-out requests via universal opt-out mechanisms (browser settings, extensions, global device settings) if able to verify consumer identity and agent authority with commercially-reasonable effort",
      "citation": {
        "section": "12D-105(a)(b)",
        "quoted_text": "A consumer may designate an authorized agent to act on the consumer's behalf to opt out of the processing of such consumer's personal data for 1 or more of the purposes specified in § 12D-104(a)(6) of this title. The consumer may designate such authorized agent by way of, among other things, a platform, technology, or mechanism, including an Internet link or a browser setting, browser extension, or global device setting, indicating such consumer's intent to opt out of such processing... A controller shall comply with an opt-out request received from an authorized agent if the controller is able to verify, with commercially-reasonable effort, the identity of the consumer and the authorized agent's authority to act on such consumer's behalf.",
        "verified": true,
        "confidence": 0.7592165898617511,
        "line_numbers": [
          307,
          319
        ],
        "match_type": "fuzzy_multiline"
      },
      "category": "technical",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.7592165898617511,
      "conditions": [
        "Consumer designates authorized agent via platform, technology, or mechanism (including browser settings, extensions, or global device settings)",
        "Controller able to verify consumer identity and agent authority with commercially-reasonable effort"
      ],
      "source_section": "12D-105",
      "obligation_type": "shall"
    },
    {
      "id": "8f217747-4a23-47fa-afbc-13c4031de7c0",
      "description": "Data minimization, purpose limitation, and security: Controller must limit data collection to adequate, relevant, and reasonably necessary data; not process for incompatible purposes without consent; establish reasonable security practices; not process in violation of anti-discrimination laws",
      "citation": {
        "section": "12D-106(a)(1)(2)(3)(5)",
        "quoted_text": "(1) Limit the collection of personal data to what is adequate, relevant, and reasonably necessary in relation to the purposes for which such data is processed, as disclosed to the consumer. (2) Except as otherwise permitted by this chapter, not process personal data for purposes that are neither reasonably necessary to, nor compatible with, the disclosed purposes for which such personal data is processed, as disclosed to the consumer, unless the controller obtains the consumer's consent. (3) Establish, implement, and maintain reasonable administrative, technical, and physical data security practices to protect the confidentiality, integrity, and accessibility of personal data appropriate to the volume and nature of the personal data at issue. (5) Not process personal data in violation of the laws of this State and federal laws that prohibit unlawful discrimination.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          326,
          327
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "No conditions - affirmative obligations"
      ],
      "source_section": "12D-106",
      "obligation_type": "shall"
    },
    {
      "id": "eff3d8d2-e868-4ec8-af28-eabea0f197c2",
      "description": "Sensitive data consent requirement: Controller must not process sensitive data without consumer consent, or for known children without parental/guardian consent; must not process personal data of teens (13-17) for targeted advertising or sale without consent",
      "citation": {
        "section": "12D-106(a)(4)(7)",
        "quoted_text": "(4) Not process sensitive data concerning a consumer without obtaining the consumer's consent, or, in the case of the processing of sensitive data concerning a known child, without first obtaining consent from the child's parent or lawful guardian and otherwise complying with § 1204C of this title. (7) Not process the personal data of a consumer for purposes of targeted advertising, or sell the consumer's personal data without the consumer's consent, under circumstances where a controller has actual knowledge or wilfully disregards that the consumer is at least 13 years of age but younger than 18 years of age.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          334,
          335
        ],
        "match_type": "ngram"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Processing sensitive data",
        "OR processing data of known child",
        "OR processing data of teens age 13-17 for targeted advertising or sale"
      ],
      "source_section": "12D-106",
      "obligation_type": "shall_not"
    },
    {
      "id": "3af0bd1e-2306-4a7b-99c4-0e7de1d0d4ac",
      "description": "Consent revocation mechanism: Controller must provide effective mechanism for consumer to revoke consent that is at least as easy as consent mechanism; upon revocation, cease processing within 15 days",
      "citation": {
        "section": "12D-106(a)(6)",
        "quoted_text": "Provide an effective mechanism for a consumer to revoke the consumer's consent under this section that is at least as easy as the mechanism by which the consumer provided the consumer's consent and, upon revocation of such consent, cease to process the data as soon as practicable, but not later than 15 days after the receipt of such request.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          4,
          4
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Consumer provided consent",
        "Consumer revokes consent"
      ],
      "source_section": "12D-106",
      "obligation_type": "shall"
    },
    {
      "id": "9be352cc-6810-41ff-a7fa-72bd7006a4aa",
      "description": "Privacy notice content requirements: Controller must provide reasonably accessible, clear privacy notice with data categories, purposes, rights exercise methods, third-party sharing categories, and contact information",
      "citation": {
        "section": "12D-106(c)",
        "quoted_text": "A controller shall provide consumers with a reasonably accessible, clear, and meaningful privacy notice that includes all of the following: (1) The categories of personal data processed by the controller. (2) The purpose for processing personal data. (3) How consumers may exercise their consumer rights, including how a consumer may appeal a controller's decision with regard to the consumer's request. (4) The categories of personal data that the controller shares with third parties, if any. (5) The categories of third parties with which the controller shares personal data, if any. (6) An active electronic mail address or other online mechanism that the consumer may use to contact the controller.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          355,
          356
        ],
        "match_type": "contains"
      },
      "category": "disclosure",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "No conditions - affirmative obligation"
      ],
      "source_section": "12D-106",
      "obligation_type": "shall"
    },
    {
      "id": "ba285125-d043-4a12-a0b2-bee8098ec6d1",
      "description": "Opt-out mechanisms: Controller must provide clear link to opt-out webpage, and by Jan 1 2026 must recognize opt-out preference signals that meet specified technical requirements (consumer-friendly, no default settings, enable state/legitimacy determination)",
      "citation": {
        "section": "12D-106(e)(1)",
        "quoted_text": "a.1. Providing a clear and conspicuous link on the controller's Internet website to an Internet web page that enables a consumer, or an agent of the consumer, to opt out of the targeted advertising or the sale of the consumer's personal data. 2. Not later than January 1, 2026, allowing a consumer to opt out of any processing of the consumer's personal data for the purposes of targeted advertising, or any sale of such personal data, through an opt-out preference signal sent, with such consumer's consent, by a platform, technology, or mechanism to the controller indicating such consumer's intent to opt out of any such processing or sale. Such platform, technology, or mechanism shall do all of the following: A. Not unfairly disadvantage another controller. B. Not make use of a default setting, but, rather, require the consumer to make an affirmative, freely given, and unambiguous choice to opt out... C. Be consumer friendly and easy to use by the average consumer. D. Be as consistent as possible with any other similar platform, technology, or mechanism required by any federal or state law or regulation. E. Enable the controller to reasonably determine whether the consumer is a resident of the State and whether the consumer has made a legitimate request to opt out...",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          384,
          385
        ],
        "match_type": "contains"
      },
      "category": "technical",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Controller sells data or processes for targeted advertising",
        "Opt-out preference signal requirement effective Jan 1, 2026"
      ],
      "source_section": "12D-106",
      "obligation_type": "shall"
    },
    {
      "id": "aa607b81-baa0-4075-9be1-10af2fd3ce0e",
      "description": "Processor duties: Processor must adhere to controller instructions, assist with consumer rights requests, assist with security and breach notification, provide assessment information, ensure personnel confidentiality, delete/return data at service end, make compliance info available, engage subcontractors with required obligations, and allow/cooperate with assessments",
      "citation": {
        "section": "12D-107(a)(b)",
        "quoted_text": "A processor shall adhere to the instructions of a controller and shall assist the controller in meeting the controller's obligations under this chapter. Such assistance must include all of the following: (1) Taking into account the nature of processing and the information available to the processor, by appropriate technical and organizational measures, insofar as is reasonably practicable, to fulfill the controller's obligation to respond to consumer rights requests. (2) Taking into account the nature of processing and the information available to the processor, by assisting the controller in meeting the controller's obligations in relation to the security of processing the personal data and in relation to the notification of a \"breach of security,\" as defined in § 12B-101(1) this title, of the system of the processor, in order to meet the controller's obligations. (3) Providing necessary information to enable the controller to conduct and document data protection assessments. [Contract must require processor to:] (1) Ensure that each person processing personal data is subject to a duty of confidentiality with respect to the data. (2) At the controller's direction, delete or return all personal data to the controller as requested at the end of the provision of services, unless retention of the personal data is required by law. (3) Upon the reasonable request of the controller, make available to the controller all information in its possession necessary to demonstrate the processor's compliance with the obligations in this chapter. (4) After providing the controller an opportunity to object, engage any subcontractor pursuant to a written contract that requires the subcontractor to meet the obligations of the processor with respect to the personal data. (5) Allow, and cooperate with, reasonable assessments by the controller or the controller's designated assessor...",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          413,
          414
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Processor processes data on behalf of controller"
      ],
      "source_section": "12D-107",
      "obligation_type": "shall"
    },
    {
      "id": "610841df-a5eb-412f-a3d0-da3935ab7c0e",
      "description": "Data protection assessments: Controller controlling/processing 100,000+ consumers' data (excluding payment-only data) must conduct and document regular assessments for heightened-risk processing (targeted advertising, sales, certain profiling, sensitive data)",
      "citation": {
        "section": "12D-108(a)",
        "quoted_text": "A controller that controls or processes the data of not less than 100,000 consumers, excluding data controlled or processed solely for the purpose of completing a payment transaction, shall conduct and document, on a regular basis, a data protection assessment for each of the controller's processing activities that presents a heightened risk of harm to a consumer. For the purposes of this section, processing that presents a heightened risk of harm to a consumer includes any of the following: (1) The processing of personal data for the purposes of targeted advertising. (2) The sale of personal data. (3) The processing of personal data for the purposes of profiling, where such profiling presents a reasonably foreseeable risk of any of the following: a. Unfair or deceptive treatment of, or unlawful disparate impact on, consumers. b. Financial, physical, or reputational injury to consumers. c. A physical or other intrusion upon the solitude or seclusion, or the private affairs or concerns, of consumers, where such intrusion would be offensive to a reasonable person. d. Other substantial injury to consumers. (4) The processing of sensitive data.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          4,
          4
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Controllers controlling/processing 100,000+ consumers' data (excluding payment-only data)",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Controller meets 100k threshold",
        "Processing presents heightened risk (targeted advertising, sales, risky profiling, or sensitive data)"
      ],
      "source_section": "12D-108",
      "obligation_type": "shall"
    },
    {
      "id": "5d77d926-4983-4528-94b5-c0dbf21e693d",
      "description": "Assessment content and submission: Assessments must identify and weigh benefits against risks, considering safeguards, de-identification, reasonable expectations, context, and relationship; Attorney General may require disclosure for investigations; assessments confidential but usable in enforcement",
      "citation": {
        "section": "12D-108(b)(c)",
        "quoted_text": "Data protection assessments conducted pursuant to subsection (a) of this section shall identify and weigh the benefits that may flow, directly and indirectly, from the processing to the controller, the consumer, other stakeholders and the public against the potential risks to the rights of the consumer associated with such processing, as mitigated by safeguards that can be employed by the controller to reduce such risks. The controller shall factor into any such data protection assessment the use of de-identified data and the reasonable expectations of consumers, as well as the context of the processing and the relationship between the controller and the consumer whose personal data will be processed. The Attorney General may require that a controller disclose any data protection assessment that is relevant to an investigation conducted by the Attorney General, and the controller shall make the data protection assessment available to the Attorney General. The Attorney General may evaluate the data protection assessment for compliance with the responsibilities set forth in this chapter. Data protection assessments must be treated as confidential and are not public records within the meaning of § 10002(o) of Title 29. Notwithstanding the foregoing, a controller's data protection assessment may be used in an action to enforce this chapter.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          472,
          473
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Controllers required to conduct assessments",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Assessment required under 12D-108(a)",
        "Attorney General requests assessment in investigation"
      ],
      "source_section": "12D-108",
      "obligation_type": "shall"
    },
    {
      "id": "9113307d-e3cf-4341-9506-2defad2eafb8",
      "description": "Processing restrictions and exemptions: Chapter does not require re-identification or maintenance of identifiable data; chapter does not restrict controller/processor ability to comply with laws, legal process, law enforcement cooperation, legal claims, requested services, contracts, life/safety protection, security/fraud prevention, public research, or assist others with these activities",
      "citation": {
        "section": "12D-109(a) and 12D-110(a)",
        "quoted_text": "Nothing in this chapter shall be construed to require a controller or processor to re-identify de-identified data or pseudonymous data, or to maintain data in identifiable form, or collect, obtain, retain, or access any data or technology, in order to be capable of associating an authenticated consumer request with personal data... Nothing in this chapter shall be construed to restrict a controller's or processor's ability to do any of the following: (1) Comply with federal, state, or local laws, rules, or regulations. (2) Comply with a civil, criminal, or regulatory inquiry, investigation, subpoena, or summons by federal, state, local, or other governmental authorities. (3) Cooperate with law-enforcement agencies concerning conduct or activity that the controller or processor reasonably and in good faith believes may violate federal, state, or local laws, rules, or regulations. (4) Investigate, establish, exercise, prepare for, or defend legal claims. (5) Provide a product or service specifically requested by a consumer. (6) Perform under a contract to which a consumer is a party, including fulfilling the terms of a written warranty. (7) Take steps at the request of a consumer prior to entering into a contract. (8) Take immediate steps to protect an interest that is essential for the life or physical safety of the consumer or another individual... (9) Prevent, detect, protect against, or respond to security incidents, identity theft, fraud, harassment, malicious or deceptive activities, or any illegal activity... (10) Engage in public or peer-reviewed scientific research in the public interest... (11) Assist another controller, processor, or third party with any of the activities under this subsection.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          502,
          503
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Processing falls within enumerated permitted purposes"
      ],
      "source_section": "12D-109, 12D-110",
      "obligation_type": "may"
    },
    {
      "id": "a4f1f424-67b9-4ef6-b3b0-b7c7329a528e",
      "description": "Internal use exemption: Chapter obligations (except de-identification obligations) do not restrict collection, use, or retention of consumer data for internal use only to conduct internal research, effectuate product recall, identify/repair technical errors, or perform internal operations reasonably aligned with consumer expectations or compatible with providing requested services",
      "citation": {
        "section": "12D-110(b)",
        "quoted_text": "The obligations imposed on controllers or processors under this chapter, other than those imposed by § 12D-109 of this title, do not restrict a controller's or processor's ability to collect consumer data, or use or retain such data, for internal use only, to do any of the following: (1) Conduct internal research to develop, improve or repair products, services or technology. (2) Effectuate a product recall. (3) Identify and repair technical errors that impair existing or intended functionality. (4) Perform internal operations that are reasonably aligned with the expectations of the consumer or reasonably anticipated based on the consumer's existing relationship with the controller, or are otherwise compatible with processing data in furtherance of the provision of a product or service specifically requested by a consumer or the performance of a contract to which the consumer is a party.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          4,
          4
        ],
        "match_type": "exact_normalized"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Data collection, use, or retention for internal use only",
        "Purpose is one of the enumerated internal uses"
      ],
      "source_section": "12D-110",
      "obligation_type": "may"
    },
    {
      "id": "aa5161ca-905d-431f-af6b-fa09e9601e67",
      "description": "Enforcement authority and penalties: Department of Justice has enforcement authority under Chapter 25 of Title 29; violations deemed unlawful practice under § 2513 and violation of subchapter II",
      "citation": {
        "section": "12D-111(a)(e)",
        "quoted_text": "The Department of Justice has enforcement authority over this chapter and may investigate and prosecute violations of this chapter in accordance with the provisions of subchapter II of Chapter 25 of Title 29... A violation of this chapter shall be deemed an unlawful practice under § 2513 of this title and a violation of subchapter II of this title, and shall be enforced solely by the Department of Justice.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          617,
          618
        ],
        "match_type": "ngram"
      },
      "category": "legal_framework",
      "applies_to": "All covered controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Entity violates any provision of chapter"
      ],
      "source_section": "12D-111",
      "obligation_type": "shall"
    },
    {
      "id": "fde6cb98-8718-4daf-a5a6-43063e3c6714",
      "description": "Cure period: During Jan 1 - Dec 31 2025, Attorney General must issue notice of violation and allow 60-day cure before initiating enforcement if cure is possible; beginning Jan 1 2026, Attorney General may consider multiple factors (violations, size/complexity, processing extent, public harm, safety, error likelihood, past violations) in deciding whether to grant cure opportunity",
      "citation": {
        "section": "12D-111(b)(c)",
        "quoted_text": "During the period beginning on January 1, 2025, and ending on December 31, 2025, the Department of Justice shall, prior to initiating any action for a violation of any provision of this chapter, issue a notice of violation to the controller if the Department of Justice determines that a cure is possible. If the controller fails to cure such violation within 60 days of receipt of the notice of violation, the Department of Justice may bring an enforcement proceeding pursuant to subsection (a) of this section. Beginning on January 1, 2026, the Department of Justice may, in determining whether to grant a controller or processor the opportunity to cure an alleged violation of any provision of this chapter, may consider all of the following: (1) The number of violations. (2) The size and complexity of the controller or processor. (3) The nature and extent of the controller's or processor's processing activities. (4) The substantial likelihood of injury to the public. (5) The safety of persons or property. (6) Whether such alleged violation was likely caused by human or technical error. (7) The extent to which the controller or processor has violated this or similar laws in the past.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          602,
          603
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Violation occurs during specified time period",
        "For 2025: cure is possible",
        "For 2026+: Attorney General's discretion based on factors"
      ],
      "source_section": "12D-111",
      "obligation_type": "may"
    },
    {
      "id": "7f11788e-6421-4a52-be7a-b63724ae1da1",
      "description": "No private right of action: Chapter does not provide basis for or subject to private right of action for violations",
      "citation": {
        "section": "12D-111(d)",
        "quoted_text": "Nothing in this chapter shall be construed as providing the basis for, or be subject to, a private right of action for violations of said sections or any other law.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          37,
          37
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "All persons",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "No conditions - blanket prohibition"
      ],
      "source_section": "12D-111",
      "obligation_type": "may_not"
    }
  ],
  "unverified_items": [],
  "metadata": {
    "source_file": "State Privacy Laws\\Delaware Privacy Law.pdf",
    "total_requirements": 23,
    "verified_count": 23,
    "output_format": "json",
    "sections_processed": [
      "12D-103",
      "12D-104",
      "12D-105",
      "12D-106",
      "12D-107",
      "12D-108",
      "12D-109, 12D-110",
      "12D-110",
      "12D-111"
    ],
    "requirements_per_section": {
      "12D-103": 4,
      "12D-104": 5,
      "12D-105": 1,
      "12D-106": 5,
      "12D-107": 1,
      "12D-108": 2,
      "12D-109, 12D-110": 1,
      "12D-110": 1,
      "12D-111": 3
    },
    "total_extracted": 23,
    "defined_terms": [
      "Affiliate",
      "Authenticate",
      "Biometric data",
      "Business associate",
      "Child",
      "Child abuse",
      "Consent",
      "Consumer",
      "Controller",
      "COPPA",
      "Covered entity",
      "Dark pattern",
      "Decisions that produce legal or similarly significant effects concerning the consumer",
      "De-identified data",
      "Domestic violence",
      "Genetic data",
      "HIPAA",
      "Human trafficking",
      "Identified or identifiable individual",
      "Nonprofit organization",
      "Personal data",
      "Precise geolocation data",
      "Process",
      "Processing",
      "Processor",
      "Profiling",
      "Protected health information",
      "Pseudonymous data",
      "Publicly available information",
      "Sale of personal data",
      "Sensitive data",
      "Sexual assault",
      "Stalking",
      "Targeted advertising",
      "Third party",
      "Trade secret",
      "Violent felony"
    ],
    "section_types": {
      "12D-101": "preamble",
      "12D-102": "definitions",
      "12D-103": "applicability",
      "12D-104": "consumer_rights",
      "12D-105": "consumer_rights",
      "12D-106": "controller_duties",
      "12D-107": "processor_duties",
      "12D-108": "controller_duties",
      "12D-109": "general",
      "12D-110": "exemptions",
      "12D-111": "enforcement"
    }
  },
  "structure": {
    "name": "Delaware Personal Data Privacy Act",
    "citation": "6 Del. C. § 12D-101 et seq.; 84 Del. Laws, c. 197, § 1",
    "effective_date": "January 1, 2025",
    "sections": [
      {
        "id": "12D-101",
        "title": "Short title",
        "section_type": "preamble",
        "content": "This chapter shall be known and may be cited as the \"Delaware Personal Data Privacy Act.\"",
        "start_line": 1,
        "end_line": 15,
        "subsections": []
      },
      {
        "id": "12D-102",
        "title": "Definitions",
        "section_type": "definitions",
        "content": "For purposes of this chapter, the following definitions shall apply: (1) \"Affiliate\" means a legal entity that shares common branding with another legal entity or controls, is controlled by, or is u...",
        "start_line": 16,
        "end_line": 180,
        "subsections": []
      },
      {
        "id": "12D-103",
        "title": "Applicability of chapter",
        "section_type": "applicability",
        "content": "(a) This chapter applies to persons that conduct business in the State or persons that produce products or services that are targeted to residents of the State and that during the preceding calendar ...",
        "start_line": 181,
        "end_line": 295,
        "subsections": []
      },
      {
        "id": "12D-104",
        "title": "Consumer personal data rights",
        "section_type": "consumer_rights",
        "content": "(a) A consumer has the right to do all of the following: (1) Confirm whether a controller is processing the consumer's personal data and access such personal data, unless such confirmation or access...",
        "start_line": 296,
        "end_line": 410,
        "subsections": []
      },
      {
        "id": "12D-105",
        "title": "Designation of agent to exercise rights of consumer, including through universal opt-out mechanisms",
        "section_type": "consumer_rights",
        "content": "(a) A consumer may designate an authorized agent to act on the consumer's behalf to opt out of the processing of such consumer's personal data for 1 or more of the purposes specified in § 12D-104(a)...",
        "start_line": 411,
        "end_line": 430,
        "subsections": []
      },
      {
        "id": "12D-106",
        "title": "Duties of controllers",
        "section_type": "controller_duties",
        "content": "(a) A controller shall do all of the following: (1) Limit the collection of personal data to what is adequate, relevant, and reasonably necessary in relation to the purposes for which such data is p...",
        "start_line": 431,
        "end_line": 585,
        "subsections": []
      },
      {
        "id": "12D-107",
        "title": "Duties of processors",
        "section_type": "processor_duties",
        "content": "(a) A processor shall adhere to the instructions of a controller and shall assist the controller in meeting the controller's obligations under this chapter. Such assistance must include all of the f...",
        "start_line": 586,
        "end_line": 670,
        "subsections": []
      },
      {
        "id": "12D-108",
        "title": "Data protection assessments",
        "section_type": "controller_duties",
        "content": "(a) A controller that controls or processes the data of not less than 100,000 consumers, excluding data controlled or processed solely for the purpose of completing a payment transaction, shall cond...",
        "start_line": 671,
        "end_line": 745,
        "subsections": []
      },
      {
        "id": "12D-109",
        "title": "De-identified data",
        "section_type": "general",
        "content": "(a) Nothing in this chapter shall be construed to require a controller or processor to re-identify de-identified data or pseudonymous data, or to maintain data in identifiable form, or collect, obta...",
        "start_line": 746,
        "end_line": 790,
        "subsections": []
      },
      {
        "id": "12D-110",
        "title": "Exclusions",
        "section_type": "exemptions",
        "content": "(a) Nothing in this chapter shall be construed to restrict a controller's or processor's ability to do any of the following: (1) Comply with federal, state, or local laws, rules, or regulations. (2)...",
        "start_line": 791,
        "end_line": 930,
        "subsections": []
      },
      {
        "id": "12D-111",
        "title": "Enforcement",
        "section_type": "enforcement",
        "content": "(a) The Department of Justice has enforcement authority over this chapter and may investigate and prosecute violations of this chapter in accordance with the provisions of subchapter II of Chapter 25...",
        "start_line": 931,
        "end_line": 980,
        "subsections": []
      }
    ],
    "definitions": {
      "Affiliate": {
        "term": "Affiliate",
        "definition": "a legal entity that shares common branding with another legal entity or controls, is controlled by, or is under common control with another legal entity. For the purposes of this paragraph, \"control\" or \"controlled\" means any of the following: a. Ownership of, or the power to vote, more than 50% of the outstanding shares of any class of voting security of a legal entity. b. Control in any manner over the election of a majority of the directors or of individuals exercising similar functions. c. The power to exercise controlling influence over the management of a legal entity.",
        "section": "12D-102",
        "notes": ""
      },
      "Authenticate": {
        "term": "Authenticate",
        "definition": "to use reasonable means to determine that a request to exercise any of the rights afforded under § 12D-104(a)(1) to (a)(4) of this title, inclusive, is being made by, or on behalf of, the consumer who is entitled to exercise such consumer rights with respect to the personal data at issue.",
        "section": "12D-102",
        "notes": ""
      },
      "Biometric data": {
        "term": "Biometric data",
        "definition": "data generated by automatic measurements of an individual's unique biological characteristics, such as a fingerprint, a voiceprint, eye retinas, irises, or other unique biological patterns or characteristics that are used to identify a specific individual. \"Biometric data\" does not include any of the following: a. A digital or physical photograph. b. An audio or video recording. c. Any data generated from a digital or physical photograph, or an audio or video recording, unless such data is generated to identify a specific individual.",
        "section": "12D-102",
        "notes": ""
      },
      "Business associate": {
        "term": "Business associate",
        "definition": "as defined in HIPAA.",
        "section": "12D-102",
        "notes": ""
      },
      "Child": {
        "term": "Child",
        "definition": "as defined in COPPA.",
        "section": "12D-102",
        "notes": ""
      },
      "Child abuse": {
        "term": "Child abuse",
        "definition": "with respect to an individual under 18 years of age, as defined in § 901(1) of Title 10, or any equivalent provision in the laws of any other state, the United States, any territory, district, or subdivision of the United States, or any foreign jurisdiction.",
        "section": "12D-102",
        "notes": ""
      },
      "Consent": {
        "term": "Consent",
        "definition": "a clear affirmative act signifying a consumer's freely given, specific, informed and unambiguous agreement to allow the processing of personal data relating to the consumer. \"Consent\" may include a written statement, including by electronic means, or any other unambiguous affirmative action. \"Consent\" does not include any of the following: a. Acceptance of a general or broad terms of use or similar document that contains descriptions of personal data processing along with other, unrelated information. b. Hovering over, muting, pausing, or closing a given piece of content. c. Agreement obtained through the use of dark patterns.",
        "section": "12D-102",
        "notes": ""
      },
      "Consumer": {
        "term": "Consumer",
        "definition": "an individual who is a resident of this State. \"Consumer\" does not include an individual acting in a commercial or employment context or as an employee, owner, director, officer, or contractor of a company, partnership, sole proprietorship, nonprofit organization, or government agency whose communications or transactions with the controller occur solely within the context of that individual's role with the company, partnership, sole proprietorship, nonprofit organization, or government agency.",
        "section": "12D-102",
        "notes": ""
      },
      "Controller": {
        "term": "Controller",
        "definition": "a person that, alone or jointly with others, determines the purpose and means of processing personal data.",
        "section": "12D-102",
        "notes": ""
      },
      "COPPA": {
        "term": "COPPA",
        "definition": "the Children's Online Privacy Protection Act of 1998, 15 U.S.C. § 6501, et seq., and the regulations, rules, guidance, and exemptions adopted pursuant to said act, as said act and such regulations, rules, guidance, and exemptions may be amended.",
        "section": "12D-102",
        "notes": ""
      },
      "Covered entity": {
        "term": "Covered entity",
        "definition": "as defined in HIPAA.",
        "section": "12D-102",
        "notes": ""
      },
      "Dark pattern": {
        "term": "Dark pattern",
        "definition": "any of the following: a. A user interface designed or manipulated with the substantial effect of subverting or impairing user autonomy, decision-making, or choice. b. Any other practice the Federal Trade Commission refers to as a \"dark pattern.\"",
        "section": "12D-102",
        "notes": ""
      },
      "Decisions that produce legal or similarly significant effects concerning the consumer": {
        "term": "Decisions that produce legal or similarly significant effects concerning the consumer",
        "definition": "decisions made by the controller that result in the provision or denial by the controller of financial or lending services, housing, insurance, education enrollment or opportunity, criminal justice, employment opportunities, health-care services, or access to essential goods or services.",
        "section": "12D-102",
        "notes": ""
      },
      "De-identified data": {
        "term": "De-identified data",
        "definition": "data that cannot reasonably be used to infer information about, or otherwise be linked to, an identified or identifiable individual, or a device linked to such individual, if the controller that possesses such data does all of the following: a. Takes reasonable measures to ensure that such data cannot be associated with an individual. b. Publicly commits to process such data only in a de-identified fashion and not attempt to re-identify such data. c. Contractually obligates any recipients of such data to comply with all of the provisions of this chapter applicable to the controller with respect to such data.",
        "section": "12D-102",
        "notes": ""
      },
      "Domestic violence": {
        "term": "Domestic violence",
        "definition": "as defined in § 1041 of Title 10, or any equivalent provision in the laws of any other state, the United States, any territory, district, or subdivision of the United States, or any foreign jurisdiction.",
        "section": "12D-102",
        "notes": ""
      },
      "Genetic data": {
        "term": "Genetic data",
        "definition": "any data, regardless of its format, that results from the analysis of a biological sample of an individual, or from another source enabling equivalent information to be obtained, and concerns genetic material. For purposes of this paragraph, \"genetic material\" includes deoxyribonucleic acids (DNA), ribonucleic acids (RNA), genes, chromosomes, alleles, genomes, alterations or modifications to DNA or RNA, single nucleotide polymorphisms (SNPs), uninterpreted data that results from analysis of the biological sample or other source, and any information extrapolated, derived, or inferred therefrom.",
        "section": "12D-102",
        "notes": ""
      },
      "HIPAA": {
        "term": "HIPAA",
        "definition": "the Health Insurance Portability and Accountability Act of 1996, 42 U.S.C. § 1320d, et seq., as amended.",
        "section": "12D-102",
        "notes": ""
      },
      "Human trafficking": {
        "term": "Human trafficking",
        "definition": "the offense defined in § 787 of Title 11, or any equivalent provision in the laws of any other state, the United States, any territory, district, or subdivision of the United States, or any foreign jurisdiction.",
        "section": "12D-102",
        "notes": ""
      },
      "Identified or identifiable individual": {
        "term": "Identified or identifiable individual",
        "definition": "an individual who can be readily identified, directly or indirectly.",
        "section": "12D-102",
        "notes": ""
      },
      "Nonprofit organization": {
        "term": "Nonprofit organization",
        "definition": "any organization that is exempt from taxation under § 501(c)(3), (c)(4), (c)(6) or (c)(12) of the Internal Revenue Code of 1986 [26 U.S.C. § 501(c)(3), (c)(4), (c)(6) or (c)(12)], or any subsequent corresponding internal revenue code of the United States, as amended.",
        "section": "12D-102",
        "notes": ""
      },
      "Personal data": {
        "term": "Personal data",
        "definition": "any information that is linked or reasonably linkable to an identified or identifiable individual, and does not include de-identified data or publicly available information.",
        "section": "12D-102",
        "notes": ""
      },
      "Precise geolocation data": {
        "term": "Precise geolocation data",
        "definition": "information derived from technology, including global positioning system level latitude and longitude coordinates or other mechanisms, that directly identifies the specific location of an individual with precision and accuracy within a radius of 1,750 feet. \"Precise geolocation data\" does not include the content of communications or any data generated by or connected to advanced utility metering infrastructure systems or equipment for use by a utility.",
        "section": "12D-102",
        "notes": ""
      },
      "Process": {
        "term": "Process",
        "definition": "any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion, or modification of personal data.",
        "section": "12D-102",
        "notes": ""
      },
      "Processing": {
        "term": "Processing",
        "definition": "any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion, or modification of personal data.",
        "section": "12D-102",
        "notes": ""
      },
      "Processor": {
        "term": "Processor",
        "definition": "a person that processes personal data on behalf of a controller.",
        "section": "12D-102",
        "notes": ""
      },
      "Profiling": {
        "term": "Profiling",
        "definition": "any form of automated processing performed on personal data to evaluate, analyze, or predict personal aspects related to an identified or identifiable individual's economic situation, health, demographic characteristics, personal preferences, interests, reliability, behavior, location, or movements.",
        "section": "12D-102",
        "notes": ""
      },
      "Protected health information": {
        "term": "Protected health information",
        "definition": "as defined in HIPAA.",
        "section": "12D-102",
        "notes": ""
      },
      "Pseudonymous data": {
        "term": "Pseudonymous data",
        "definition": "personal data that cannot be attributed to a specific individual without the use of additional information, provided such additional information is kept separately and is subject to appropriate technical and organizational measures to ensure that the personal data is not attributed to an identified or identifiable individual.",
        "section": "12D-102",
        "notes": ""
      },
      "Publicly available information": {
        "term": "Publicly available information",
        "definition": "any of the following: a. Information that is lawfully made available through federal, state, or local government records. b. Information that a controller has a reasonable basis to believe that the consumer has lawfully made available to the general public through widely distributed media.",
        "section": "12D-102",
        "notes": ""
      },
      "Sale of personal data": {
        "term": "Sale of personal data",
        "definition": "the exchange of personal data for monetary or other valuable consideration by the controller to a third party. \"Sale of personal data\" does not include any of the following: a. The disclosure of personal data to a processor that processes the personal data on behalf of the controller where limited to the purpose of such processing. b. The disclosure of personal data to a third party for purposes of providing a product or service affirmatively requested by the consumer. c. The disclosure or transfer of personal data to an affiliate of the controller. d. The disclosure of personal data where the consumer directs the controller to disclose the personal data or intentionally uses the controller to interact with a third party. e. The disclosure of personal data that the consumer intentionally made available to the general public via a channel of mass media, and did not restrict to a specific audience. f. The disclosure or transfer of personal data to a third party as an asset that is part of a merger, acquisition, bankruptcy, or other similar transaction in which the third party assumes control of all or part of the controller's assets, or a proposed merger, acquisition, bankruptcy, or other similar transaction in which the third party assumes control of all or part of the controller's assets.",
        "section": "12D-102",
        "notes": ""
      },
      "Sensitive data": {
        "term": "Sensitive data",
        "definition": "personal data that includes any of the following: a. Data revealing racial or ethnic origin, religious beliefs, mental or physical health condition or diagnosis (including pregnancy), sex life, sexual orientation, status as transgender or nonbinary, citizenship status, or immigration status. b. Genetic or biometric data. c. Personal data of a known child. d. Precise geolocation data.",
        "section": "12D-102",
        "notes": ""
      },
      "Sexual assault": {
        "term": "Sexual assault",
        "definition": "any of the offenses defined in §§ 768 to 780 and § 787 of Title 11, or any equivalent provision in the laws of any other state, the United States, any territory, district, or subdivision of the United States, or any foreign jurisdiction.",
        "section": "12D-102",
        "notes": ""
      },
      "Stalking": {
        "term": "Stalking",
        "definition": "the offense defined in § 1312 of Title 11, or any equivalent provision in the laws of any other state, the United States, any territory, district, or subdivision of the United States, or any foreign jurisdiction.",
        "section": "12D-102",
        "notes": ""
      },
      "Targeted advertising": {
        "term": "Targeted advertising",
        "definition": "displaying advertisements to a consumer where the advertisement is selected based on personal data obtained or inferred from that consumer's activities over time and across nonaffiliated Internet websites or online applications to predict such consumer's preferences or interests. \"Targeted advertising\" does not include any of the following: a. Advertisements based on activities within a controller's own Internet websites or online applications. b. Advertisements based on the context of a consumer's current search query, visit to an Internet website, or online application. c. Advertisements directed to a consumer in direct response to the consumer's request for information or feedback. d. Processing personal data solely to measure or report advertising frequency, performance, or reach.",
        "section": "12D-102",
        "notes": ""
      },
      "Third party": {
        "term": "Third party",
        "definition": "with respect to personal data controlled by a controller, any person other than the relevant consumer, the controller of such personal data, or a processor or an affiliate of the processor or the controller.",
        "section": "12D-102",
        "notes": ""
      },
      "Trade secret": {
        "term": "Trade secret",
        "definition": "as defined in § 2001(4) of this title.",
        "section": "12D-102",
        "notes": ""
      },
      "Violent felony": {
        "term": "Violent felony",
        "definition": "as defined in § 4201 of Title 11 and includes any equivalent provision in the laws of any other state, the United States, and territory, district, or subdivision of the United States, or any foreign jurisdiction.",
        "section": "12D-102",
        "notes": ""
      }
    }
  }
}