{
  "statute_name": "Indiana Privacy Law",
  "effective_date": "2026-01-01",
  "definitions": {
    "Affiliate": {
      "term": "Affiliate",
      "definition": "a legal entity that: (1) controls, is controlled by, or is under common control with another legal entity; or (2) shares common branding with another legal entity. For purposes of this section, \"control\", with respect to a company, means: (1) ownership of, or the power to vote, more than fifty percent (50%) of the outstanding shares of any class of voting security of the company; (2) control in any manner over the election of a majority of the directors or of individuals exercising similar functions; or (3) the power to exercise controlling influence over the management of the company.",
      "section": "24-15-2-1",
      "notes": ""
    },
    "Aggregate data": {
      "term": "Aggregate data",
      "definition": "information: (1) that relates to a group or category of consumers; (2) from which individual consumer identities have been removed; and (3) that is not linked or reasonably linkable to any consumer.",
      "section": "24-15-2-2",
      "notes": ""
    },
    "Authenticate": {
      "term": "Authenticate",
      "definition": "to verify through reasonable means that a consumer who is entitled to exercise the personal data rights provided by IC 24-15-3 is the same consumer exercising such rights with respect to particular personal data.",
      "section": "24-15-2-3",
      "notes": ""
    },
    "Biometric data": {
      "term": "Biometric data",
      "definition": "data that: (1) is generated by automatic measurements ofan individual's biological characteristics, such as a fingerprint, a voiceprint, images of the retina or iris, or other unique biological patterns or characteristics; and (2) is used to identify a specific individual. The term does not include: (1) a physical or digital photograph, or data generated from a physical or digital photograph; (2) a video or audio recording, or data generated from a video or audio recording; or (3) information collected, used, or stored for health care treatment, payment, or operations under HIPAA.",
      "section": "24-15-2-4",
      "notes": ""
    },
    "Business associate": {
      "term": "Business associate",
      "definition": "has the meaning set forth in 45 CFR 160.103.",
      "section": "24-15-2-5",
      "notes": ""
    },
    "Child": {
      "term": "Child",
      "definition": "any individual who is less than thirteen (13) years of age.",
      "section": "24-15-2-6",
      "notes": ""
    },
    "Consent": {
      "term": "Consent",
      "definition": "a clear affirmative act that signifies a consumer's freely given, specific, informed, and unambiguous agreement to process personal data relating to the consumer. For purposes of this section, a \"clear affirmative act\" includes a written statement, including a statement written by electronic means, or any other unambiguous affirmative action.",
      "section": "24-15-2-7",
      "notes": ""
    },
    "Consumer": {
      "term": "Consumer",
      "definition": "an individual who: (1) is a resident of Indiana; and (2) is acting only for a personal, family, or household purpose. The term does not include an individual acting in a commercial or employment context.",
      "section": "24-15-2-8",
      "notes": ""
    },
    "Controller": {
      "term": "Controller",
      "definition": "a person that, alone or jointly with others, determines the purpose and means of processing personal data.",
      "section": "24-15-2-9",
      "notes": ""
    },
    "Covered entity": {
      "term": "Covered entity",
      "definition": "has the meaning set forth in 45 CFR 160.103.",
      "section": "24-15-2-10",
      "notes": ""
    },
    "Decision that produces legal or similarly significant effects concerning a consumer": {
      "term": "Decision that produces legal or similarly significant effects concerning a consumer",
      "definition": "a decision made by a controller that results in the provision or denial by the controller of: (1) financial and lending services; (2) housing; (3) insurance; (4) education enrollment; (5) criminal justice; (6) employment opportunities; (7) health care services; or (8) access to basic necessities, such as food and water.",
      "section": "24-15-2-11",
      "notes": ""
    },
    "De-identified data": {
      "term": "De-identified data",
      "definition": "data that cannot reasonably be linked to an identified or identifiable individual because a controller that possesses the data: (1) takes reasonable measures to ensure that the data cannot be associated with an individual; (2) publicly commits to maintaining and using the data without attempting to re-identify the data; and (3) obligates any recipients of the data through contractual requirements to comply with all applicable provisions of this article.",
      "section": "24-15-2-12",
      "notes": ""
    },
    "Health care provider": {
      "term": "Health care provider",
      "definition": "has the meaning set forth in IC 4-6-14-2.",
      "section": "24-15-2-13",
      "notes": ""
    },
    "Health record": {
      "term": "Health record",
      "definition": "has the meaning set forth in IC 1-1-4-5(a)(6).",
      "section": "24-15-2-14",
      "notes": ""
    },
    "HIPAA": {
      "term": "HIPAA",
      "definition": "refers to the federal Health Insurance Portability and Accountability Act of 1996 (42 U.S.C. 1320d et seq.).",
      "section": "24-15-2-15",
      "notes": ""
    },
    "Identified or identifiable individual": {
      "term": "Identified or identifiable individual",
      "definition": "an individual who can be readily identified, directly or indirectly.",
      "section": "24-15-2-16",
      "notes": ""
    },
    "Institution of higher education": {
      "term": "Institution of higher education",
      "definition": "a public or private college or university.",
      "section": "24-15-2-17",
      "notes": ""
    },
    "Nonprofit organization": {
      "term": "Nonprofit organization",
      "definition": "any organization exempt from taxation under Section 501(c)(3), 501(c)(6), or 501(c)(12) of the Internal Revenue Code.",
      "section": "24-15-2-18",
      "notes": ""
    },
    "Personal data": {
      "term": "Personal data",
      "definition": "information that is linked or reasonably linkable to an identified or identifiable individual. The term does not include: (1) de-identified data; (2) aggregate data; or (3) publicly available information.",
      "section": "24-15-2-19",
      "notes": ""
    },
    "Precise geolocation data": {
      "term": "Precise geolocation data",
      "definition": "information derived from technology, including global positioning system level latitude and longitude coordinates, that directly identifies the specific location of a natural person with precision and accuracy within a radius of one thousand seven hundred fifty (1,750) feet. The term does not include: (1) the content of communications; or (2) any data generated by or connected to advanced utility metering infrastructure systems or equipment for use by a utility.",
      "section": "24-15-2-20",
      "notes": ""
    },
    "Processing": {
      "term": "Processing",
      "definition": "with respect to personal data, means any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion, or modification of personal data.",
      "section": "24-15-2-21",
      "notes": ""
    },
    "Processor": {
      "term": "Processor",
      "definition": "a person that processes personal data on behalf of a controller.",
      "section": "24-15-2-22",
      "notes": ""
    },
    "Profiling": {
      "term": "Profiling",
      "definition": "any form of solely automated processing performed on personal data to evaluate, analyze, or predict personal aspects related to an identified or identifiable individual's economic situation, health or health records, personal preferences, interests, reliability, behavior, location, or movements.",
      "section": "24-15-2-23",
      "notes": ""
    },
    "Protected health information": {
      "term": "Protected health information",
      "definition": "has the meaning set forth in 45 CFR 160.103.",
      "section": "24-15-2-24",
      "notes": ""
    },
    "Pseudonymous data": {
      "term": "Pseudonymous data",
      "definition": "personal data that cannot be attributed to a specific individual because additional information that would allow the data to be attributed to a specific individual is: (1) kept separately; and (2) subject to appropriate technical and organizational measures; to ensure that the personal data is not attributed to an identified or identifiable individual.",
      "section": "24-15-2-25",
      "notes": ""
    },
    "Publicly available information": {
      "term": "Publicly available information",
      "definition": "information: (1) that is lawfully made available through federal, state, or local government records; or (2) that a business has a reasonable basis to believe is lawfully made available: (A) to the general public through widely distributed media; (B) by the consumer to whom the information pertains; or (C) by a person to whom the consumer has disclosed the information; unless the consumer has restricted the information to a specific audience.",
      "section": "24-15-2-26",
      "notes": ""
    },
    "Sale of personal data": {
      "term": "Sale of personal data",
      "definition": "the exchange of personal data for monetary consideration by a controller to a third party. The term does not include: (1) the disclosure of personal data to a processor that processes the personal data on behalf of the controller; (2) the disclosure of personal data to a third party for purposes of providing a product or service requested by: (A) the consumer; or (B) the parent of a child; to whom the personal data pertains; (3) the disclosure or transfer of personal data to an affiliate of the controller; (4) the disclosure of information that the consumer: (A) intentionally made available to the general public via a channel of mass media; and (B) did not restrict to a specific audience; or (5) the disclosure or transfer of personal data to a third party as an asset that is part of a proposed or actual merger, acquisition, bankruptcy, or other transaction in which the third party assumes control of all or part of the controller's assets.",
      "section": "24-15-2-27",
      "notes": ""
    },
    "Sensitive data": {
      "term": "Sensitive data",
      "definition": "a category of personal data that includes any of the following: (1) Personal data revealing racial or ethnic origin, religious beliefs, a mental or physical health diagnosis made by a health care provider, sexual orientation, or citizenship or immigration status. (2) Genetic or biometric data that is processed for the purpose of uniquely identifying a specific individual. (3) Personal data collected from a known child. (4) Precise geolocation data.",
      "section": "24-15-2-28",
      "notes": ""
    },
    "State agency": {
      "term": "State agency",
      "definition": "has the meaning set forth in IC 1-1-15-3.",
      "section": "24-15-2-29",
      "notes": ""
    },
    "Targeted advertising": {
      "term": "Targeted advertising",
      "definition": "the displaying of an advertisement to a consumer in which the advertisement is selected based on personal data obtained from that consumer's activities over time and across nonaffiliated websites or online applications to predict the consumer's preferences or interests. The term does not include: (1) advertisements based on activities within a controller's own or affiliated websites or online applications; (2) advertisements based on the context of a consumer's current search query, visit to a website, or online application; (3) advertisements directed to a consumer in response to the consumer's request for information or feedback; or (4) the processing of personal data solely for measuring or reporting advertising performance, reach, or frequency.",
      "section": "24-15-2-30",
      "notes": ""
    },
    "Third party": {
      "term": "Third party",
      "definition": "with respect to a context to which this article applies, means a natural or legal person, public authority, agency, or body other than: (1) the consumer; (2) the controller; (3) the processor; or (4) an affiliate of the processor or the controller.",
      "section": "24-15-2-31",
      "notes": ""
    },
    "Trade secret": {
      "term": "Trade secret",
      "definition": "has the meaning set forth in IC 24-2-3-2.",
      "section": "24-15-2-32",
      "notes": ""
    }
  },
  "requirements": [
    {
      "id": "17e87538-bd3a-4c17-b740-f8b5336aada4",
      "description": "Law applies to persons conducting business in Indiana or targeting Indiana residents who meet consumer data volume thresholds",
      "citation": {
        "section": "24-15-1-1(a)",
        "quoted_text": "This article applies to a person that conducts business in Indiana or produces products or services that are targeted to residents of Indiana and that during a calendar year: (1) controls or processes personal data of at least one hundred thousand (100,000) consumers who are Indiana residents; or (2) controls or processes personal data of at least twenty-five thousand (25,000) consumers who are Indiana residents and derives more than fifty percent (50%) of gross revenue from the sale of personal data.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          25,
          25
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Persons conducting business in Indiana or targeting Indiana residents",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Controls or processes personal data of at least 100,000 Indiana resident consumers per calendar year",
        "OR controls or processes personal data of at least 25,000 Indiana resident consumers per calendar year AND derives more than 50% of gross revenue from sale of personal data"
      ],
      "source_section": "24-15-1-1",
      "obligation_type": "shall"
    },
    {
      "id": "3598131e-d5be-4e5d-a48c-20987af10293",
      "description": "Entity-level exemptions from law applicability for government entities, financial institutions, HIPAA-covered entities, nonprofits, higher education institutions, public utilities, and certain insurance fraud detection organizations",
      "citation": {
        "section": "24-15-1-1(b)",
        "quoted_text": "This article does not apply to any of the following: (1) Either of the following: (A) The state, a state agency, or a body, authority, board, bureau, commission, district, or agency of any political subdivision of the state. (B) A third party under contract with an entity described in clause (A), when acting on behalf of the entity... (2) Any financial institutions and affiliates, or data subject to Title V of the federal Gramm-Leach-Bliley Act (15 U.S.C. 6801 et seq.). (3) Any covered entity or business associate governed by the privacy, security, and breach notification rules issued by the United States Department of Health and Human Services (45 CFR Parts 160 and 164) pursuant to HIPAA. (4) Any nonprofit organization. (5) Any institution of higher education. (6) Any public utility (as defined in IC 8-1-2-1(a)) or service company affiliated with a public utility... (7) Any organization exempt from taxation under Section 501(c)(4) of the Internal Revenue Code that is: (A) established to detect or prevent insurance related crime or fraud; and (B) subject to a memorandum of understanding with a statewide law enforcement agency.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          30,
          31
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "All entities",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Entity must not be: state/local government entities or their contractors acting on their behalf",
        "Financial institutions subject to Gramm-Leach-Bliley Act",
        "HIPAA-covered entities or business associates",
        "Nonprofit organizations",
        "Institutions of higher education",
        "Public utilities or affiliated service companies",
        "501(c)(4) organizations for insurance fraud detection with law enforcement MOU"
      ],
      "source_section": "24-15-1-1",
      "obligation_type": "may_not"
    },
    {
      "id": "9aa0d663-e0a7-414b-91cb-488893bb9096",
      "description": "Data-level exemptions from law for protected health information, patient identifying information, research data, health care quality information, employee data, consumer reports, driver data, educational records, farm credit data, and emergency contact information",
      "citation": {
        "section": "24-15-1-2",
        "quoted_text": "The following information and data are exempt from this article: (1) Protected health information under HIPAA and related regulations under 45 CFR Part 160, 45 CFR Part 162, and 45 CFR Part 164. (2) Patient identifying information for purposes of 42 U.S.C. 290dd-2. (3) Any of the following: (A) Identifiable private information for purposes of the federal policy for the protection of human subjects under 45 CFR Part 46... (9) The collection, maintenance, disclosure, sale, communication, or use of any personal information bearing on a consumer's credit worthiness... but only to the extent that such activity is regulated by and authorized under the federal Fair Credit Reporting Act (15 U.S.C. 1681 et seq.). (10) Personal data collected, processed, sold, or disclosed in compliance with the federal Driver's Privacy Protection Act of 1994 (18 U.S.C. 2721 et seq.). (11) Personal data regulated by the federal Family Educational Rights and Privacy Act (20 U.S.C. 1232g et seq.). (12) Personal data collected, processed, sold, or disclosed in compliance with the federal Farm Credit Act (12 U.S.C. 2001 et seq.). (13) Data processed or maintained: (A) in the course of an individual applying to, employed by, or acting as an agent or independent contractor of a controller, processor, or third party... (B) as emergency contact information...",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          50,
          51
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "All controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Information must fall under one of the listed categories of exempt data"
      ],
      "source_section": "24-15-1-2",
      "obligation_type": "may_not"
    },
    {
      "id": "5aa9382b-344c-42ff-9a4d-15dbd214616e",
      "description": "COPPA compliance satisfies parental consent obligation under Indiana law",
      "citation": {
        "section": "24-15-1-3",
        "quoted_text": "A: (1) controller; or (2) processor; that complies with the Children's Online Privacy Protection Act (15 U.S.C. 6501 et seq.), and with any rules or regulations under that act, satisfies any obligation to obtain parental consent under this article.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Entity complies with COPPA and related rules/regulations"
      ],
      "source_section": "24-15-1-3",
      "obligation_type": "may"
    },
    {
      "id": "676d18ec-81bb-4028-bca6-fc6afc3ec114",
      "description": "Controller must comply with authenticated consumer requests to exercise rights including confirmation of processing, access, correction, deletion, and data portability",
      "citation": {
        "section": "24-15-3-1(a)(b)",
        "quoted_text": "Except as provided in IC 24-15-7-1(c) and IC 24-15-7-2, and subject to any limitations or conditions set forth in subsections (b) and (c), a controller shall comply with an authenticated consumer request to exercise a right set forth in subsection (b). (b) A consumer has the following rights: (1) To confirm whether or not a controller is processing the consumer's personal data and, subject to the limitations set forth in subdivision (4), to access such personal data. (2) To correct inaccuracies in the consumer's personal data that the consumer previously provided to a controller... (3) To delete personal data provided by or obtained about the consumer. (4) To obtain either: (A) a copy of; or (B) a representative summary of; the consumer's personal data that the consumer previously provided to the controller... (5) To opt out of the processing of the consumer's personal data for purposes of: (A) targeted advertising; (B) the sale of personal data; or (C) profiling in furtherance of decisions that produce legal or similarly significant effects concerning the consumer.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          386,
          387
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Request must be authenticated",
        "Subject to exemptions in IC 24-15-7-1(c) and IC 24-15-7-2"
      ],
      "source_section": "24-15-3-1",
      "obligation_type": "shall"
    },
    {
      "id": "a19cfbbe-c049-4814-929c-72a33c2deb79",
      "description": "Controller must respond to consumer requests without undue delay within 45 days, with one 45-day extension permitted if complexity requires",
      "citation": {
        "section": "24-15-3-1(c)(1)",
        "quoted_text": "A controller shall respond to the consumer without undue delay, but in any case not later than forty-five (45) days after receipt of the consumer's request under this section. The response period prescribed by this subdivision may be extended once by an additional forty-five (45) days when reasonably necessary, taking into account the complexity and number of the consumer's requests, as long as the controller informs the consumer of any such extension within the initial forty-five (45) day response period, along with the reason for the extension.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must respond within 45 days",
        "May extend once for 45 additional days if reasonably necessary",
        "Must inform consumer of extension within initial 45-day period"
      ],
      "source_section": "24-15-3-1",
      "obligation_type": "shall"
    },
    {
      "id": "2ae15e84-9e8b-4987-ba88-68f1b40e64b6",
      "description": "Controller must provide response to consumer requests free of charge up to once per year per consumer, with limited ability to charge fees or decline repetitive requests",
      "citation": {
        "section": "24-15-3-1(c)(3)",
        "quoted_text": "Information provided in response to a consumer request shall be provided by a controller free of charge, up to one (1) time annually per consumer. If requests from a consumer are manifestly unfounded, excessive, or repetitive, the controller may charge the consumer a reasonable fee to cover the administrative costs of complying with the request or decline to act on the request. The controller bears the burden of demonstrating the manifestly unfounded, excessive, or repetitive nature of the request.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must provide free response once per year per consumer",
        "May charge reasonable fee or decline if request is manifestly unfounded, excessive, or repetitive",
        "Controller bears burden of proof for denying request"
      ],
      "source_section": "24-15-3-1",
      "obligation_type": "shall"
    },
    {
      "id": "c545b29e-f83c-4f63-a110-527e09f6acda",
      "description": "Controller must establish an appeals process for consumers to challenge refusal to act on requests, respond within 60 days, and provide mechanism to contact attorney general if appeal denied",
      "citation": {
        "section": "24-15-3-1(d)",
        "quoted_text": "A controller shall establish a process for a consumer to appeal, within a reasonable period of time after the consumer's receipt of a decision by the controller under subsection (c)(2), the controller's refusal to take action on a request by the consumer under this section. The appeal process shall be conspicuously available and similar to the process for submitting requests to invoke a right under this section. Not later than sixty (60) days after receipt of an appeal, a controller shall inform the consumer in writing of any action taken or not taken in response to the appeal, including a written explanation of the reasons for the decisions. If the appeal is denied, the controller shall also provide the consumer with an online mechanism, if available, or other method through which the consumer may contact the attorney general to submit a complaint.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must have conspicuous appeals process",
        "Must respond within 60 days of receiving appeal",
        "Must provide written explanation",
        "Must provide mechanism to contact attorney general if appeal denied"
      ],
      "source_section": "24-15-3-1",
      "obligation_type": "shall"
    },
    {
      "id": "8219048d-d717-4713-a3a6-2aef3e9f10fb",
      "description": "Controller must limit personal data collection to what is adequate, relevant, and reasonably necessary for disclosed purposes, and implement data minimization",
      "citation": {
        "section": "24-15-4-1(1)",
        "quoted_text": "A controller shall limit the collection of personal data to what is adequate, relevant, and reasonably necessary in relation to the purposes for which such data is processed, as disclosed to the consumer.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Except as provided in IC 24-15-7-2"
      ],
      "source_section": "24-15-4-1",
      "obligation_type": "shall"
    },
    {
      "id": "6cd1dd55-6bd5-473f-b941-efe273644c88",
      "description": "Controller must not process personal data for purposes neither reasonably necessary nor compatible with disclosed purposes unless consumer consent obtained",
      "citation": {
        "section": "24-15-4-1(2)",
        "quoted_text": "Except as otherwise provided in this article, a controller shall not process personal data for purposes that are neither reasonably necessary for nor compatible with the disclosed purposes for which the personal data is processed, unless the controller obtains the consumer's consent.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Exception: if purposes are reasonably necessary or compatible with disclosed purposes",
        "Exception: if consumer consent obtained"
      ],
      "source_section": "24-15-4-1",
      "obligation_type": "shall_not"
    },
    {
      "id": "798f864e-7561-4c05-a20b-07b6690448ac",
      "description": "Controller must establish, implement, and maintain reasonable data security practices appropriate to volume and nature of personal data",
      "citation": {
        "section": "24-15-4-1(3)",
        "quoted_text": "A controller shall establish, implement, and maintain reasonable administrative, technical, and physical data security practices to protect the confidentiality, integrity, and accessibility of personal data. The data security practices required under this subdivision must be appropriate to the volume and nature of the personal data at issue.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "technical",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Security practices must be appropriate to volume and nature of data"
      ],
      "source_section": "24-15-4-1",
      "obligation_type": "shall"
    },
    {
      "id": "d79ab2bb-4fe7-4d59-b016-bb0d314bbc11",
      "description": "Controller must not discriminate against consumers for exercising rights by denying goods/services, charging different prices, or providing different quality unless exceptions apply",
      "citation": {
        "section": "24-15-4-1(4)",
        "quoted_text": "A controller shall not process personal data in violation of state and federal laws that prohibit unlawful discrimination against consumers. A controller shall not discriminate against a consumer for exercising any of the consumer rights set forth in this article, including by denying goods or services to the consumer, charging different prices or rates for goods and services, or providing a different level or quality of goods or services to the consumer. However, nothing in this subdivision shall be construed to: (A) require a controller to provide a product or service that requires the personal data of a consumer that the controller does not collect or maintain; or (B) prohibit a controller from offering a different price, rate, level, quality, or selection of goods or services to a consumer, including offering goods or services for no fee, if the consumer has exercised the consumer's right to opt out under IC 24-15-3-1(b)(5) or if the offer is related to a consumer's voluntary participation in a bona fide loyalty, rewards, premium features, discount, or club card program.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "May not discriminate unless: product/service requires personal data controller doesn't collect, or differential pricing relates to opt-out or bona fide loyalty program"
      ],
      "source_section": "24-15-4-1",
      "obligation_type": "shall_not"
    },
    {
      "id": "9ea14a8d-7098-4d32-8daa-dfd9de939c42",
      "description": "Controller must obtain consumer consent before processing sensitive data, or comply with COPPA for known child data",
      "citation": {
        "section": "24-15-4-1(5)",
        "quoted_text": "A controller shall not process sensitive data concerning a consumer without obtaining the consumer's consent, or, in the case of the processing of sensitive data concerning a known child, without processing such data in accordance with the federal Children's Online Privacy Protection Act (15 U.S.C. 6501 et seq.).",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          61,
          61
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Requires consumer consent for sensitive data",
        "OR compliance with COPPA for known child sensitive data"
      ],
      "source_section": "24-15-4-1",
      "obligation_type": "shall_not"
    },
    {
      "id": "3b49748d-a28f-402d-ada0-3194750266f5",
      "description": "Contract provisions waiving or limiting consumer rights are void and unenforceable",
      "citation": {
        "section": "24-15-4-2",
        "quoted_text": "Any provision of a contract or agreement of any kind that purports to waive or limit in any way a consumer's rights under IC 24-15-3 is contrary to public policy and is void and unenforceable.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact_normalized"
      },
      "category": "legal_framework",
      "applies_to": "All entities",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Applies to any contract or agreement"
      ],
      "source_section": "24-15-4-2",
      "obligation_type": "may_not"
    },
    {
      "id": "508d031e-1b9f-4071-87d7-b08e2db162ec",
      "description": "Controller must provide reasonably accessible, clear, and meaningful privacy notice with required elements including data categories, purposes, rights exercise procedures, third parties, and appeal process",
      "citation": {
        "section": "24-15-4-3",
        "quoted_text": "A controller shall provide consumers with a reasonably accessible, clear, and meaningful privacy notice that includes: (1) the categories of personal data processed by the controller; (2) the purpose for processing personal data; (3) how consumers may exercise their consumer rights under IC 24-15-3, including how a consumer may appeal a controller's decision with regard to the consumer's request; (4) the categories of personal data that the controller shares with third parties, if any; and (5) the categories of third parties, if any, with whom the controller shares personal data.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          489,
          490
        ],
        "match_type": "contains"
      },
      "category": "disclosure",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Privacy notice must be reasonably accessible, clear, and meaningful"
      ],
      "source_section": "24-15-4-3",
      "obligation_type": "shall"
    },
    {
      "id": "fc7197f0-35fc-425e-ad90-c1e150ea2594",
      "description": "Controller must clearly and conspicuously disclose sales of personal data or use for targeted advertising and provide opt-out method",
      "citation": {
        "section": "24-15-4-4",
        "quoted_text": "If a controller sells a consumer's personal data to third parties or uses a consumer's personal data for targeted advertising, the controller shall clearly and conspicuously disclose such activity, as well as the manner in which a consumer may exercise the right to opt out of such sales or use.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          56,
          56
        ],
        "match_type": "exact"
      },
      "category": "disclosure",
      "applies_to": "Controllers that sell personal data or use it for targeted advertising",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Applies if controller sells personal data or uses it for targeted advertising"
      ],
      "source_section": "24-15-4-4",
      "obligation_type": "shall"
    },
    {
      "id": "3f32923a-32ed-4d66-9246-1c0cfcefe6b5",
      "description": "Controller must establish and describe one or more secure and reliable means for consumers to submit rights requests, taking into account interaction methods, security needs, and authentication ability, without requiring new account creation",
      "citation": {
        "section": "24-15-4-5",
        "quoted_text": "A controller shall establish, and shall describe in a privacy notice provided under section 3 of this chapter, one (1) or more secure and reliable means for consumers to submit a request to exercise their rights under IC 24-15-3. Such means must take into account: (1) the ways in which consumers normally interact with the controller; (2) the need for the secure and reliable communication of such requests; and (3) the ability of the controller to authenticate the identity of the consumer making the request. A controller may not require a consumer to create a new account in order to exercise the consumer's rights under IC 24-15-3 but may require a consumer to use an existing account.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "technical",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must not require new account creation",
        "May require use of existing account"
      ],
      "source_section": "24-15-4-5",
      "obligation_type": "shall"
    },
    {
      "id": "f6dbc4e6-6196-4485-89d4-a527212bcadf",
      "description": "Processor must adhere to controller instructions and assist controller in meeting obligations including responding to requests, security, breach notification, and data protection assessments",
      "citation": {
        "section": "24-15-5-1",
        "quoted_text": "A processor shall adhere to the instructions of a controller and shall assist the controller in meeting its obligations under this chapter. Such assistance shall include the following: (1) Assisting the controller in meeting the controller's obligation to respond to consumer requests under IC 24-15-3 by appropriate technical and organizational measures, insofar as this is reasonably practicable, and taking into account the nature of processing and the information available to the processor. (2) Taking into account the nature of processing and the information available to the processor, assisting the controller in meeting the controller's obligations in relation to: (A) the security of processing the personal data; and (B) the notification of a breach of security of the system of the processor under IC 24-4.9; in order to meet the controller's obligations. (3) Providing necessary information to enable the controller to conduct and document data protection impact assessments under IC 24-15-6.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact_normalized"
      },
      "category": "operational",
      "applies_to": "Processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must adhere to controller instructions",
        "Assistance must be reasonably practicable"
      ],
      "source_section": "24-15-5-1",
      "obligation_type": "shall"
    },
    {
      "id": "0bff100f-b5ac-44ad-98c9-bc9b0e868d6c",
      "description": "Contract between controller and processor must govern data processing procedures and include specific requirements including confidentiality, data deletion/return, compliance information, assessments, and subcontractor management",
      "citation": {
        "section": "24-15-5-2(a)",
        "quoted_text": "A contract between a controller and a processor shall govern the processor's data processing procedures with respect to processing performed on behalf of the controller. The contract must be binding and clearly set forth instructions for processing personal data, the nature and purpose of processing, the type of data subject to processing, the duration of processing, and the rights and obligations of both parties. The contract must also include requirements that the processor do the following: (1) Ensure that each individual processing personal data is subject to a duty of confidentiality with respect to the data. (2) At the controller's direction, delete or return all personal data to the controller as requested at the end of the provision of services, unless retention of the personal data is required by law. (3) Upon the reasonable request of the controller, make available to the controller all information in its possession necessary to demonstrate the processor's compliance with the obligations in this chapter. (4) Allow, and cooperate with, reasonable assessments by the controller or the controller's designated assessor... (5) Subject to subsection (b), engage any subcontractor pursuant to a written contract that requires the subcontractor to meet the obligations of the processor with respect to the personal data.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          546,
          547
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Contract must be binding",
        "Must clearly set forth processing parameters"
      ],
      "source_section": "24-15-5-2",
      "obligation_type": "shall"
    },
    {
      "id": "db938f20-51e7-42ad-8882-8f340dc59fd6",
      "description": "Controller must conduct and document data protection impact assessments for targeted advertising, sale of data, profiling with risk of harm, sensitive data processing, and activities presenting heightened risk to consumers",
      "citation": {
        "section": "24-15-6-1(b)",
        "quoted_text": "A controller shall conduct and document a data protection impact assessment of each of the following processing activities involving personal data: (1) The processing of personal data for purposes of targeted advertising. (2) The sale of personal data. (3) The processing of personal data for purposes of profiling, if such profiling presents a reasonably foreseeable risk of: (A) unfair or deceptive treatment of, or unlawful disparate impact on, consumers; (B) financial, physical, or reputational injury to consumers; (C) a physical or other intrusion upon the solitude or seclusion, or the private affairs or concerns, of consumers, if such intrusion would be offensive to a reasonable person; or (D) other substantial injury to consumers. (4) The processing of sensitive data. (5) Any processing activities involving personal data that present a heightened risk of harm to consumers.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Requirements apply to processing activities created or generated after December 31, 2025"
      ],
      "source_section": "24-15-6-1",
      "obligation_type": "shall"
    },
    {
      "id": "7329ec03-3480-47c0-b15e-0452bd107180",
      "description": "Controller possessing de-identified data must take reasonable measures to prevent association with individuals, publicly commit to not re-identifying, and contractually obligate recipients to comply",
      "citation": {
        "section": "24-15-7-1(a)",
        "quoted_text": "A controller in possession of de-identified data shall: (1) take reasonable measures to ensure that the data cannot be associated with an individual; (2) publicly commit to maintaining and using de-identified data without attempting to re-identify the data; and (3) contractually obligate any recipients of the de-identified data to comply with all provisions of this chapter.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers possessing de-identified data",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must meet all three requirements"
      ],
      "source_section": "24-15-7-1",
      "obligation_type": "shall"
    },
    {
      "id": "fd9908a2-326e-4826-8c53-271bba31adad",
      "description": "Exemption from certain consumer rights and controller responsibilities for pseudonymous data when controller demonstrates information necessary to identify consumer is kept separately with effective technical and organizational controls",
      "citation": {
        "section": "24-15-7-2",
        "quoted_text": "The: (1) rights of a consumer set forth in IC 24-15-3-1(b)(1) through IC 24-15-3-1(b)(4); and (2) responsibilities of a controller under IC 24-15-4-1(1) through IC 24-15-4-1(5); do not apply to pseudonymous data in any case in which the controller is able to demonstrate that any information necessary to identify the consumer is kept separately and is subject to effective technical and organizational controls that prevent the controller from accessing such information.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers processing pseudonymous data",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Controller must demonstrate separate storage with effective technical and organizational controls"
      ],
      "source_section": "24-15-7-2",
      "obligation_type": "may_not"
    },
    {
      "id": "efd829f8-8d17-43be-83d9-2d4ca9b9244f",
      "description": "Permissible activities exemption for compliance with laws, court orders, law enforcement cooperation, legal claims, contracts, safety protection, security incidents, research, and assisting others with these activities",
      "citation": {
        "section": "24-15-8-1(a)",
        "quoted_text": "This article shall not be construed to restrict a controller's or processor's ability to do any of the following: (1) Comply with federal, state, or local laws, rules, or regulations or, in the case of an owner of a riverboat licensed under IC 4-33-6, implement and operate a facial recognition program approved by the Indiana gaming commission. (2) Comply with a civil, criminal, or regulatory inquiry, investigation, subpoena, or summons by a federal, state, local, or other governmental authority. (3) Cooperate with law enforcement agencies concerning conduct or activity that the controller or processor reasonably and in good faith believes may violate federal, state, or local laws, rules, or regulations. (4) Investigate, establish, exercise, prepare for, or defend legal claims. (5) Provide a product or service specifically requested by a consumer, perform a contract to which the consumer, or a parent of a child, is a party... (6) Take immediate steps to protect an interest that is essential for the life or physical safety of the consumer or of another individual... (7) Prevent, detect, protect against, or respond to security incidents, identity theft, fraud, harassment, malicious or deceptive activities, or any illegal activity... (8) Engage in public or peer reviewed scientific or statistical research... (9) Assist another controller, processor, or third party with any obligation described in this section.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          676,
          677
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Processing must fall under one of the enumerated permissible activities"
      ],
      "source_section": "24-15-8-1",
      "obligation_type": "may"
    },
    {
      "id": "73bf9c9c-4bf6-4fb6-8a9c-b36e58a3cad4",
      "description": "Permissible data collection, use, or retention for internal research, product recalls, technical error repair, and internal operations compatible with consumer expectations",
      "citation": {
        "section": "24-15-8-2",
        "quoted_text": "The obligations imposed on a controller or a processor under this article do not prohibit or restrict a controller or processor from collecting, using, or retaining data to do the following: (1) Conduct internal research to develop, improve, or repair products, services, or technology. (2) Effectuate a product recall. (3) Identify and repair technical errors that impair existing or intended functionality. (4) Perform internal operations that are: (A) reasonably compatible with the expectations of the consumer; (B) reasonably anticipated based on the consumer's existing relationship with the controller; or (C) otherwise compatible with: (i) processing data in furtherance of the provision of a product or service specifically requested by a consumer, or the parent of a child; or (ii) the performance of a contract to which the consumer is a party.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          710,
          711
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Activity must fall under one of the enumerated permissible purposes"
      ],
      "source_section": "24-15-8-2",
      "obligation_type": "may"
    },
    {
      "id": "c5cee83d-212c-46c1-8f43-288e12682c23",
      "description": "Attorney general has exclusive enforcement authority over the law",
      "citation": {
        "section": "24-15-10-1",
        "quoted_text": "The attorney general has exclusive authority to enforce the provisions of this article.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Attorney general",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "No other entity may enforce"
      ],
      "source_section": "24-15-10-1",
      "obligation_type": "shall"
    },
    {
      "id": "32229fe2-f06e-434f-9d88-933823fbdecf",
      "description": "Attorney general may seek injunction and civil penalty up to $7,500 per violation, and recover reasonable investigation and litigation expenses including attorney's fees",
      "citation": {
        "section": "24-15-10-2",
        "quoted_text": "The attorney general may initiate an action in the name of the state and may seek an injunction to restrain any violations of this article and a civil penalty not to exceed seven thousand five hundred dollars ($7,500) for each violation under this article. (b) The attorney general may recover reasonable expenses incurred in investigating and preparing the case, including attorney's fees, in any action initiated under this chapter.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Violators of the law",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Attorney general must initiate action"
      ],
      "source_section": "24-15-10-2",
      "obligation_type": "may"
    },
    {
      "id": "728a798a-0b5b-456f-b237-17888a973332",
      "description": "Attorney general must provide 30-day written notice and cure opportunity before initiating enforcement action, with no action if violation cured and written statement provided",
      "citation": {
        "section": "24-15-10-3(a)",
        "quoted_text": "Before initiating an action under section 2 of this chapter, the attorney general shall provide a controller or processor thirty (30) days written notice identifying the specific provisions of this article that the attorney general alleges have been or are being violated. If within the thirty (30) day period set forth in this section, the controller or processor: (1) cures the alleged violation; and (2) provides the attorney general an express written statement that: (A) the alleged violation has been cured; and (B) actions have been taken to ensure no further such violations will occur; the attorney general shall not initiate an action against the controller or processor.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors subject to enforcement",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "30-day notice required before action",
        "Cure opportunity must be provided",
        "Action precluded if cured with written statement"
      ],
      "source_section": "24-15-10-3",
      "obligation_type": "shall"
    },
    {
      "id": "1416f2b0-d87e-4f61-8385-ac9df3e65bdf",
      "description": "No private right of action for violations of the law",
      "citation": {
        "section": "24-15-10-4",
        "quoted_text": "Nothing in this article shall be construed as providing the basis for a private right of action for violations of this article or any other law.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "All persons",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Applies to all violations"
      ],
      "source_section": "24-15-10-4",
      "obligation_type": "may_not"
    },
    {
      "id": "6292d0a4-71e7-4b6d-837f-b2683b51d8bc",
      "description": "Law preempts and supersedes all local laws regarding processing of personal data by controllers or processors",
      "citation": {
        "section": "24-15-11-1",
        "quoted_text": "This article supersedes and preempts all rules, regulations, codes, ordinances, and other laws adopted by a city, county, city and county, municipality, or local agency regarding the processing of personal data by controllers or processors.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Local governments in Indiana",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Preemption applies to all local laws on personal data processing"
      ],
      "source_section": "24-15-11-1",
      "obligation_type": "shall"
    },
    {
      "id": "0d838ac4-b32d-44c2-9be6-77f397f4cc20",
      "description": "References to federal, state, or local laws in the statute include any accompanying rules, regulations, or exemptions",
      "citation": {
        "section": "24-15-11-2",
        "quoted_text": "Any reference to federal, state, or local law or statute in this article includes any accompanying rules, regulations, or exemptions.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "All entities subject to the law",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Applies to all references to laws throughout the article"
      ],
      "source_section": "24-15-11-2",
      "obligation_type": "shall"
    },
    {
      "id": "19d42667-43c9-42fa-9f6f-a547d80198d9",
      "description": "Attorney general may maintain website resources including sample privacy notices and disclosures to assist controllers in complying with transparency obligations",
      "citation": {
        "section": "24-15-4-6",
        "quoted_text": "The attorney general may maintain on the attorney general's website a list of resources for controllers, including sample privacy notices and disclosures, to assist controllers in complying with this chapter.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Attorney general",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "This is a permissive authority, not a mandatory requirement"
      ],
      "source_section": "24-15-4-6",
      "obligation_type": "may"
    },
    {
      "id": "afde27d5-edbe-4436-9f6f-e817c01479f6",
      "description": "Determination of whether a person acts as controller or processor is fact-based and context-dependent; processor adhering to controller instructions remains a processor",
      "citation": {
        "section": "24-15-5-3",
        "quoted_text": "Determining whether a person is acting as a controller or a processor with respect to a specific processing of data is a fact based determination that depends upon the context in which personal data is processed. A processor that continues to adhere to a controller's instructions with respect to a specific processing of personal data remains a processor.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Determination depends on context of specific processing"
      ],
      "source_section": "24-15-5-3",
      "obligation_type": "shall"
    },
    {
      "id": "92d52b2a-50a4-4615-a92c-dfb9b7956f81",
      "description": "Attorney general may request data protection impact assessments via civil investigative demand and evaluate for compliance; assessments are confidential and disclosure does not waive attorney-client privilege or work product protection",
      "citation": {
        "section": "24-15-6-2",
        "quoted_text": "The attorney general may request, pursuant to a civil investigative demand, that a controller disclose any data protection impact assessment that is relevant to an investigation conducted by the attorney general. Upon receipt of such a request, the controller shall make the data protection impact assessment available to the attorney general. Subject to subsection (b), the attorney general may evaluate the data protection impact assessment for a controller's compliance with the responsibilities set forth in IC 24-15-4. (b) Data protection impact assessments are confidential and exempt from public inspection and copying under IC 5-14-3-4. The disclosure of a data protection impact assessment pursuant to a request from the attorney general does not constitute a waiver of attorney-client privilege or work product protection with respect to the assessment and any information contained in the assessment.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and attorney general",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Assessment must be relevant to attorney general investigation",
        "Disclosure does not waive privilege"
      ],
      "source_section": "24-15-6-2",
      "obligation_type": "shall"
    },
    {
      "id": "50ece90d-13fb-49f6-b96c-bde28efc9fdb",
      "description": "Controller must exercise reasonable oversight to monitor compliance with contractual commitments for disclosed pseudonymous or de-identified data and take appropriate steps to address breaches",
      "citation": {
        "section": "24-15-7-3",
        "quoted_text": "A controller that discloses pseudonymous data or de-identified data shall exercise reasonable oversight to monitor compliance with any contractual commitments to which the pseudonymous data or de-identified data is subject and shall take appropriate steps to address any breaches of those contractual commitments.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers that disclose pseudonymous or de-identified data",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Applies when data is subject to contractual commitments"
      ],
      "source_section": "24-15-7-3",
      "obligation_type": "shall"
    },
    {
      "id": "2be08918-50be-4feb-9a6f-ce5108c7ede4",
      "description": "Obligations under the law do not apply if compliance would violate evidentiary privilege under Indiana law; law does not prohibit providing personal data as part of privileged communication",
      "citation": {
        "section": "24-15-8-3",
        "quoted_text": "The obligations imposed on a controller or a processor under this article do not apply if compliance by the controller or processor with this article would violate an evidentiary privilege under Indiana law. This article shall not be construed to prohibit a controller or processor from providing, as part of a privileged communication, personal data concerning a consumer to a person covered by an evidentiary privilege under Indiana law.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Compliance would violate evidentiary privilege under Indiana law"
      ],
      "source_section": "24-15-8-3",
      "obligation_type": "may_not"
    },
    {
      "id": "86f05490-e5d9-4d32-ba4e-bcbb99781092",
      "description": "Controller or processor disclosing personal data to third party in compliance with law is not liable for third party's violations unless discloser had actual knowledge of recipient's intent to violate",
      "citation": {
        "section": "24-15-8-4",
        "quoted_text": "A controller or processor that discloses personal data to a third party controller or processor in compliance with this article is not in violation of this article if the third party controller or processor that receives and processes the personal data violates this article, as long as, at the time of disclosing the personal data, the disclosing controller or processor did not have actual knowledge that the recipient intended to commit a violation. A third party controller or processor receiving personal data from a controller or processor is likewise not in violation of this article solely because of the transgressions of the controller or processor from which it receives such personal data.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors that disclose or receive personal data",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Disclosing party did not have actual knowledge of recipient's intent to violate",
        "Receiving party not liable solely due to sender's violations"
      ],
      "source_section": "24-15-8-4",
      "obligation_type": "may_not"
    },
    {
      "id": "33ed2044-64cb-487c-83c5-ef11d3891b91",
      "description": "Law shall not adversely affect rights or freedoms including free speech under First Amendment; does not apply to personal data in purely personal or household activity context",
      "citation": {
        "section": "24-15-8-5",
        "quoted_text": "This article: (1) shall not be construed as an obligation imposed on controllers and processors that adversely affects the rights or freedoms of any persons, such as exercising the right of free speech under the First Amendment to the Constitution of the United States; and (2) does not apply to personal data in the context of a purely personal or household activity.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Protects First Amendment rights",
        "Exempts purely personal or household activities"
      ],
      "source_section": "24-15-8-5",
      "obligation_type": "may_not"
    },
    {
      "id": "227176d0-5c0b-4206-9ed8-d3fca1385755",
      "description": "Law does not require controllers to disclose trade secrets",
      "citation": {
        "section": "24-15-8-6",
        "quoted_text": "Nothing in this article shall be construed as requiring a controller to disclose trade secrets.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Information must qualify as trade secret under IC 24-2-3-2"
      ],
      "source_section": "24-15-8-6",
      "obligation_type": "may_not"
    },
    {
      "id": "a92c84b0-fa62-46ef-9b35-7461b52870a2",
      "description": "Personal data processed for authorized purposes may not be processed for other purposes unless allowed; processing must be reasonably necessary, proportionate, adequate, relevant, and limited; data collected under permissible purposes exemption must have reasonable security measures and controller bears burden of proving exemption applicability",
      "citation": {
        "section": "24-15-8-7",
        "quoted_text": "Personal data processed by a controller for a purpose authorized under this chapter may not be processed for any other purpose unless otherwise allowed under this article. Personal data processed by a controller under this chapter may be processed to the extent that such processing is: (1) reasonably necessary and proportionate to a purpose authorized under this chapter; and (2) adequate, relevant, and limited to what is necessary in relation to the specific purpose. (b) Personal data collected, used, or retained under section 2 of this chapter: (1) shall, as applicable, take into account the nature and purpose of the collection, use, or retention; and (2) must be subject to reasonable administrative, technical, and physical measures to: (A) protect the confidentiality, integrity, and accessibility of the personal data; and (B) reduce reasonably foreseeable risks of harm to consumers relating to such collection, use, or retention of the personal data. (c) If a controller processes personal data pursuant to an exemption under this chapter, the controller bears the burden of demonstrating that such processing: (1) qualifies for the exemption; and (2) complies with the requirements set forth in this section.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers processing personal data under authorized purposes or exemptions",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Processing must be reasonably necessary and proportionate",
        "Must be adequate, relevant, and limited",
        "Controller bears burden of proving exemption"
      ],
      "source_section": "24-15-8-7",
      "obligation_type": "shall"
    },
    {
      "id": "4539b4a2-7abb-49a7-8175-6d48a1b8332f",
      "description": "Attorney general is empowered to issue civil investigative demand when reasonable cause exists to believe person has engaged in, is engaging in, or is about to engage in violation of the law",
      "citation": {
        "section": "24-15-9-1",
        "quoted_text": "Whenever the attorney general has reasonable cause to believe that any person has engaged in, is engaging in, or is about to engage in any violation of this article, the attorney general is empowered to issue a civil investigative demand to investigate the suspected violation.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          72,
          72
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Attorney general",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Attorney general must have reasonable cause to believe violation has occurred, is occurring, or is about to occur"
      ],
      "source_section": "24-15-9-1",
      "obligation_type": "may"
    }
  ],
  "unverified_items": [],
  "metadata": {
    "source_file": "State Privacy Laws\\Indiana Privacy Law.pdf",
    "total_requirements": 40,
    "verified_count": 40,
    "output_format": "json",
    "sections_processed": [
      "24-15-1-1",
      "24-15-1-2",
      "24-15-1-3",
      "24-15-3-1",
      "24-15-4-1",
      "24-15-4-2",
      "24-15-4-3",
      "24-15-4-4",
      "24-15-4-5",
      "24-15-5-1",
      "24-15-5-2",
      "24-15-6-1",
      "24-15-7-1",
      "24-15-7-2",
      "24-15-8-1",
      "24-15-8-2",
      "24-15-10-1",
      "24-15-10-2",
      "24-15-10-3",
      "24-15-10-4",
      "24-15-11-1",
      "24-15-11-2",
      "24-15-4-6",
      "24-15-5-3",
      "24-15-6-2",
      "24-15-7-3",
      "24-15-8-3",
      "24-15-8-4",
      "24-15-8-5",
      "24-15-8-6",
      "24-15-8-7",
      "24-15-9-1"
    ],
    "requirements_per_section": {
      "24-15-1-1": 2,
      "24-15-1-2": 1,
      "24-15-1-3": 1,
      "24-15-3-1": 4,
      "24-15-4-1": 5,
      "24-15-4-2": 1,
      "24-15-4-3": 1,
      "24-15-4-4": 1,
      "24-15-4-5": 1,
      "24-15-5-1": 1,
      "24-15-5-2": 1,
      "24-15-6-1": 1,
      "24-15-7-1": 1,
      "24-15-7-2": 1,
      "24-15-8-1": 1,
      "24-15-8-2": 1,
      "24-15-10-1": 1,
      "24-15-10-2": 1,
      "24-15-10-3": 1,
      "24-15-10-4": 1,
      "24-15-11-1": 1,
      "24-15-11-2": 1,
      "24-15-4-6": 1,
      "24-15-5-3": 1,
      "24-15-6-2": 1,
      "24-15-7-3": 1,
      "24-15-8-3": 1,
      "24-15-8-4": 1,
      "24-15-8-5": 1,
      "24-15-8-6": 1,
      "24-15-8-7": 1,
      "24-15-9-1": 1
    },
    "total_extracted": 40,
    "defined_terms": [
      "Affiliate",
      "Aggregate data",
      "Authenticate",
      "Biometric data",
      "Business associate",
      "Child",
      "Consent",
      "Consumer",
      "Controller",
      "Covered entity",
      "Decision that produces legal or similarly significant effects concerning a consumer",
      "De-identified data",
      "Health care provider",
      "Health record",
      "HIPAA",
      "Identified or identifiable individual",
      "Institution of higher education",
      "Nonprofit organization",
      "Personal data",
      "Precise geolocation data",
      "Processing",
      "Processor",
      "Profiling",
      "Protected health information",
      "Pseudonymous data",
      "Publicly available information",
      "Sale of personal data",
      "Sensitive data",
      "State agency",
      "Targeted advertising",
      "Third party",
      "Trade secret"
    ],
    "section_types": {
      "24-15-1-1": "applicability",
      "24-15-1-2": "exemptions",
      "24-15-1-3": "exemptions",
      "24-15-2-0.5": "definitions",
      "24-15-2-1": "definitions",
      "24-15-2-2": "definitions",
      "24-15-2-3": "definitions",
      "24-15-2-4": "definitions",
      "24-15-2-5": "definitions",
      "24-15-2-6": "definitions",
      "24-15-2-7": "definitions",
      "24-15-2-8": "definitions",
      "24-15-2-9": "definitions",
      "24-15-2-10": "definitions",
      "24-15-2-11": "definitions",
      "24-15-2-12": "definitions",
      "24-15-2-13": "definitions",
      "24-15-2-14": "definitions",
      "24-15-2-15": "definitions",
      "24-15-2-16": "definitions",
      "24-15-2-17": "definitions",
      "24-15-2-18": "definitions",
      "24-15-2-19": "definitions",
      "24-15-2-20": "definitions",
      "24-15-2-21": "definitions",
      "24-15-2-22": "definitions",
      "24-15-2-23": "definitions",
      "24-15-2-24": "definitions",
      "24-15-2-25": "definitions",
      "24-15-2-26": "definitions",
      "24-15-2-27": "definitions",
      "24-15-2-28": "definitions",
      "24-15-2-29": "definitions",
      "24-15-2-30": "definitions",
      "24-15-2-31": "definitions",
      "24-15-2-32": "definitions",
      "24-15-3-1": "consumer_rights",
      "24-15-4-1": "controller_duties",
      "24-15-4-2": "consumer_rights",
      "24-15-4-3": "controller_duties",
      "24-15-4-4": "controller_duties",
      "24-15-4-5": "controller_duties",
      "24-15-4-6": "general",
      "24-15-5-1": "processor_duties",
      "24-15-5-2": "processor_duties",
      "24-15-5-3": "general",
      "24-15-6-1": "controller_duties",
      "24-15-6-2": "enforcement",
      "24-15-7-1": "controller_duties",
      "24-15-7-2": "exemptions",
      "24-15-7-3": "controller_duties",
      "24-15-8-1": "exemptions",
      "24-15-8-2": "exemptions",
      "24-15-8-3": "exemptions",
      "24-15-8-4": "exemptions",
      "24-15-8-5": "exemptions",
      "24-15-8-6": "exemptions",
      "24-15-8-7": "general",
      "24-15-9-1": "enforcement",
      "24-15-10-1": "enforcement",
      "24-15-10-2": "enforcement",
      "24-15-10-3": "enforcement",
      "24-15-10-4": "enforcement",
      "24-15-11-1": "general",
      "24-15-11-2": "general"
    }
  },
  "structure": {
    "name": "Indiana Consumer Data Protection Act",
    "citation": "IC 24-15",
    "effective_date": "2026-01-01",
    "sections": [
      {
        "id": "24-15-1-1",
        "title": "Applicability to persons; exceptions",
        "section_type": "applicability",
        "content": "This article applies to a person that conducts business in Indiana or produces products or services that are targeted to residents of Indiana and that during a calendar year: (1) controls or processes",
        "start_line": 18,
        "end_line": 73,
        "subsections": []
      },
      {
        "id": "24-15-1-2",
        "title": "Exempt information and data",
        "section_type": "exemptions",
        "content": "The following information and data are exempt from this article: (1) Protected health information under HIPAA and related regulations under 45 CFR Part 160, 45 CFR Part 162, and 45 CFR Part 1",
        "start_line": 74,
        "end_line": 121,
        "subsections": []
      },
      {
        "id": "24-15-1-3",
        "title": "Compliance with Children's Online Privacy Protection Act; satisfaction of obligation to obtain parental consent",
        "section_type": "exemptions",
        "content": "A: (1) controller; or (2) processor; that complies with the Children's Online Privacy Protection Act (15 U.S.C. 6501 et seq.), and with any rules or regulations under that act, satisfi",
        "start_line": 122,
        "end_line": 132,
        "subsections": []
      },
      {
        "id": "24-15-2-0.5",
        "title": "Applicability of definitions",
        "section_type": "definitions",
        "content": "The definitions in this chapter apply throughout this article.",
        "start_line": 175,
        "end_line": 177,
        "subsections": []
      },
      {
        "id": "24-15-2-1",
        "title": "Affiliate",
        "section_type": "definitions",
        "content": "\"Affiliate\" means a legal entity that: (1) controls, is controlled by, or is under common control with another legal entity; or",
        "start_line": 178,
        "end_line": 190,
        "subsections": []
      },
      {
        "id": "24-15-2-2",
        "title": "Aggregate data",
        "section_type": "definitions",
        "content": "\"Aggregate data\" means information: (1) that relates to a group or category of consumers; (2) from which individual consumer identities have been removed; and (3) that is not linked or rea",
        "start_line": 191,
        "end_line": 198,
        "subsections": []
      },
      {
        "id": "24-15-2-3",
        "title": "Authenticate",
        "section_type": "definitions",
        "content": "\"Authenticate\" means to verify through reasonable means that a consumer who is entitled to exercise the personal data rights provided by IC 24-15-3 is the same consumer exercising such rig",
        "start_line": 199,
        "end_line": 203,
        "subsections": []
      },
      {
        "id": "24-15-2-4",
        "title": "Biometric data",
        "section_type": "definitions",
        "content": "\"Biometric data\" means data that: (1) is generated by automatic measurements of an individual's biological characteristics, such as a fingerprint, a voiceprint, images of the retina or ir",
        "start_line": 204,
        "end_line": 215,
        "subsections": []
      },
      {
        "id": "24-15-2-5",
        "title": "Business associate",
        "section_type": "definitions",
        "content": "\"Business associate\" has the meaning set forth in 45 CFR 160.103.",
        "start_line": 216,
        "end_line": 219,
        "subsections": []
      },
      {
        "id": "24-15-2-6",
        "title": "Child",
        "section_type": "definitions",
        "content": "\"Child\" means any individual who is less than thirteen (13) years of age.",
        "start_line": 220,
        "end_line": 223,
        "subsections": []
      },
      {
        "id": "24-15-2-7",
        "title": "Consent",
        "section_type": "definitions",
        "content": "\"Consent\" means a clear affirmative act that signifies a consumer's freely given, specific, informed, and unambiguous agreement to process personal data relating to the consumer. (b) For ",
        "start_line": 224,
        "end_line": 231,
        "subsections": []
      },
      {
        "id": "24-15-2-8",
        "title": "Consumer",
        "section_type": "definitions",
        "content": "\"Consumer\" means an individual who: (1) is a resident of Indiana; and (2) is acting only for a personal, family, or household purpose. (b) The term does not include an individual acting i",
        "start_line": 232,
        "end_line": 238,
        "subsections": []
      },
      {
        "id": "24-15-2-9",
        "title": "Controller",
        "section_type": "definitions",
        "content": "\"Controller\" means a person that, alone or jointly with others, determines the purpose and means of processing personal data.",
        "start_line": 239,
        "end_line": 242,
        "subsections": []
      },
      {
        "id": "24-15-2-10",
        "title": "Covered entity",
        "section_type": "definitions",
        "content": "\"Covered entity\" has the meaning set forth in 45 CFR 160.103.",
        "start_line": 243,
        "end_line": 246,
        "subsections": []
      },
      {
        "id": "24-15-2-11",
        "title": "Decision that produces legal or similarly significant effects concerning a consumer",
        "section_type": "definitions",
        "content": "\"Decision that produces legal or similarly significant effects concerning a consumer\" means a decision made by a controller that results in the provision or denial by the controller of: (1",
        "start_line": 247,
        "end_line": 259,
        "subsections": []
      },
      {
        "id": "24-15-2-12",
        "title": "De-identified data",
        "section_type": "definitions",
        "content": "\"De-identified data\" means data that cannot reasonably be linked to an identified or identifiable individual because a controller that possesses the data: (1) takes reasonable measures to",
        "start_line": 260,
        "end_line": 267,
        "subsections": []
      },
      {
        "id": "24-15-2-13",
        "title": "Health care provider",
        "section_type": "definitions",
        "content": "\"Health care provider\" has the meaning set forth in IC 4-6-14-2.",
        "start_line": 268,
        "end_line": 271,
        "subsections": []
      },
      {
        "id": "24-15-2-14",
        "title": "Health record",
        "section_type": "definitions",
        "content": "\"Health record\" has the meaning set forth in IC 1-1-4-5(a)(6).",
        "start_line": 272,
        "end_line": 275,
        "subsections": []
      },
      {
        "id": "24-15-2-15",
        "title": "HIPAA",
        "section_type": "definitions",
        "content": "\"HIPAA\" refers to the federal Health Insurance Portability and Accountability Act of 1996 (42 U.S.C. 1320d et seq.).",
        "start_line": 276,
        "end_line": 279,
        "subsections": []
      },
      {
        "id": "24-15-2-16",
        "title": "Identified or identifiable individual",
        "section_type": "definitions",
        "content": "\"Identified or identifiable individual\" means an individual who can be readily identified, directly or indirectly.",
        "start_line": 280,
        "end_line": 283,
        "subsections": []
      },
      {
        "id": "24-15-2-17",
        "title": "Institution of higher education",
        "section_type": "definitions",
        "content": "\"Institution of higher education\" means a public or private college or university.",
        "start_line": 284,
        "end_line": 287,
        "subsections": []
      },
      {
        "id": "24-15-2-18",
        "title": "Nonprofit organization",
        "section_type": "definitions",
        "content": "\"Nonprofit organization\" means any organization exempt from taxation under Section 501(c)(3), 501(c)(6), or 501(c)(12) of the Internal Revenue Code.",
        "start_line": 288,
        "end_line": 292,
        "subsections": []
      },
      {
        "id": "24-15-2-19",
        "title": "Personal data",
        "section_type": "definitions",
        "content": "\"Personal data\" means information that is linked or reasonably linkable to an identified or identifiable individual. (b) The term does not include: (1) de-identified data; (2) aggregate d",
        "start_line": 293,
        "end_line": 300,
        "subsections": []
      },
      {
        "id": "24-15-2-20",
        "title": "Precise geolocation data",
        "section_type": "definitions",
        "content": "\"Precise geolocation data\" means information derived from technology, including global positioning system level latitude and longitude coordinates, that directly identifies the specific l",
        "start_line": 301,
        "end_line": 309,
        "subsections": []
      },
      {
        "id": "24-15-2-21",
        "title": "Processing",
        "section_type": "definitions",
        "content": "\"Processing\", with respect to personal data, means any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such a",
        "start_line": 310,
        "end_line": 316,
        "subsections": []
      },
      {
        "id": "24-15-2-22",
        "title": "Processor",
        "section_type": "definitions",
        "content": "\"Processor\" means a person that processes personal data on behalf of a controller.",
        "start_line": 317,
        "end_line": 320,
        "subsections": []
      },
      {
        "id": "24-15-2-23",
        "title": "Profiling",
        "section_type": "definitions",
        "content": "\"Profiling\" means any form of solely automated processing performed on personal data to evaluate, analyze, or predict personal aspects related to an identified or identifiable individual'",
        "start_line": 321,
        "end_line": 326,
        "subsections": []
      },
      {
        "id": "24-15-2-24",
        "title": "Protected health information",
        "section_type": "definitions",
        "content": "\"Protected health information\" has the meaning set forth in 45 CFR 160.103.",
        "start_line": 327,
        "end_line": 330,
        "subsections": []
      },
      {
        "id": "24-15-2-25",
        "title": "Pseudonymous data",
        "section_type": "definitions",
        "content": "\"Pseudonymous data\" means personal data that cannot be attributed to a specific individual because additional information that would allow the data to be attributed to a specific individua",
        "start_line": 331,
        "end_line": 338,
        "subsections": []
      },
      {
        "id": "24-15-2-26",
        "title": "Publicly available information",
        "section_type": "definitions",
        "content": "\"Publicly available information\" means information: (1) that is lawfully made available through federal, state, or local government records; or (2) that a business has a reasonable basis t",
        "start_line": 339,
        "end_line": 349,
        "subsections": []
      },
      {
        "id": "24-15-2-27",
        "title": "Sale of personal data",
        "section_type": "definitions",
        "content": "\"Sale of personal data\" means the exchange of personal data for monetary consideration by a controller to a third party. (b) The term does not include: (1) the disclosure of personal data",
        "start_line": 350,
        "end_line": 370,
        "subsections": []
      },
      {
        "id": "24-15-2-28",
        "title": "Sensitive data",
        "section_type": "definitions",
        "content": "\"Sensitive data\" means a category of personal data that includes any of the following: (1) Personal data revealing racial or ethnic origin, religious beliefs, a mental or physical health ",
        "start_line": 371,
        "end_line": 380,
        "subsections": []
      },
      {
        "id": "24-15-2-29",
        "title": "State agency",
        "section_type": "definitions",
        "content": "\"State agency\" has the meaning set forth in IC 1-1-15-3.",
        "start_line": 381,
        "end_line": 384,
        "subsections": []
      },
      {
        "id": "24-15-2-30",
        "title": "Targeted advertising",
        "section_type": "definitions",
        "content": "\"Targeted advertising\" means the displaying of an advertisement to a consumer in which the advertisement is selected based on personal data obtained from that consumer's activities over ti",
        "start_line": 385,
        "end_line": 396,
        "subsections": []
      },
      {
        "id": "24-15-2-31",
        "title": "Third party",
        "section_type": "definitions",
        "content": "\"Third party\", with respect to a context to which this article applies, means a natural or legal person, public authority, agency, or body other than: (1) the consumer; (2) the controller",
        "start_line": 397,
        "end_line": 406,
        "subsections": []
      },
      {
        "id": "24-15-2-32",
        "title": "Trade secret",
        "section_type": "definitions",
        "content": "\"Trade secret\" has the meaning set forth in IC 24-2-3-2.",
        "start_line": 407,
        "end_line": 410,
        "subsections": []
      },
      {
        "id": "24-15-3-1",
        "title": "Personal data; consumer rights; consumer's request to controller; compliance by controller; consumer's right to appeal",
        "section_type": "consumer_rights",
        "content": "A consumer may invoke one (1) or more rights set forth in subsection (b) by submitting to a controller a request specifying the rights the consumer wishes to invoke. A known child's paren",
        "start_line": 417,
        "end_line": 478,
        "subsections": []
      },
      {
        "id": "24-15-4-1",
        "title": "Responsibilities of controller; discrimination against consumer for exercising consumer rights prohibited; processing of sensitive data",
        "section_type": "controller_duties",
        "content": "Except as provided in IC 24-15-7-2, a controller has the following responsibilities: (1) A controller shall limit the collection of personal data to what is adequate, relevant, and reason",
        "start_line": 495,
        "end_line": 528,
        "subsections": []
      },
      {
        "id": "24-15-4-2",
        "title": "Contract provisions purporting to waive or limit consumer rights",
        "section_type": "consumer_rights",
        "content": "Any provision of a contract or agreement of any kind that purports to waive or limit in any way a consumer's rights under IC 24-15-3 is contrary to public policy and is void and unenforce",
        "start_line": 529,
        "end_line": 533,
        "subsections": []
      },
      {
        "id": "24-15-4-3",
        "title": "Privacy notice to consumers; required elements",
        "section_type": "controller_duties",
        "content": "A controller shall provide consumers with a reasonably accessible, clear, and meaningful privacy notice that includes: (1) the categories of personal data processed by the controller; (2) ",
        "start_line": 534,
        "end_line": 543,
        "subsections": []
      },
      {
        "id": "24-15-4-4",
        "title": "Sale of personal data to third parties; use of personal data for targeted advertising; disclosure; consumer's right to opt out",
        "section_type": "controller_duties",
        "content": "If a controller sells a consumer's personal data to third parties or uses a consumer's personal data for targeted advertising, the controller shall clearly and conspicuously disclose such",
        "start_line": 544,
        "end_line": 550,
        "subsections": []
      },
      {
        "id": "24-15-4-5",
        "title": "Exercise of rights by consumers; controller's duty to provide secure and reliable means for submitting requests",
        "section_type": "controller_duties",
        "content": "A controller shall establish, and shall describe in a privacy notice provided under section 3 of this chapter, one (1) or more secure and reliable means for consumers to submit a request ",
        "start_line": 551,
        "end_line": 562,
        "subsections": []
      },
      {
        "id": "24-15-4-6",
        "title": "Compliance by controllers; authority of attorney general to provide online resources for controllers",
        "section_type": "general",
        "content": "The attorney general may maintain on the attorney general's website a list of resources for controllers, including sample privacy notices and disclosures, to assist controllers in complyi",
        "start_line": 563,
        "end_line": 568,
        "subsections": []
      },
      {
        "id": "24-15-5-1",
        "title": "Duty of processor to assist controller in meeting obligations regarding personal data",
        "section_type": "processor_duties",
        "content": "A processor shall adhere to the instructions of a controller and shall assist the controller in meeting its obligations under this chapter. Such assistance shall include the following: (1",
        "start_line": 577,
        "end_line": 592,
        "subsections": []
      },
      {
        "id": "24-15-5-2",
        "title": "Contract between controller and processor; requirements for processor; liabilities",
        "section_type": "processor_duties",
        "content": "A contract between a controller and a processor shall govern the processor's data processing procedures with respect to processing performed on behalf of the controller. The contract must ",
        "start_line": 593,
        "end_line": 619,
        "subsections": []
      },
      {
        "id": "24-15-5-3",
        "title": "Determination of role as controller or processor; context dependent",
        "section_type": "general",
        "content": "Determining whether a person is acting as a controller or a processor with respect to a specific processing of data is a fact based determination that dependsupon the context in which pe",
        "start_line": 620,
        "end_line": 626,
        "subsections": []
      },
      {
        "id": "24-15-6-1",
        "title": "Applicability of data protection impact assessment requirements; controller's duty to conduct assessment; activities subject to assessment; weighing of benefits and risks; assessments conducted for compliance with other laws",
        "section_type": "controller_duties",
        "content": "The data protection impact assessment requirements set forth in this chapter apply to processing activities created or generated after December 31, 2025, and are not retroactive to any pro",
        "start_line": 636,
        "end_line": 668,
        "subsections": []
      },
      {
        "id": "24-15-6-2",
        "title": "Attorney general's request for data protection impact assessment; controller's duty to provide; confidentiality",
        "section_type": "enforcement",
        "content": "The attorney general may request, pursuant to a civil investigative demand, that a controller disclose any data protection impact assessment that is relevant to an investigation conducted ",
        "start_line": 669,
        "end_line": 678,
        "subsections": []
      },
      {
        "id": "24-15-7-1",
        "title": "Duties of controller possessing de-identified data",
        "section_type": "controller_duties",
        "content": "A controller in possession of de-identified data shall: (1) take reasonable measures to ensure that the data cannot be associated with an individual; (2) publicly commit to maintaining and",
        "start_line": 687,
        "end_line": 704,
        "subsections": []
      },
      {
        "id": "24-15-7-2",
        "title": "Pseudonymous data; technical and organizational controls",
        "section_type": "exemptions",
        "content": "The: (1) rights of a consumer set forth in IC 24-15-3-1(b)(1) through IC 24-15-3-1(b)(4); and (2) responsibilities of a controller under IC 24-15-4-1(1) through IC 24-15-4-1(5); do not a",
        "start_line": 705,
        "end_line": 713,
        "subsections": []
      },
      {
        "id": "24-15-7-3",
        "title": "Controller's disclosure of de-identified or pseudonymous data; compliance with contractual commitments",
        "section_type": "controller_duties",
        "content": "A controller that discloses pseudonymous data or de-identified data shall exercise reasonable oversight to monitor compliance with any contractual commitments to which the pseudonymous dat",
        "start_line": 714,
        "end_line": 719,
        "subsections": []
      },
      {
        "id": "24-15-8-1",
        "title": "Permissible activities by controllers and processors",
        "section_type": "exemptions",
        "content": "This article shall not be construed to restrict a controller's or processor's ability to do any of the following: (1) Comply with federal, state, or local laws, rules, or regulations or,",
        "start_line": 735,
        "end_line": 773,
        "subsections": []
      },
      {
        "id": "24-15-8-2",
        "title": "Collecting, using, or retaining data; permissible purposes",
        "section_type": "exemptions",
        "content": "The obligations imposed on a controller or a processor under this article do not prohibit or restrict a controller or processor from collecting, using, or retaining data to do the followin",
        "start_line": 774,
        "end_line": 789,
        "subsections": []
      },
      {
        "id": "24-15-8-3",
        "title": "Evidentiary privilege; exemption from obligations concerning personal data",
        "section_type": "exemptions",
        "content": "The obligations imposed on a controller or a processor under this article do not apply if compliance by the controller or processor with this article would violate an evidentiary privileg",
        "start_line": 790,
        "end_line": 797,
        "subsections": []
      },
      {
        "id": "24-15-8-4",
        "title": "Disclosure of personal data to third party controller or processor",
        "section_type": "exemptions",
        "content": "A controller or processor that discloses personal data to a third party controller or processor in compliance with this article is not in violation of this article if the third party cont",
        "start_line": 798,
        "end_line": 806,
        "subsections": []
      },
      {
        "id": "24-15-8-5",
        "title": "Personal rights or freedoms; free speech; personal data in context of purely personal or household activity",
        "section_type": "exemptions",
        "content": "This article: (1) shall not be construed as an obligation imposed on controllers and processors that adversely affects the rights or freedoms of any persons, such as exercising the right ",
        "start_line": 807,
        "end_line": 814,
        "subsections": []
      },
      {
        "id": "24-15-8-6",
        "title": "Controller not required to disclose trade secrets",
        "section_type": "exemptions",
        "content": "Nothing in this article shall be construed as requiring a controller to disclose trade secrets.",
        "start_line": 815,
        "end_line": 818,
        "subsections": []
      },
      {
        "id": "24-15-8-7",
        "title": "Processing of personal data for authorized purposes; collection, use, or retention of personal data; burden of proof for exemption",
        "section_type": "general",
        "content": "Personal data processed by a controller for a purpose authorized under this chapter may not be processed for any other purpose unless otherwise allowed under this article. Personal data pr",
        "start_line": 819,
        "end_line": 838,
        "subsections": []
      },
      {
        "id": "24-15-9-1",
        "title": "Violations; civil investigative demand by attorney general",
        "section_type": "enforcement",
        "content": "Whenever the attorney general has reasonable cause to believe that any person has engaged in, is engaging in, or is about to engage in any violation of this article, the attorney general ",
        "start_line": 845,
        "end_line": 849,
        "subsections": []
      },
      {
        "id": "24-15-10-1",
        "title": "Attorney general's exclusive enforcement authority",
        "section_type": "enforcement",
        "content": "The attorney general has exclusive authority to enforce the provisions of this article.",
        "start_line": 859,
        "end_line": 862,
        "subsections": []
      },
      {
        "id": "24-15-10-2",
        "title": "Action by attorney general for violation; injunction; civil penalty; recovery of expenses",
        "section_type": "enforcement",
        "content": "The attorney general may initiate an action in the name of the state and may seek an injunction to restrain any violations of this article and a civil penalty not to exceed seven thousand",
        "start_line": 863,
        "end_line": 870,
        "subsections": []
      },
      {
        "id": "24-15-10-3",
        "title": "Notice of alleged violation; controller's or processor's right to cure",
        "section_type": "enforcement",
        "content": "Before initiating an action under section 2 of this chapter, the attorney general shall provide a controller or processor thirty (30) days written notice identifying the specific provisio",
        "start_line": 871,
        "end_line": 889,
        "subsections": []
      },
      {
        "id": "24-15-10-4",
        "title": "No private right of action for violation",
        "section_type": "enforcement",
        "content": "Nothing in this article shall be construed as providing the basis for a private right of action for violations of this article or any other law.",
        "start_line": 890,
        "end_line": 895,
        "subsections": []
      },
      {
        "id": "24-15-11-1",
        "title": "Preemption of local laws",
        "section_type": "general",
        "content": "This article supersedes and preempts all rules, regulations, codes, ordinances, and other laws adopted by a city, county, city and county, municipality, or local agency regarding the proc",
        "start_line": 903,
        "end_line": 908,
        "subsections": []
      },
      {
        "id": "24-15-11-2",
        "title": "References to federal, state, or local laws",
        "section_type": "general",
        "content": "Any reference to federal, state, or local law or statute in this article includes any accompanying rules, regulations, or exemptions.",
        "start_line": 909,
        "end_line": 913,
        "subsections": []
      }
    ],
    "definitions": {
      "Affiliate": {
        "term": "Affiliate",
        "definition": "a legal entity that: (1) controls, is controlled by, or is under common control with another legal entity; or (2) shares common branding with another legal entity. For purposes of this section, \"control\", with respect to a company, means: (1) ownership of, or the power to vote, more than fifty percent (50%) of the outstanding shares of any class of voting security of the company; (2) control in any manner over the election of a majority of the directors or of individuals exercising similar functions; or (3) the power to exercise controlling influence over the management of the company.",
        "section": "24-15-2-1",
        "notes": ""
      },
      "Aggregate data": {
        "term": "Aggregate data",
        "definition": "information: (1) that relates to a group or category of consumers; (2) from which individual consumer identities have been removed; and (3) that is not linked or reasonably linkable to any consumer.",
        "section": "24-15-2-2",
        "notes": ""
      },
      "Authenticate": {
        "term": "Authenticate",
        "definition": "to verify through reasonable means that a consumer who is entitled to exercise the personal data rights provided by IC 24-15-3 is the same consumer exercising such rights with respect to particular personal data.",
        "section": "24-15-2-3",
        "notes": ""
      },
      "Biometric data": {
        "term": "Biometric data",
        "definition": "data that: (1) is generated by automatic measurements ofan individual's biological characteristics, such as a fingerprint, a voiceprint, images of the retina or iris, or other unique biological patterns or characteristics; and (2) is used to identify a specific individual. The term does not include: (1) a physical or digital photograph, or data generated from a physical or digital photograph; (2) a video or audio recording, or data generated from a video or audio recording; or (3) information collected, used, or stored for health care treatment, payment, or operations under HIPAA.",
        "section": "24-15-2-4",
        "notes": ""
      },
      "Business associate": {
        "term": "Business associate",
        "definition": "has the meaning set forth in 45 CFR 160.103.",
        "section": "24-15-2-5",
        "notes": ""
      },
      "Child": {
        "term": "Child",
        "definition": "any individual who is less than thirteen (13) years of age.",
        "section": "24-15-2-6",
        "notes": ""
      },
      "Consent": {
        "term": "Consent",
        "definition": "a clear affirmative act that signifies a consumer's freely given, specific, informed, and unambiguous agreement to process personal data relating to the consumer. For purposes of this section, a \"clear affirmative act\" includes a written statement, including a statement written by electronic means, or any other unambiguous affirmative action.",
        "section": "24-15-2-7",
        "notes": ""
      },
      "Consumer": {
        "term": "Consumer",
        "definition": "an individual who: (1) is a resident of Indiana; and (2) is acting only for a personal, family, or household purpose. The term does not include an individual acting in a commercial or employment context.",
        "section": "24-15-2-8",
        "notes": ""
      },
      "Controller": {
        "term": "Controller",
        "definition": "a person that, alone or jointly with others, determines the purpose and means of processing personal data.",
        "section": "24-15-2-9",
        "notes": ""
      },
      "Covered entity": {
        "term": "Covered entity",
        "definition": "has the meaning set forth in 45 CFR 160.103.",
        "section": "24-15-2-10",
        "notes": ""
      },
      "Decision that produces legal or similarly significant effects concerning a consumer": {
        "term": "Decision that produces legal or similarly significant effects concerning a consumer",
        "definition": "a decision made by a controller that results in the provision or denial by the controller of: (1) financial and lending services; (2) housing; (3) insurance; (4) education enrollment; (5) criminal justice; (6) employment opportunities; (7) health care services; or (8) access to basic necessities, such as food and water.",
        "section": "24-15-2-11",
        "notes": ""
      },
      "De-identified data": {
        "term": "De-identified data",
        "definition": "data that cannot reasonably be linked to an identified or identifiable individual because a controller that possesses the data: (1) takes reasonable measures to ensure that the data cannot be associated with an individual; (2) publicly commits to maintaining and using the data without attempting to re-identify the data; and (3) obligates any recipients of the data through contractual requirements to comply with all applicable provisions of this article.",
        "section": "24-15-2-12",
        "notes": ""
      },
      "Health care provider": {
        "term": "Health care provider",
        "definition": "has the meaning set forth in IC 4-6-14-2.",
        "section": "24-15-2-13",
        "notes": ""
      },
      "Health record": {
        "term": "Health record",
        "definition": "has the meaning set forth in IC 1-1-4-5(a)(6).",
        "section": "24-15-2-14",
        "notes": ""
      },
      "HIPAA": {
        "term": "HIPAA",
        "definition": "refers to the federal Health Insurance Portability and Accountability Act of 1996 (42 U.S.C. 1320d et seq.).",
        "section": "24-15-2-15",
        "notes": ""
      },
      "Identified or identifiable individual": {
        "term": "Identified or identifiable individual",
        "definition": "an individual who can be readily identified, directly or indirectly.",
        "section": "24-15-2-16",
        "notes": ""
      },
      "Institution of higher education": {
        "term": "Institution of higher education",
        "definition": "a public or private college or university.",
        "section": "24-15-2-17",
        "notes": ""
      },
      "Nonprofit organization": {
        "term": "Nonprofit organization",
        "definition": "any organization exempt from taxation under Section 501(c)(3), 501(c)(6), or 501(c)(12) of the Internal Revenue Code.",
        "section": "24-15-2-18",
        "notes": ""
      },
      "Personal data": {
        "term": "Personal data",
        "definition": "information that is linked or reasonably linkable to an identified or identifiable individual. The term does not include: (1) de-identified data; (2) aggregate data; or (3) publicly available information.",
        "section": "24-15-2-19",
        "notes": ""
      },
      "Precise geolocation data": {
        "term": "Precise geolocation data",
        "definition": "information derived from technology, including global positioning system level latitude and longitude coordinates, that directly identifies the specific location of a natural person with precision and accuracy within a radius of one thousand seven hundred fifty (1,750) feet. The term does not include: (1) the content of communications; or (2) any data generated by or connected to advanced utility metering infrastructure systems or equipment for use by a utility.",
        "section": "24-15-2-20",
        "notes": ""
      },
      "Processing": {
        "term": "Processing",
        "definition": "with respect to personal data, means any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion, or modification of personal data.",
        "section": "24-15-2-21",
        "notes": ""
      },
      "Processor": {
        "term": "Processor",
        "definition": "a person that processes personal data on behalf of a controller.",
        "section": "24-15-2-22",
        "notes": ""
      },
      "Profiling": {
        "term": "Profiling",
        "definition": "any form of solely automated processing performed on personal data to evaluate, analyze, or predict personal aspects related to an identified or identifiable individual's economic situation, health or health records, personal preferences, interests, reliability, behavior, location, or movements.",
        "section": "24-15-2-23",
        "notes": ""
      },
      "Protected health information": {
        "term": "Protected health information",
        "definition": "has the meaning set forth in 45 CFR 160.103.",
        "section": "24-15-2-24",
        "notes": ""
      },
      "Pseudonymous data": {
        "term": "Pseudonymous data",
        "definition": "personal data that cannot be attributed to a specific individual because additional information that would allow the data to be attributed to a specific individual is: (1) kept separately; and (2) subject to appropriate technical and organizational measures; to ensure that the personal data is not attributed to an identified or identifiable individual.",
        "section": "24-15-2-25",
        "notes": ""
      },
      "Publicly available information": {
        "term": "Publicly available information",
        "definition": "information: (1) that is lawfully made available through federal, state, or local government records; or (2) that a business has a reasonable basis to believe is lawfully made available: (A) to the general public through widely distributed media; (B) by the consumer to whom the information pertains; or (C) by a person to whom the consumer has disclosed the information; unless the consumer has restricted the information to a specific audience.",
        "section": "24-15-2-26",
        "notes": ""
      },
      "Sale of personal data": {
        "term": "Sale of personal data",
        "definition": "the exchange of personal data for monetary consideration by a controller to a third party. The term does not include: (1) the disclosure of personal data to a processor that processes the personal data on behalf of the controller; (2) the disclosure of personal data to a third party for purposes of providing a product or service requested by: (A) the consumer; or (B) the parent of a child; to whom the personal data pertains; (3) the disclosure or transfer of personal data to an affiliate of the controller; (4) the disclosure of information that the consumer: (A) intentionally made available to the general public via a channel of mass media; and (B) did not restrict to a specific audience; or (5) the disclosure or transfer of personal data to a third party as an asset that is part of a proposed or actual merger, acquisition, bankruptcy, or other transaction in which the third party assumes control of all or part of the controller's assets.",
        "section": "24-15-2-27",
        "notes": ""
      },
      "Sensitive data": {
        "term": "Sensitive data",
        "definition": "a category of personal data that includes any of the following: (1) Personal data revealing racial or ethnic origin, religious beliefs, a mental or physical health diagnosis made by a health care provider, sexual orientation, or citizenship or immigration status. (2) Genetic or biometric data that is processed for the purpose of uniquely identifying a specific individual. (3) Personal data collected from a known child. (4) Precise geolocation data.",
        "section": "24-15-2-28",
        "notes": ""
      },
      "State agency": {
        "term": "State agency",
        "definition": "has the meaning set forth in IC 1-1-15-3.",
        "section": "24-15-2-29",
        "notes": ""
      },
      "Targeted advertising": {
        "term": "Targeted advertising",
        "definition": "the displaying of an advertisement to a consumer in which the advertisement is selected based on personal data obtained from that consumer's activities over time and across nonaffiliated websites or online applications to predict the consumer's preferences or interests. The term does not include: (1) advertisements based on activities within a controller's own or affiliated websites or online applications; (2) advertisements based on the context of a consumer's current search query, visit to a website, or online application; (3) advertisements directed to a consumer in response to the consumer's request for information or feedback; or (4) the processing of personal data solely for measuring or reporting advertising performance, reach, or frequency.",
        "section": "24-15-2-30",
        "notes": ""
      },
      "Third party": {
        "term": "Third party",
        "definition": "with respect to a context to which this article applies, means a natural or legal person, public authority, agency, or body other than: (1) the consumer; (2) the controller; (3) the processor; or (4) an affiliate of the processor or the controller.",
        "section": "24-15-2-31",
        "notes": ""
      },
      "Trade secret": {
        "term": "Trade secret",
        "definition": "has the meaning set forth in IC 24-2-3-2.",
        "section": "24-15-2-32",
        "notes": ""
      }
    }
  }
}