{
  "statute_name": "Iowa Privacy Law",
  "effective_date": "January 1, 2025",
  "definitions": {
    "Affiliate": {
      "term": "Affiliate",
      "definition": "means a legal entity that controls, is controlled by, or is under common control with another legal entity or shares common branding with another legal entity. For the purposes of this definition, 'control' or 'controlled' means: (a) Ownership of, or the power to vote, more than fifty percent of the outstanding shares of any class of voting security of a company. (b) Control in any manner over the election of a majority of the directors or of individuals exercising similar functions. (c) The power to exercise controlling influence over the management of a company.",
      "section": "715D.1",
      "notes": ""
    },
    "Aggregate data": {
      "term": "Aggregate data",
      "definition": "means information that relates to a group or category of consumers, from which individual consumer identities have been removed, that is not linked or reasonably linkable to any consumer.",
      "section": "715D.1",
      "notes": ""
    },
    "Authenticate": {
      "term": "Authenticate",
      "definition": "means verifying through reasonable means that a consumer, entitled to exercise their consumer rights in section 715D.3, is the same consumer exercising such consumer rights with respect to the personal data at issue.",
      "section": "715D.1",
      "notes": ""
    },
    "Biometric data": {
      "term": "Biometric data",
      "definition": "means data generated by automatic measurements of an individual's biological characteristics, such as a fingerprint, voiceprint, eye retinas, irises, or other unique biological patterns or characteristics that is used to identify a specific individual. 'Biometric data' does not include a physical or digital photograph, a video or audio recording or data generated therefrom, or information collected, used, or stored for health care treatment, payment or operations under HIPAA.",
      "section": "715D.1",
      "notes": ""
    },
    "Child": {
      "term": "Child",
      "definition": "means any natural person younger than thirteen years of age.",
      "section": "715D.1",
      "notes": ""
    },
    "Consent": {
      "term": "Consent",
      "definition": "means a clear affirmative act signifying a consumer's freely given, specific, informed, and unambiguous agreement to process personal data relating to the consumer. 'Consent' may include a written statement, including a statement written by electronic means, or any other unambiguous affirmative action.",
      "section": "715D.1",
      "notes": ""
    },
    "Consumer": {
      "term": "Consumer",
      "definition": "means a natural person who is a resident of the state acting only in an individual or household context and excluding a natural person acting in a commercial or employment context.",
      "section": "715D.1",
      "notes": ""
    },
    "Controller": {
      "term": "Controller",
      "definition": "means a person that, alone or jointly with others, determines the purpose and means of processing personal data.",
      "section": "715D.1",
      "notes": ""
    },
    "Covered entity": {
      "term": "Covered entity",
      "definition": "means the same as 'covered entity' defined by HIPAA.",
      "section": "715D.1",
      "notes": ""
    },
    "De-identified data": {
      "term": "De-identified data",
      "definition": "means data that cannot reasonably be linked to an identified or identifiable natural person.",
      "section": "715D.1",
      "notes": ""
    },
    "Fund": {
      "term": "Fund",
      "definition": "means the consumer education and litigation fund established pursuant to section 714.16C.",
      "section": "715D.1",
      "notes": ""
    },
    "Health care provider": {
      "term": "Health care provider",
      "definition": "means any of the following: (a) A general hospital, ambulatory surgical or treatment center, skilled nursing center, or assisted living center licensed or certified by the state. (b) A psychiatric hospital licensed by the state. (c) A hospital operated by the state. (d) A hospital operated by the state board of regents. (e) A person licensed to practice medicine or osteopathy in the state. (f) A person licensed to furnish health care policies or plans in the state. (g) A person licensed to practice dentistry in the state. (h) 'Health care provider' does not include a continuing care retirement community or any nursing facility of a religious body which depends upon prayer alone for healing.",
      "section": "715D.1",
      "notes": ""
    },
    "Health Insurance Portability and Accountability Act or HIPAA": {
      "term": "Health Insurance Portability and Accountability Act or HIPAA",
      "definition": "means the federal Health Insurance Portability and Accountability Act of 1996, Pub. L. No. 104-191, including amendments thereto and regulations promulgated thereunder.",
      "section": "715D.1",
      "notes": ""
    },
    "Health record": {
      "term": "Health record",
      "definition": "means any written, printed, or electronically recorded material maintained by a health care provider in the course of providing health services to an individual concerning the individual and the services provided, including related health information provided in confidence to a health care provider.",
      "section": "715D.1",
      "notes": ""
    },
    "Identified or identifiable natural person": {
      "term": "Identified or identifiable natural person",
      "definition": "means a person who can be readily identified, directly or indirectly.",
      "section": "715D.1",
      "notes": ""
    },
    "Institution of higher education": {
      "term": "Institution of higher education",
      "definition": "means nonprofit private institutions of higher education and proprietary private institutions of higher education in the state, community colleges, and each associate-degree-granting and baccalaureate public institutions of higher education in the state.",
      "section": "715D.1",
      "notes": ""
    },
    "Nonprofit organization": {
      "term": "Nonprofit organization",
      "definition": "means any corporation organized under chapter 504, any organization exempt from taxation under sections 501(c)(3), 501(c)(6), or 501(c)(12) of the Internal Revenue Code, any organization exempt from taxation under section 501(c)(4) of the Internal Revenue Code that is established to detect or prevent insurance-related crime or fraud, and any subsidiaries and affiliates of entities organized pursuant to chapter 499.",
      "section": "715D.1",
      "notes": ""
    },
    "Personal data": {
      "term": "Personal data",
      "definition": "means any information that is linked or reasonably linkable to an identified or identifiable natural person. 'Personal data' does not include de-identified or aggregate data or publicly available information.",
      "section": "715D.1",
      "notes": ""
    },
    "Precise geolocation data": {
      "term": "Precise geolocation data",
      "definition": "means information derived from technology, including but not limited to global positioning system level latitude and longitude coordinates or other mechanisms, that identifies the specific location of a natural person with precision and accuracy within a radius of one thousand seven hundred fifty feet. 'Precise geolocation data' does not include the content of communications, or any data generated by or connected to utility metering infrastructure systems or equipment for use by a utility.",
      "section": "715D.1",
      "notes": ""
    },
    "Process or processing": {
      "term": "Process or processing",
      "definition": "means any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion, or modification of personal data.",
      "section": "715D.1",
      "notes": ""
    },
    "Processor": {
      "term": "Processor",
      "definition": "means a person that processes personal data on behalf of a controller.",
      "section": "715D.1",
      "notes": ""
    },
    "Protected health information": {
      "term": "Protected health information",
      "definition": "means the same as protected health information established by HIPAA.",
      "section": "715D.1",
      "notes": ""
    },
    "Pseudonymous data": {
      "term": "Pseudonymous data",
      "definition": "means personal data that cannot be attributed to a specific natural person without the use of additional information, provided that such additional information is kept separately and is subject to appropriate technical and organizational measures to ensure that the personal data is not attributed to an identified or identifiable natural person.",
      "section": "715D.1",
      "notes": ""
    },
    "Publicly available information": {
      "term": "Publicly available information",
      "definition": "means information that is lawfully made available through federal, state, or local government records, or information that a business has reasonable basis to believe is lawfully made available to the general public through widely distributed media, by the consumer, or by a person to whom the consumer has disclosed the information, unless the consumer has restricted the information to a specific audience.",
      "section": "715D.1",
      "notes": ""
    },
    "Sale of personal data": {
      "term": "Sale of personal data",
      "definition": "means the exchange of personal data for monetary consideration by the controller to a third party. 'Sale of personal data' does not include: (a) The disclosure of personal data to a processor that processes the personal data on behalf of the controller. (b) The disclosure of personal data to a third party for purposes of providing a product or service requested by the consumer or a parent of a child. (c) The disclosure or transfer of personal data to an affiliate of the controller. (d) The disclosure of information that the consumer intentionally made available to the general public via a channel of mass media and did not restrict to a specific audience. (e) The disclosure or transfer of personal data when a consumer uses or directs a controller to intentionally disclose personal data or intentionally interact with one or more third parties. (f) The disclosure or transfer of personal data to a third party as an asset that is part of a proposed or actual merger, acquisition, bankruptcy, or other transaction in which the third party assumes control of all or part of the controller's assets.",
      "section": "715D.1",
      "notes": ""
    },
    "Sensitive data": {
      "term": "Sensitive data",
      "definition": "means a category of personal data that includes the following: (a) Racial or ethnic origin, religious beliefs, mental or physical health diagnosis, sexual orientation, or citizenship or immigration status, except to the extent such data is used in order to avoid discrimination on the basis of a protected class that would violate a federal or state anti-discrimination law. (b) Genetic or biometric data that is processed for the purpose of uniquely identifying a natural person. (c) The personal data collected from a known child. (d) Precise geolocation data.",
      "section": "715D.1",
      "notes": ""
    },
    "State agency": {
      "term": "State agency",
      "definition": "means the same as defined in 129 IAC 10.2(8B).",
      "section": "715D.1",
      "notes": ""
    },
    "Targeted advertising": {
      "term": "Targeted advertising",
      "definition": "means displaying advertisements to a consumer where the advertisement is selected based on personal data obtained from that consumer's activities over time and across nonaffiliated websites or online applications to predict such consumer's preferences or interests. 'Targeted advertising' does not include the following: (a) Advertisements based on activities within a controller's own or affiliated websites or online applications. (b) Advertisements based on the context of a consumer's current search query, visit to a website, or online application. (c) Advertisements directed to a consumer in response to the consumer's request for information or feedback. (d) Processing personal data solely for measuring or reporting advertising performance, reach, or frequency.",
      "section": "715D.1",
      "notes": ""
    },
    "Third party": {
      "term": "Third party",
      "definition": "means a natural or legal person, public authority, agency, or body other than the consumer, controller, processor, or an affiliate of the processor or the controller.",
      "section": "715D.1",
      "notes": ""
    },
    "Trade secret": {
      "term": "Trade secret",
      "definition": "means information, including but not limited to a formula, pattern, compilation, program, device, method, technique, or process, that consists of the following: (a) Information that derives independent economic value, actual or potential, from not being generally known to, and not being readily ascertainable by proper means by, other persons who can obtain economic value from its disclosure or use. (b) Information that is the subject of efforts that are reasonable under the circumstances to maintain its secrecy.",
      "section": "715D.1",
      "notes": ""
    }
  },
  "requirements": [
    {
      "id": "7e86e3e9-6077-4e0c-8e0f-ae8a1a182a3e",
      "description": "Applicability thresholds - controls or processes personal data of at least 100,000 consumers OR 25,000 consumers with over 50% gross revenue from sale of personal data",
      "citation": {
        "section": "715D.2(1)",
        "quoted_text": "This chapter applies to a person conducting business in the state or producing products or services that are targeted to consumers who are residents of the state and that during a calendar year does either of the following: a. Controls or processes personal data of at least one hundred thousand consumers. b. Controls or processes personal data of at least twenty-five thousand consumers and derives over fifty percent of gross revenue from the sale of personal data.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Persons conducting business in Iowa or producing products/services targeted to Iowa residents",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "During a calendar year",
        "Either: (a) controls/processes personal data of 100,000+ consumers, OR (b) controls/processes personal data of 25,000+ consumers AND derives over 50% gross revenue from sale of personal data"
      ],
      "source_section": "715D.2",
      "obligation_type": "shall"
    },
    {
      "id": "ea6ff0f0-11ac-4fa3-8c9d-89b6c380ebed",
      "description": "Entity exemptions from chapter applicability - state/political subdivisions, financial institutions, HIPAA-covered entities, nonprofit organizations, and institutions of higher education",
      "citation": {
        "section": "715D.2(2)",
        "quoted_text": "This chapter shall not apply to the state or any political subdivision of the state; financial institutions, affiliates of financial institutions, or data subject to Tit. V of the federal Gramm-Leach-Bliley Act of 1999, 15 U.S.C. § 6801 et seq.; persons who are subject to and comply with regulations promulgated pursuant to Tit. II, subtit. F, of the federal Health Insurance Portability and Accountability Act of 1996, Pub. L. No. 104-191, and Tit. XIII, subtit. D, of the federal Health Information Technology for Economic and Clinical Health Act of 2009, 42 U.S.C. § 17921 - 17954; nonprofit organizations; or institutions of higher education.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          260,
          261
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "Exempted entities",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Entity falls into one of the enumerated categories"
      ],
      "source_section": "715D.2",
      "obligation_type": "shall_not"
    },
    {
      "id": "8dece43e-3511-46a2-bba7-609708e317ca",
      "description": "Data exemptions - protected health information, health records, patient identifying information, human subjects research data, FCRA data, DPPA data, FERPA data, Farm Credit Act data, employment/benefits data, COPPA data",
      "citation": {
        "section": "715D.2(3)",
        "quoted_text": "The following information and data is exempt from this chapter: a. Protected health information under HIPAA. b. Health records. c. Patient identifying information for purposes of 42 U.S.C. §290dd-2. d. Identifiable private information for purposes of the federal policy for the protection of human subjects under 45 C.F.R. pt. 46... m. The collection, maintenance, disclosure, sale, communication, or use of any personal information bearing on a consumer's credit worthiness... regulated by and authorized under the federal Fair Credit Reporting Act, 15 U.S.C. § 1681 et seq. n. Personal data collected, processed, sold, or disclosed in compliance with the federal Driver's Privacy Protection Act of 1994, 18 U.S.C. § 2721 et seq. o. Personal data regulated by the federal Family Educational Rights and Privacy Act, 20 U.S.C. § 1232 et seq. p. Personal data collected, processed, sold, or disclosed in compliance with the federal Farm Credit Act, 12 U.S.C. § 2001 et seq. q. Data processed or maintained... (1) In the course of an individual applying to, employed by, or acting as an agent or independent contractor of a controller... r. Personal data used in accordance with the federal Children's Online Privacy Protection Act, 15 U.S.C. § 6501 - 6506...",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          274,
          275
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Data falls within one of the enumerated exempt categories"
      ],
      "source_section": "715D.2",
      "obligation_type": "shall_not"
    },
    {
      "id": "a3d32ba9-e91d-4499-8ca9-c375be6602c5",
      "description": "Controller must comply with authenticated consumer rights requests - confirm/access personal data, delete personal data, obtain portable copy, opt out of sale",
      "citation": {
        "section": "715D.3(1)",
        "quoted_text": "A controller shall comply with an authenticated consumer request to exercise all of the following: a. To confirm whether a controller is processing the consumer's personal data and to access such personal data. b. To delete personal data provided by the consumer. c. To obtain a copy of the consumer's personal data... in a portable and, to the extent technically practicable, readily usable format... d. To opt out of the sale of personal data.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          353,
          354
        ],
        "match_type": "contains"
      },
      "category": "disclosure",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Consumer request is authenticated",
        "Parent or legal guardian may act on behalf of known child"
      ],
      "source_section": "715D.3",
      "obligation_type": "shall"
    },
    {
      "id": "a8443c91-c770-4f5c-a9ae-8f671b355506",
      "description": "Controller response deadline - 90 days with one 45-day extension allowed if reasonably necessary",
      "citation": {
        "section": "715D.3(2)(a)",
        "quoted_text": "A controller shall respond to the consumer without undue delay, but in all cases within ninety days of receipt of a request submitted pursuant to the methods described in this section. The response period may be extended once by forty-five additional days when reasonably necessary upon considering the complexity and number of the consumer's requests by informing the consumer of any such extension within the initial ninety-day response period, together with the reason for the extension.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Receipt of consumer request",
        "If extending, must inform consumer within initial 90 days with reason"
      ],
      "source_section": "715D.3",
      "obligation_type": "shall"
    },
    {
      "id": "215b457b-db15-4ceb-9114-c34b1ace0e54",
      "description": "Controller must inform consumer of refusal justification and appeal instructions when declining consumer request",
      "citation": {
        "section": "715D.3(2)(b)",
        "quoted_text": "If a controller declines to take action regarding the consumer's request, the controller shall inform the consumer without undue delay of the justification for declining to take action, except in the case of a suspected fraudulent request, in which case the controller may state that the controller was unable to authenticate the request. The controller shall also provide instructions for appealing the decision pursuant to subsection 3.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "disclosure",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Controller declines to take action on consumer request"
      ],
      "source_section": "715D.3",
      "obligation_type": "shall"
    },
    {
      "id": "36517e24-ea04-4226-a129-50a5029f6480",
      "description": "Free response limit - up to twice annually per consumer, may charge reasonable fee for excessive/repetitive requests",
      "citation": {
        "section": "715D.3(2)(c)",
        "quoted_text": "Information provided in response to a consumer request shall be provided by a controller free of charge, up to twice annually per consumer. If a request from a consumer is manifestly unfounded, excessive, repetitive, technically unfeasible, or the controller reasonably believes that the primary purpose of the request is not to exercise a consumer right, the controller may charge the consumer a reasonable fee to cover the administrative costs of complying with the request or decline to act on the request. The controller bears the burden of demonstrating the manifestly unfounded, excessive, repetitive, or technically unfeasible nature of the request.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          392,
          393
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "First two requests per consumer per year must be free",
        "Controller bears burden of proof for charging fee or declining"
      ],
      "source_section": "715D.3",
      "obligation_type": "shall"
    },
    {
      "id": "5f4ccb32-5f86-4de0-83f1-4ba6cc8fe66e",
      "description": "Controller must establish appeal process for consumer rights request refusals, respond within 60 days, and provide AG contact mechanism if denied",
      "citation": {
        "section": "715D.3(3)",
        "quoted_text": "A controller shall establish a process for a consumer to appeal the controller's refusal to take action on a request within a reasonable period of time after the consumer's receipt of the decision pursuant to this section. The appeal process shall be conspicuously available and similar to the process for submitting requests to initiate action pursuant to this section. Within sixty days of receipt of an appeal, a controller shall inform the consumer in writing of any action taken or not taken in response to the appeal, including a written explanation of the reasons for the decision. If the appeal is denied, the controller shall also provide the consumer with an online mechanism through which the consumer may contact the attorney general to submit a complaint.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Consumer appeals refusal",
        "Must respond within 60 days of appeal receipt"
      ],
      "source_section": "715D.3",
      "obligation_type": "shall"
    },
    {
      "id": "b32fadb6-d3bd-483f-907a-3f83df21bbee",
      "description": "Controller must adopt reasonable data security practices appropriate to volume and nature of personal data",
      "citation": {
        "section": "715D.4(1)",
        "quoted_text": "A controller shall adopt and implement reasonable administrative, technical, and physical data security practices to protect the confidentiality, integrity, and accessibility of personal data. Such data security practices shall be appropriate to the volume and nature of the personal data at issue.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "technical",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must be appropriate to volume and nature of personal data"
      ],
      "source_section": "715D.4",
      "obligation_type": "shall"
    },
    {
      "id": "829e9ac0-1db5-4f77-bdc7-f45cf4a32d97",
      "description": "Controller must provide clear notice and opt-out opportunity for sensitive data processing, or comply with COPPA for known children",
      "citation": {
        "section": "715D.4(2)",
        "quoted_text": "A controller shall not process sensitive data collected from a consumer for a nonexempt purpose without the consumer having been presented with clear notice and an opportunity to opt out of such processing, or, in the case of the processing of sensitive data concerning a known child, without processing such data in accordance with the federal Children's Online Privacy Protection Act, 15 U.S.C. § 6501 et seq.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          432,
          433
        ],
        "match_type": "contains"
      },
      "category": "disclosure",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Processing sensitive data for nonexempt purpose",
        "For known children, must comply with COPPA"
      ],
      "source_section": "715D.4",
      "obligation_type": "shall_not"
    },
    {
      "id": "9b378f95-4068-40a7-a7b2-4ce51dfab17d",
      "description": "Controller prohibited from discriminating against consumers for exercising rights - cannot deny goods/services, charge different prices, or provide different quality levels",
      "citation": {
        "section": "715D.4(3)",
        "quoted_text": "A controller shall not process personal data in violation of state and federal laws that prohibit unlawful discrimination against a consumer. A controller shall not discriminate against a consumer for exercising any of the consumer rights contained in this chapter, including denying goods or services, charging different prices or rates for goods or services, or providing a different level of quality of goods and services to the consumer.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Consumer exercises rights under chapter",
        "Exception: may offer different terms if related to voluntary loyalty programs or if consumer opted out"
      ],
      "source_section": "715D.4",
      "obligation_type": "shall_not"
    },
    {
      "id": "44ba251e-bd57-479b-9216-5dee76d996ab",
      "description": "Privacy notice must include categories of personal data processed, processing purposes, how to exercise rights and appeal, categories shared with third parties, and third party categories",
      "citation": {
        "section": "715D.4(5)",
        "quoted_text": "A controller shall provide consumers with a reasonably accessible, clear, and meaningful privacy notice that includes the following: a. The categories of personal data processed by the controller. b. The purpose for processing personal data. c. How consumers may exercise their consumer rights pursuant to section 715D.3, including how a consumer may appeal a controller's decision with regard to the consumer's request. d. The categories of personal data that the controller shares with third parties, if any. e. The categories of third parties, if any, with whom the controller shares personal data.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "disclosure",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must be reasonably accessible, clear, and meaningful"
      ],
      "source_section": "715D.4",
      "obligation_type": "shall"
    },
    {
      "id": "99256049-82dd-4764-9092-ddf614b9a0fa",
      "description": "Controller must establish secure and reliable means for consumers to submit rights requests, considering normal interaction methods and authentication needs, without requiring new account creation",
      "citation": {
        "section": "715D.4(7)",
        "quoted_text": "A controller shall establish, and shall describe in a privacy notice, secure and reliable means for consumers to submit a request to exercise their consumer rights under this chapter. Such means shall consider the ways in which consumers normally interact with the controller, the need for secure and reliable communication of such requests, and the ability of the controller to authenticate the identity of the consumer making the request. A controller shall not require a consumer to create a new account in order to exercise consumer rights pursuant to section 715D.3, but may require a consumer to use an existing account.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "technical",
      "applies_to": "Controllers",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must describe in privacy notice",
        "Cannot require new account creation"
      ],
      "source_section": "715D.4",
      "obligation_type": "shall"
    },
    {
      "id": "68a6d44a-6f8e-4a86-8288-0b169f43fde6",
      "description": "Processor must assist controller with fulfilling consumer rights requests and security breach notification obligations through appropriate technical and organizational measures",
      "citation": {
        "section": "715D.5(1)",
        "quoted_text": "A processor shall assist a controller in duties required under this chapter, taking into account the nature of processing and the information available to the processor by appropriate technical and organizational measures, insofar as is reasonably practicable, as follows: a. To fulfill the controller's obligation to respond to consumer rights requests pursuant to section 715D.3. b. To meet the controller's obligations in relation to the security of processing the personal data and in relation to the notification of a security breach of the processor pursuant to section 715C.2.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "operational",
      "applies_to": "Processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must be reasonably practicable"
      ],
      "source_section": "715D.5",
      "obligation_type": "shall"
    },
    {
      "id": "6d751247-0c14-489d-9cc8-b35a4c2d116d",
      "description": "Controller-processor contract must govern data processing procedures, specify processing instructions, and require processor confidentiality, data return/deletion, compliance demonstration, and subcontractor compliance",
      "citation": {
        "section": "715D.5(2)",
        "quoted_text": "A contract between a controller and a processor shall govern the processor's data processing procedures with respect to processing performed on behalf of the controller. The contract shall clearly set forth instructions for processing personal data, the nature and purpose of processing, the type of data subject to processing, the duration of processing, and the rights and duties of both parties. The contract shall also include requirements that the processor shall do all of the following: a. Ensure that each person processing personal data is subject to a duty of confidentiality with respect to the data. b. At the controller's direction, delete or return all personal data to the controller as requested at the end of the provision of services, unless retention of the personal data is required by law... d. Engage any subcontractor or agent pursuant to a written contract in accordance with this section that requires the subcontractor to meet the duties of the processor with respect to the personal data.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          508,
          509
        ],
        "match_type": "contains"
      },
      "category": "operational",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Contract must be in place between controller and processor"
      ],
      "source_section": "715D.5",
      "obligation_type": "shall"
    },
    {
      "id": "eea318a1-eaba-4649-8184-c623789fc965",
      "description": "Exemption from obligation to re-identify de-identified/pseudonymous data, maintain data in identifiable form, or collect technology to associate requests with personal data",
      "citation": {
        "section": "715D.6(1)",
        "quoted_text": "Nothing in this chapter shall be construed to require the following: a. A controller or processor to re-identify de-identified data or pseudonymous data. b. Maintaining data in identifiable form. c. Collecting, obtaining, retaining, or accessing any data or technology, in order to be capable of associating an authenticated consumer request with personal data.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Applies to de-identified/pseudonymous data processing"
      ],
      "source_section": "715D.6",
      "obligation_type": "shall_not"
    },
    {
      "id": "0c118c1f-d30f-4ceb-ade4-49f312218a59",
      "description": "Exemption from consumer rights compliance when controller cannot reasonably associate request with personal data and does not use data to recognize consumer or sell to third parties",
      "citation": {
        "section": "715D.6(2)",
        "quoted_text": "Nothing in this chapter shall be construed to require a controller or processor to comply with an authenticated consumer rights request, pursuant to section 715D.3, if all of the following apply: a. The controller is not reasonably capable of associating the request with the personal data or it would be unreasonably burdensome for the controller to associate the request with the personal data. b. The controller does not use the personal data to recognize or respond to the specific consumer who is the subject of the personal data, or associate the personal data with other personal data about the same specific consumer. c. The controller does not sell the personal data to any third party or otherwise voluntarily disclose the personal data to any third party other than a processor...",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          553,
          554
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "All three conditions must apply"
      ],
      "source_section": "715D.6",
      "obligation_type": "shall_not"
    },
    {
      "id": "1baa267e-ccc7-4558-87f0-28570bcf90ce",
      "description": "Permitted processing purposes - legal compliance, governmental cooperation, law enforcement cooperation, legal claims defense, product/service delivery, life/safety protection, security incident response, scientific research, and assisting others with these purposes",
      "citation": {
        "section": "715D.7(1)",
        "quoted_text": "Nothing in this chapter shall be construed to restrict a controller's or processor's ability to do the following: a. Comply with federal, state, or local laws, rules, or regulations. b. Comply with a civil, criminal, or regulatory inquiry, investigation, subpoena, or summons by federal, state, local, or other governmental authorities. c. Cooperate with law enforcement agencies... d. Investigate, establish, exercise, prepare for, or defend legal claims. e. Provide a product or service specifically requested by a consumer... f. Take immediate steps to protect an interest that is essential for the life or physical safety of the consumer or of another natural person... g. Prevent, detect, protect against, or respond to security incidents, identity theft, fraud, harassment, malicious or deceptive activities, or any illegal activity... j. Engage in public or peer-reviewed scientific or statistical research in the public interest... k. Assist another controller, processor, or third party with any of the obligations under this subsection.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          586,
          587
        ],
        "match_type": "contains"
      },
      "category": "disclosure",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Processing must be for one of the enumerated purposes"
      ],
      "source_section": "715D.7",
      "obligation_type": "shall_not"
    },
    {
      "id": "a3107643-78ab-4104-b37d-078a39e1a20c",
      "description": "Permitted data collection, use, and retention for internal research, product recalls, technical error repair, and internal operations aligned with consumer expectations",
      "citation": {
        "section": "715D.7(2)",
        "quoted_text": "The obligations imposed on a controller or processor under this chapter shall not restrict a controller's or processor's ability to collect, use, or retain data as follows: a. To conduct internal research to develop, improve, or repair products, services, or technology. b. To effectuate a product recall. c. To identify and repair technical errors that impair existing or intended functionality. d. To perform internal operations that are reasonably aligned with the expectations of the consumer or reasonably anticipated based on the consumer's existing relationship with the controller or are otherwise compatible with processing data in furtherance of the provision of a product or service specifically requested by a consumer...",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact_normalized"
      },
      "category": "disclosure",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Data collection/use/retention must be for one of the enumerated purposes"
      ],
      "source_section": "715D.7",
      "obligation_type": "shall_not"
    },
    {
      "id": "a88e22cd-bc31-43ba-a8a9-97343b66a8d6",
      "description": "Attorney General has exclusive enforcement authority with civil investigative demand power",
      "citation": {
        "section": "715D.8(1)",
        "quoted_text": "The attorney general shall have exclusive authority to enforce the provisions of this chapter. Whenever the attorney general has reasonable cause to believe that any person has engaged in, is engaging in, or is about to engage in any violation of this chapter, the attorney general is empowered to issue a civil investigative demand. The provisions of section 685.6 shall apply to civil investigative demands issued under this chapter.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Attorney General",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Reasonable cause to believe violation has occurred, is occurring, or is about to occur"
      ],
      "source_section": "715D.8",
      "obligation_type": "shall"
    },
    {
      "id": "3bc04be6-d5a1-4e69-a88e-991b0e7c2fae",
      "description": "90-day cure period - Attorney General must provide written notice and opportunity to cure before initiating action",
      "citation": {
        "section": "715D.8(2)",
        "quoted_text": "Prior to initiating any action under this chapter, the attorney general shall provide a controller or processor ninety days' written notice identifying the specific provisions of this chapter the attorney general alleges have been or are being violated. If within the ninety-day period, the controller or processor cures the noticed violation and provides the attorney general an express written statement that the alleged violations have been cured and that no further such violations shall occur, no action shall be initiated against the controller or processor.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact_normalized"
      },
      "category": "legal_framework",
      "applies_to": "Attorney General, controllers, and processors",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Must provide 90 days' written notice before action",
        "No action if cured within 90 days with written statement"
      ],
      "source_section": "715D.8",
      "obligation_type": "shall"
    },
    {
      "id": "34b21b76-ae2d-4e2a-bc51-25bc868c4d37",
      "description": "Civil penalties up to $7,500 per violation, with proceeds to consumer education and litigation fund",
      "citation": {
        "section": "715D.8(3)",
        "quoted_text": "If a controller or processor continues to violate this chapter following the cure period in subsection 2 or breaches an express written statement provided to the attorney general under that subsection, the attorney general may initiate an action in the name of the state and may seek an injunction to restrain any violations of this chapter and civil penalties of up to seven thousand five hundred dollars for each violation under this chapter. Any moneys collected under this section including civil penalties, costs, attorney fees, or amounts which are specifically directed shall be paid into the consumer education and litigation fund established under section 714.16C.",
        "verified": true,
        "confidence": 0.85,
        "line_numbers": [
          729,
          730
        ],
        "match_type": "contains"
      },
      "category": "legal_framework",
      "applies_to": "Controllers and processors",
      "verified": true,
      "confidence": 0.85,
      "conditions": [
        "Violation continues after cure period OR breach of written statement"
      ],
      "source_section": "715D.8",
      "obligation_type": "may"
    },
    {
      "id": "c1ea0529-2e8e-4925-b713-791e798390cf",
      "description": "No private right of action for chapter violations",
      "citation": {
        "section": "715D.8(4)",
        "quoted_text": "Nothing in this chapter shall be construed as providing the basis for, or be subject to, a private right of action for violations of this chapter or under any other law.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Consumers and private parties",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "No private right of action available"
      ],
      "source_section": "715D.8",
      "obligation_type": "shall_not"
    },
    {
      "id": "872b54c8-00b7-4cd7-959e-385e1026c02a",
      "description": "Preemption of local laws - chapter supersedes city, county, municipality, or local agency laws regarding personal data processing",
      "citation": {
        "section": "715D.9(1)",
        "quoted_text": "This chapter supersedes and preempts all rules, regulations, codes, ordinances, and other laws adopted by a city, county, municipality, or local agency regarding the processing of personal data by controllers or processors.",
        "verified": true,
        "confidence": 1.0,
        "line_numbers": [
          20,
          20
        ],
        "match_type": "exact"
      },
      "category": "legal_framework",
      "applies_to": "Local governments (cities, counties, municipalities, local agencies)",
      "verified": true,
      "confidence": 1.0,
      "conditions": [
        "Chapter supersedes local laws on personal data processing"
      ],
      "source_section": "715D.9",
      "obligation_type": "shall"
    }
  ],
  "unverified_items": [],
  "metadata": {
    "source_file": "State Privacy Laws\\Iowa Privacy Law.pdf",
    "total_requirements": 24,
    "verified_count": 24,
    "output_format": "json",
    "sections_processed": [
      "715D.2",
      "715D.3",
      "715D.4",
      "715D.5",
      "715D.6",
      "715D.7",
      "715D.8",
      "715D.9"
    ],
    "requirements_per_section": {
      "715D.2": 3,
      "715D.3": 5,
      "715D.4": 5,
      "715D.5": 2,
      "715D.6": 2,
      "715D.7": 2,
      "715D.8": 4,
      "715D.9": 1
    },
    "total_extracted": 24,
    "defined_terms": [
      "Affiliate",
      "Aggregate data",
      "Authenticate",
      "Biometric data",
      "Child",
      "Consent",
      "Consumer",
      "Controller",
      "Covered entity",
      "De-identified data",
      "Fund",
      "Health care provider",
      "Health Insurance Portability and Accountability Act or HIPAA",
      "Health record",
      "Identified or identifiable natural person",
      "Institution of higher education",
      "Nonprofit organization",
      "Personal data",
      "Precise geolocation data",
      "Process or processing",
      "Processor",
      "Protected health information",
      "Pseudonymous data",
      "Publicly available information",
      "Sale of personal data",
      "Sensitive data",
      "State agency",
      "Targeted advertising",
      "Third party",
      "Trade secret"
    ],
    "section_types": {
      "715D.1": "definitions",
      "715D.2": "applicability",
      "715D.3": "consumer_rights",
      "715D.4": "controller_duties",
      "715D.5": "processor_duties",
      "715D.6": "exemptions",
      "715D.7": "exemptions",
      "715D.8": "enforcement",
      "715D.9": "general"
    }
  },
  "structure": {
    "name": "Iowa Consumer Data Protection Act",
    "citation": "Senate File 262, Chapter 715D, Iowa Code",
    "effective_date": "January 1, 2025",
    "sections": [
      {
        "id": "715D.1",
        "title": "Definitions",
        "section_type": "definitions",
        "content": "As used in this chapter, unless the context otherwise requires: 1. Affiliate - means a legal entity that controls, is controlled by, or is under common control with another legal entity or shares",
        "start_line": 1,
        "end_line": 150,
        "subsections": []
      },
      {
        "id": "715D.2",
        "title": "Scope and exemptions",
        "section_type": "applicability",
        "content": "1. This chapter applies to a person conducting business in the state or producing products or services that are targeted to consumers who are residents of the state and that during a calendar",
        "start_line": 151,
        "end_line": 230,
        "subsections": []
      },
      {
        "id": "715D.3",
        "title": "Consumer data rights",
        "section_type": "consumer_rights",
        "content": "1. A consumer may invoke the consumer rights authorized pursuant to this section at any time by submitting a request to the controller, through the means specified by the controller pursuant",
        "start_line": 231,
        "end_line": 310,
        "subsections": []
      },
      {
        "id": "715D.4",
        "title": "Data controller duties",
        "section_type": "controller_duties",
        "content": "1. A controller shall adopt and implement reasonable administrative, technical, and physical data security practices to protect the confidentiality, integrity, and accessibility of personal data",
        "start_line": 311,
        "end_line": 420,
        "subsections": []
      },
      {
        "id": "715D.5",
        "title": "Processor duties",
        "section_type": "processor_duties",
        "content": "1. A processor shall assist a controller in duties required under this chapter, taking into account the nature of processing and the information available to the processor by appropriate techni",
        "start_line": 421,
        "end_line": 480,
        "subsections": []
      },
      {
        "id": "715D.6",
        "title": "Processing data — exemptions",
        "section_type": "exemptions",
        "content": "1. Nothing in this chapter shall be construed to require the following: a. A controller or processor to re-identify de-identified data or pseudonymous data. b. Maintaining data in identifiable",
        "start_line": 481,
        "end_line": 550,
        "subsections": []
      },
      {
        "id": "715D.7",
        "title": "Limitations",
        "section_type": "exemptions",
        "content": "1. Nothing in this chapter shall be construed to restrict a controller's or processor's ability to do the following: a. Comply with federal, state, or local laws, rules, or regulations. b. Co",
        "start_line": 551,
        "end_line": 680,
        "subsections": []
      },
      {
        "id": "715D.8",
        "title": "Enforcement — penalties",
        "section_type": "enforcement",
        "content": "1. The attorney general shall have exclusive authority to enforce the provisions of this chapter. Whenever the attorney general has reasonable cause to believe that any person has engaged in, i",
        "start_line": 681,
        "end_line": 750,
        "subsections": []
      },
      {
        "id": "715D.9",
        "title": "Preemption",
        "section_type": "general",
        "content": "1. This chapter supersedes and preempts all rules, regulations, codes, ordinances, and other laws adopted by a city, county, municipality, or local agency regarding the processing of personal d",
        "start_line": 751,
        "end_line": 770,
        "subsections": []
      }
    ],
    "definitions": {
      "Affiliate": {
        "term": "Affiliate",
        "definition": "means a legal entity that controls, is controlled by, or is under common control with another legal entity or shares common branding with another legal entity. For the purposes of this definition, 'control' or 'controlled' means: (a) Ownership of, or the power to vote, more than fifty percent of the outstanding shares of any class of voting security of a company. (b) Control in any manner over the election of a majority of the directors or of individuals exercising similar functions. (c) The power to exercise controlling influence over the management of a company.",
        "section": "715D.1",
        "notes": ""
      },
      "Aggregate data": {
        "term": "Aggregate data",
        "definition": "means information that relates to a group or category of consumers, from which individual consumer identities have been removed, that is not linked or reasonably linkable to any consumer.",
        "section": "715D.1",
        "notes": ""
      },
      "Authenticate": {
        "term": "Authenticate",
        "definition": "means verifying through reasonable means that a consumer, entitled to exercise their consumer rights in section 715D.3, is the same consumer exercising such consumer rights with respect to the personal data at issue.",
        "section": "715D.1",
        "notes": ""
      },
      "Biometric data": {
        "term": "Biometric data",
        "definition": "means data generated by automatic measurements of an individual's biological characteristics, such as a fingerprint, voiceprint, eye retinas, irises, or other unique biological patterns or characteristics that is used to identify a specific individual. 'Biometric data' does not include a physical or digital photograph, a video or audio recording or data generated therefrom, or information collected, used, or stored for health care treatment, payment or operations under HIPAA.",
        "section": "715D.1",
        "notes": ""
      },
      "Child": {
        "term": "Child",
        "definition": "means any natural person younger than thirteen years of age.",
        "section": "715D.1",
        "notes": ""
      },
      "Consent": {
        "term": "Consent",
        "definition": "means a clear affirmative act signifying a consumer's freely given, specific, informed, and unambiguous agreement to process personal data relating to the consumer. 'Consent' may include a written statement, including a statement written by electronic means, or any other unambiguous affirmative action.",
        "section": "715D.1",
        "notes": ""
      },
      "Consumer": {
        "term": "Consumer",
        "definition": "means a natural person who is a resident of the state acting only in an individual or household context and excluding a natural person acting in a commercial or employment context.",
        "section": "715D.1",
        "notes": ""
      },
      "Controller": {
        "term": "Controller",
        "definition": "means a person that, alone or jointly with others, determines the purpose and means of processing personal data.",
        "section": "715D.1",
        "notes": ""
      },
      "Covered entity": {
        "term": "Covered entity",
        "definition": "means the same as 'covered entity' defined by HIPAA.",
        "section": "715D.1",
        "notes": ""
      },
      "De-identified data": {
        "term": "De-identified data",
        "definition": "means data that cannot reasonably be linked to an identified or identifiable natural person.",
        "section": "715D.1",
        "notes": ""
      },
      "Fund": {
        "term": "Fund",
        "definition": "means the consumer education and litigation fund established pursuant to section 714.16C.",
        "section": "715D.1",
        "notes": ""
      },
      "Health care provider": {
        "term": "Health care provider",
        "definition": "means any of the following: (a) A general hospital, ambulatory surgical or treatment center, skilled nursing center, or assisted living center licensed or certified by the state. (b) A psychiatric hospital licensed by the state. (c) A hospital operated by the state. (d) A hospital operated by the state board of regents. (e) A person licensed to practice medicine or osteopathy in the state. (f) A person licensed to furnish health care policies or plans in the state. (g) A person licensed to practice dentistry in the state. (h) 'Health care provider' does not include a continuing care retirement community or any nursing facility of a religious body which depends upon prayer alone for healing.",
        "section": "715D.1",
        "notes": ""
      },
      "Health Insurance Portability and Accountability Act or HIPAA": {
        "term": "Health Insurance Portability and Accountability Act or HIPAA",
        "definition": "means the federal Health Insurance Portability and Accountability Act of 1996, Pub. L. No. 104-191, including amendments thereto and regulations promulgated thereunder.",
        "section": "715D.1",
        "notes": ""
      },
      "Health record": {
        "term": "Health record",
        "definition": "means any written, printed, or electronically recorded material maintained by a health care provider in the course of providing health services to an individual concerning the individual and the services provided, including related health information provided in confidence to a health care provider.",
        "section": "715D.1",
        "notes": ""
      },
      "Identified or identifiable natural person": {
        "term": "Identified or identifiable natural person",
        "definition": "means a person who can be readily identified, directly or indirectly.",
        "section": "715D.1",
        "notes": ""
      },
      "Institution of higher education": {
        "term": "Institution of higher education",
        "definition": "means nonprofit private institutions of higher education and proprietary private institutions of higher education in the state, community colleges, and each associate-degree-granting and baccalaureate public institutions of higher education in the state.",
        "section": "715D.1",
        "notes": ""
      },
      "Nonprofit organization": {
        "term": "Nonprofit organization",
        "definition": "means any corporation organized under chapter 504, any organization exempt from taxation under sections 501(c)(3), 501(c)(6), or 501(c)(12) of the Internal Revenue Code, any organization exempt from taxation under section 501(c)(4) of the Internal Revenue Code that is established to detect or prevent insurance-related crime or fraud, and any subsidiaries and affiliates of entities organized pursuant to chapter 499.",
        "section": "715D.1",
        "notes": ""
      },
      "Personal data": {
        "term": "Personal data",
        "definition": "means any information that is linked or reasonably linkable to an identified or identifiable natural person. 'Personal data' does not include de-identified or aggregate data or publicly available information.",
        "section": "715D.1",
        "notes": ""
      },
      "Precise geolocation data": {
        "term": "Precise geolocation data",
        "definition": "means information derived from technology, including but not limited to global positioning system level latitude and longitude coordinates or other mechanisms, that identifies the specific location of a natural person with precision and accuracy within a radius of one thousand seven hundred fifty feet. 'Precise geolocation data' does not include the content of communications, or any data generated by or connected to utility metering infrastructure systems or equipment for use by a utility.",
        "section": "715D.1",
        "notes": ""
      },
      "Process or processing": {
        "term": "Process or processing",
        "definition": "means any operation or set of operations performed, whether by manual or automated means, on personal data or on sets of personal data, such as the collection, use, storage, disclosure, analysis, deletion, or modification of personal data.",
        "section": "715D.1",
        "notes": ""
      },
      "Processor": {
        "term": "Processor",
        "definition": "means a person that processes personal data on behalf of a controller.",
        "section": "715D.1",
        "notes": ""
      },
      "Protected health information": {
        "term": "Protected health information",
        "definition": "means the same as protected health information established by HIPAA.",
        "section": "715D.1",
        "notes": ""
      },
      "Pseudonymous data": {
        "term": "Pseudonymous data",
        "definition": "means personal data that cannot be attributed to a specific natural person without the use of additional information, provided that such additional information is kept separately and is subject to appropriate technical and organizational measures to ensure that the personal data is not attributed to an identified or identifiable natural person.",
        "section": "715D.1",
        "notes": ""
      },
      "Publicly available information": {
        "term": "Publicly available information",
        "definition": "means information that is lawfully made available through federal, state, or local government records, or information that a business has reasonable basis to believe is lawfully made available to the general public through widely distributed media, by the consumer, or by a person to whom the consumer has disclosed the information, unless the consumer has restricted the information to a specific audience.",
        "section": "715D.1",
        "notes": ""
      },
      "Sale of personal data": {
        "term": "Sale of personal data",
        "definition": "means the exchange of personal data for monetary consideration by the controller to a third party. 'Sale of personal data' does not include: (a) The disclosure of personal data to a processor that processes the personal data on behalf of the controller. (b) The disclosure of personal data to a third party for purposes of providing a product or service requested by the consumer or a parent of a child. (c) The disclosure or transfer of personal data to an affiliate of the controller. (d) The disclosure of information that the consumer intentionally made available to the general public via a channel of mass media and did not restrict to a specific audience. (e) The disclosure or transfer of personal data when a consumer uses or directs a controller to intentionally disclose personal data or intentionally interact with one or more third parties. (f) The disclosure or transfer of personal data to a third party as an asset that is part of a proposed or actual merger, acquisition, bankruptcy, or other transaction in which the third party assumes control of all or part of the controller's assets.",
        "section": "715D.1",
        "notes": ""
      },
      "Sensitive data": {
        "term": "Sensitive data",
        "definition": "means a category of personal data that includes the following: (a) Racial or ethnic origin, religious beliefs, mental or physical health diagnosis, sexual orientation, or citizenship or immigration status, except to the extent such data is used in order to avoid discrimination on the basis of a protected class that would violate a federal or state anti-discrimination law. (b) Genetic or biometric data that is processed for the purpose of uniquely identifying a natural person. (c) The personal data collected from a known child. (d) Precise geolocation data.",
        "section": "715D.1",
        "notes": ""
      },
      "State agency": {
        "term": "State agency",
        "definition": "means the same as defined in 129 IAC 10.2(8B).",
        "section": "715D.1",
        "notes": ""
      },
      "Targeted advertising": {
        "term": "Targeted advertising",
        "definition": "means displaying advertisements to a consumer where the advertisement is selected based on personal data obtained from that consumer's activities over time and across nonaffiliated websites or online applications to predict such consumer's preferences or interests. 'Targeted advertising' does not include the following: (a) Advertisements based on activities within a controller's own or affiliated websites or online applications. (b) Advertisements based on the context of a consumer's current search query, visit to a website, or online application. (c) Advertisements directed to a consumer in response to the consumer's request for information or feedback. (d) Processing personal data solely for measuring or reporting advertising performance, reach, or frequency.",
        "section": "715D.1",
        "notes": ""
      },
      "Third party": {
        "term": "Third party",
        "definition": "means a natural or legal person, public authority, agency, or body other than the consumer, controller, processor, or an affiliate of the processor or the controller.",
        "section": "715D.1",
        "notes": ""
      },
      "Trade secret": {
        "term": "Trade secret",
        "definition": "means information, including but not limited to a formula, pattern, compilation, program, device, method, technique, or process, that consists of the following: (a) Information that derives independent economic value, actual or potential, from not being generally known to, and not being readily ascertainable by proper means by, other persons who can obtain economic value from its disclosure or use. (b) Information that is the subject of efforts that are reasonable under the circumstances to maintain its secrecy.",
        "section": "715D.1",
        "notes": ""
      }
    }
  }
}